{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"rp-prep.ipynb","provenance":[],"collapsed_sections":[],"authorship_tag":"ABX9TyMbHEj88Wcm2vFUK6q47ILS"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"code","metadata":{"id":"5iWlzKTUIMwH"},"source":["trainingUrl=\"https://github.com/ag-sc/QALD/blob/master/9/data/qald-9-train-multilingual.json?raw=true\"\n","testUrl=\"https://raw.githubusercontent.com/ag-sc/QALD/master/9/data/qald-9-test-multilingual.json\""],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"TAOdmmAGP7Rr"},"source":["from urllib.request import urlopen\n","import json\n","import pandas as pd\n","import numpy as np"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"svHLMUTTP8-C"},"source":["response = urlopen(testUrl)\n","json_data = response.read().decode('utf-8', 'replace')\n","d = json.loads(json_data)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"rr_ENHrtQICC"},"source":["df = pd.json_normalize(d[\"questions\"]).set_index('id')"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":225},"id":"IpHGoQPOQ46F","executionInfo":{"status":"ok","timestamp":1610646604222,"user_tz":-60,"elapsed":1746,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"bedebe3c-8f41-4563-fa2d-ad270f450cd6"},"source":["df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>99</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>[{'language': 'de', 'string': 'In welcher Zeit...</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PRE...</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>[{'language': 'de', 'string': 'Wer hat Caesar ...</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX...</td>\n","    </tr>\n","    <tr>\n","      <th>86</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>[{'language': 'de', 'string': 'Was ist das höc...</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-sc...</td>\n","    </tr>\n","    <tr>\n","      <th>84</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>[{'language': 'de', 'string': 'Welche Amerikan...</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PRE...</td>\n","    </tr>\n","    <tr>\n","      <th>81</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>[{'language': 'de', 'string': 'Von welchem US-...</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>SELECT DISTINCT ?uri WHERE { ?uri a &lt;http://db...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   answertype  ...                                       query.sparql\n","id             ...                                                   \n","99   resource  ...  PREFIX res: <http://dbpedia.org/resource/> PRE...\n","98   resource  ...  PREFIX dct: <http://purl.org/dc/terms/> PREFIX...\n","86   resource  ...  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-sc...\n","84   resource  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PRE...\n","81   resource  ...  SELECT DISTINCT ?uri WHERE { ?uri a <http://db...\n","\n","[5 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":5}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"vvD3tY3WUYzE","executionInfo":{"status":"ok","timestamp":1610646604223,"user_tz":-60,"elapsed":1737,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"e27432a5-0ec8-487d-869d-5153fd57bca5"},"source":["df.iloc[1]"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["answertype                                               resource\n","aggregation                                                 False\n","onlydbo                                                     False\n","hybrid                                                      False\n","question        [{'language': 'de', 'string': 'Wer hat Caesar ...\n","answers         [{'head': {'vars': ['uri']}, 'results': {'bind...\n","query.sparql    PREFIX dct: <http://purl.org/dc/terms/> PREFIX...\n","Name: 98, dtype: object"]},"metadata":{"tags":[]},"execution_count":6}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"veBGWMTAYOdr","executionInfo":{"status":"ok","timestamp":1610646604224,"user_tz":-60,"elapsed":1730,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"ce475444-c9c4-4e60-ef0d-45260c26cd44"},"source":["df.iloc[1].answers"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'head': {'vars': ['uri']},\n","  'results': {'bindings': [{'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Marcus_Junius_Brutus_the_Younger'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Gaius_Cassius_Parmensis'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Lucius_Minucius_Basilus'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Gaius_Cassius_Longinus'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Decimus_Junius_Brutus_Albinus'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Servilius_Casca'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Tillius_Cimber'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Lucius_Cornelius_Cinna_(suffect_consul)'}},\n","    {'uri': {'type': 'uri',\n","      'value': 'http://dbpedia.org/resource/Quintus_Antistius_Labeo'}}]}}]"]},"metadata":{"tags":[]},"execution_count":7}]},{"cell_type":"code","metadata":{"id":"nMjL3vKpjlHu"},"source":["from itertools import compress"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"PUeEX7rycW2j","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1610646604225,"user_tz":-60,"elapsed":1722,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"fdc17d4c-c9b8-4d2c-b776-2a0bb7328df0"},"source":[" df.question.apply(lambda x: [z['language']=='en' for z in x])"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["id\n","99     [False, False, False, True, False, False, Fals...\n","98     [False, False, False, False, True, False, Fals...\n","86     [False, False, False, False, True, False, Fals...\n","84     [False, False, False, False, True, False, Fals...\n","81     [False, False, False, False, True, False, Fals...\n","                             ...                        \n","14     [False, False, False, False, True, False, Fals...\n","87     [False, False, False, True, False, False, Fals...\n","148    [False, False, False, False, True, False, Fals...\n","43     [False, False, False, False, True, False, Fals...\n","179    [False, False, False, False, True, False, Fals...\n","Name: question, Length: 150, dtype: object"]},"metadata":{"tags":[]},"execution_count":9}]},{"cell_type":"code","metadata":{"id":"oeLCdxRGkbNh"},"source":["df.question = df.question.apply(lambda x: [z['string'] for z in x if z['language']=='en'][0])"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":225},"id":"XIuvFnOoXSWi","executionInfo":{"status":"ok","timestamp":1610646604622,"user_tz":-60,"elapsed":2109,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"ae187198-25d2-42d6-d703-665d9f0aa5f2"},"source":["df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>99</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>What is the time zone of Salt Lake City?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PRE...</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Who killed Caesar?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX...</td>\n","    </tr>\n","    <tr>\n","      <th>86</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>What is the highest mountain in Germany?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-sc...</td>\n","    </tr>\n","    <tr>\n","      <th>84</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Which American presidents were in office durin...</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PRE...</td>\n","    </tr>\n","    <tr>\n","      <th>81</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Butch Otter is the governor of which U.S. state?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bind...</td>\n","      <td>SELECT DISTINCT ?uri WHERE { ?uri a &lt;http://db...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   answertype  ...                                       query.sparql\n","id             ...                                                   \n","99   resource  ...  PREFIX res: <http://dbpedia.org/resource/> PRE...\n","98   resource  ...  PREFIX dct: <http://purl.org/dc/terms/> PREFIX...\n","86   resource  ...  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-sc...\n","84   resource  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PRE...\n","81   resource  ...  SELECT DISTINCT ?uri WHERE { ?uri a <http://db...\n","\n","[5 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":11}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"JUjgDjQ4YOH1","executionInfo":{"status":"ok","timestamp":1610646604623,"user_tz":-60,"elapsed":2101,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"82266dcf-0a2f-4251-9239-d66fc8543630"},"source":["df.apply(lambda x: str(x.answers[0]['head']), axis=1).value_counts()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'vars': ['uri']}       102\n","{'vars': ['c']}          18\n","{'vars': ['string']}     14\n","{'vars': ['date']}       12\n","{}                        4\n","dtype: int64"]},"metadata":{"tags":[]},"execution_count":12}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"1J2sOdv_KUxf","executionInfo":{"status":"ok","timestamp":1610646604625,"user_tz":-60,"elapsed":2096,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"58325325-0cea-4e3e-c180-a3036a42169f"},"source":["df.answertype.value_counts()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["resource    102\n","number       18\n","string       14\n","date         12\n","boolean       4\n","Name: answertype, dtype: int64"]},"metadata":{"tags":[]},"execution_count":13}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":195},"id":"Ed2tQD_rbz3Q","executionInfo":{"status":"ok","timestamp":1610646604625,"user_tz":-60,"elapsed":2088,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"c0f75bd4-00ce-4439-b704-b7f7b9e8262d"},"source":["df[df.apply(lambda x: '{}' in str(x.answers[0]['head']), axis=1)]"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>6</th>\n","      <td>boolean</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>Are Taiko some kind of Japanese musical instru...</td>\n","      <td>[{'head': {}, 'results': {}, 'boolean': True}]</td>\n","      <td>ASK WHERE { &lt;http://dbpedia.org/resource/Taiko...</td>\n","    </tr>\n","    <tr>\n","      <th>117</th>\n","      <td>boolean</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Is Pamela Anderson a vegan?</td>\n","      <td>[{'head': {}, 'results': {}, 'boolean': True}]</td>\n","      <td>PREFIX dbr: &lt;http://dbpedia.org/resource/&gt; ASK...</td>\n","    </tr>\n","    <tr>\n","      <th>79</th>\n","      <td>boolean</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Are there any castles in the United States?</td>\n","      <td>[{'head': {}, 'results': {}, 'boolean': True}]</td>\n","      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX...</td>\n","    </tr>\n","    <tr>\n","      <th>92</th>\n","      <td>boolean</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>Is the wife of President Obama called Michelle?</td>\n","      <td>[{'head': {}, 'results': {}, 'boolean': True}]</td>\n","      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PRE...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["    answertype  ...                                       query.sparql\n","id              ...                                                   \n","6      boolean  ...  ASK WHERE { <http://dbpedia.org/resource/Taiko...\n","117    boolean  ...  PREFIX dbr: <http://dbpedia.org/resource/> ASK...\n","79     boolean  ...  PREFIX dct: <http://purl.org/dc/terms/> PREFIX...\n","92     boolean  ...  PREFIX res: <http://dbpedia.org/resource/> PRE...\n","\n","[4 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":14}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"nfFuuMLPR8uE","executionInfo":{"status":"ok","timestamp":1610648620971,"user_tz":-60,"elapsed":620,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"56ecb758-c715-4575-b4df-1586962d04d1"},"source":["df[df.apply(lambda x: '{}' in str(x.answers[0]['head']), axis=1)].answers[0][0]"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'boolean': True, 'head': {}, 'results': {}}"]},"metadata":{"tags":[]},"execution_count":58}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"0UDZgWShI56K","executionInfo":{"status":"ok","timestamp":1610648630303,"user_tz":-60,"elapsed":410,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"516a1860-25ad-4119-dc51-937a1ae78887"},"source":["'boolean' in df[df.apply(lambda x: '{}' in str(x.answers[0]['head']), axis=1)].answers[0][0]"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["True"]},"metadata":{"tags":[]},"execution_count":59}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"hPOi9Ss3Hr1o","executionInfo":{"status":"ok","timestamp":1610646604627,"user_tz":-60,"elapsed":2073,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"eefabfc9-0aed-4bc4-fd83-28228c96ace1"},"source":["pd.options.display.max_colwidth = 150\n","df[df.apply(lambda x: '{\\'vars\\': [\\'date\\']}' in str(x.answers[0]['head']), axis=1)].answers"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["id\n","173                                          [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1995-01-01'}}]}}]\n","124                                                                                                            [{'head': {'vars': ['date']}, 'results': {}}]\n","135                                           [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '2009-6-25'}}]}}]\n","102                                          [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1912-04-20'}}]}}]\n","51                                           [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '2008-01-30'}}]}}]\n","108    [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1811-05-14'}}, {'date': {'type': 'literal', 'value':...\n","82                                           [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1981-01-01'}}]}}]\n","201                                          [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1842-01-01'}}]}}]\n","171                                          [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1773-12-16'}}]}}]\n","175                                          [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '0632-06-08'}}]}}]\n","78                                           [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1888-01-01'}}]}}]\n","94                                           [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1997-08-31'}}]}}]\n","Name: answers, dtype: object"]},"metadata":{"tags":[]},"execution_count":16}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Wvv2W9ObLq4V","executionInfo":{"status":"ok","timestamp":1610646604627,"user_tz":-60,"elapsed":2065,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"816b20a0-5a01-418e-b013-be40d4c39a2f"},"source":["df[df.apply(lambda x: '{\\'vars\\': [\\'string\\']}' in str(x.answers[0]['head']), axis=1)].answers[0]"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'head': {'vars': ['string']},\n","  'results': {'bindings': [{'string': {'type': 'literal',\n","      'value': 'Novelist'}}]}}]"]},"metadata":{"tags":[]},"execution_count":17}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":35},"id":"vLdrbuTAMEBZ","executionInfo":{"status":"ok","timestamp":1610646604628,"user_tz":-60,"elapsed":2057,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"f9b4bdd5-8cb5-4aae-a0db-e63317dbd150"},"source":["df[df.apply(lambda x: '{\\'vars\\': [\\'string\\']}' in str(x.answers[0]['head']), axis=1)].answers[0][0]['results']['bindings'][0]['string']['value']"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"},"text/plain":["'Novelist'"]},"metadata":{"tags":[]},"execution_count":18}]},{"cell_type":"code","metadata":{"id":"iEnbqkRKIxA2","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1610646604628,"user_tz":-60,"elapsed":2055,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"b9641001-3897-4312-99fa-a384940d0ef0"},"source":["df.iloc[108]"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["answertype                                                                                                                                                       date\n","aggregation                                                                                                                                                     False\n","onlydbo                                                                                                                                                          True\n","hybrid                                                                                                                                                          False\n","question                                                                                                                 When did Paraguay proclaim its independence?\n","answers         [{'head': {'vars': ['date']}, 'results': {'bindings': [{'date': {'type': 'literal', 'value': '1811-05-14'}}, {'date': {'type': 'literal', 'value':...\n","query.sparql                                  SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Paraguay> <http://dbpedia.org/ontology/foundingDate> ?date }\n","Name: 108, dtype: object"]},"metadata":{"tags":[]},"execution_count":19}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"C_Mn-7goJO4B","executionInfo":{"status":"ok","timestamp":1610646604629,"user_tz":-60,"elapsed":2049,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"5c761e6a-2bbd-4825-d34e-bb9716d27f39"},"source":["df.iloc[108].answers"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'head': {'vars': ['date']},\n","  'results': {'bindings': [{'date': {'type': 'literal',\n","      'value': '1811-05-14'}},\n","    {'date': {'type': 'literal', 'value': '1811-05-15'}}]}}]"]},"metadata":{"tags":[]},"execution_count":20}]},{"cell_type":"code","metadata":{"id":"IUDUYOEbNHL5","colab":{"base_uri":"https://localhost:8080/","height":35},"executionInfo":{"status":"ok","timestamp":1610646604630,"user_tz":-60,"elapsed":2048,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"77d1ab82-0c81-46fd-a735-cea7edfc29c4"},"source":["df.iloc[108].answers[0]['results']['bindings'][0]['date']['value']"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"},"text/plain":["'1811-05-14'"]},"metadata":{"tags":[]},"execution_count":21}]},{"cell_type":"code","metadata":{"id":"3ueoMJTGJWTI","colab":{"base_uri":"https://localhost:8080/","height":140},"executionInfo":{"status":"ok","timestamp":1610646604630,"user_tz":-60,"elapsed":2047,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"418747d1-e305-4287-83f7-8ea8afa2db7a"},"source":["df[df.apply(lambda x: '{\\'vars\\': [\\'c\\']}' in str(x.answers[0]['head']), axis=1)].head(1)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>73</th>\n","      <td>number</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>How many gold medals did Michael Phelps win at the 2008 Olympics?</td>\n","      <td>[{'head': {'vars': ['c']}, 'results': {'bindings': [{'c': {'type': 'literal', 'value': '8'}}]}}]</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX dbr: &lt;http://dbpedia.org/resource/&gt; PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; PR...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   answertype  ...                                                                                                                                           query.sparql\n","id             ...                                                                                                                                                       \n","73     number  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PR...\n","\n","[1 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":22}]},{"cell_type":"code","metadata":{"id":"KhcIsGl_NfpF","colab":{"base_uri":"https://localhost:8080/","height":35},"executionInfo":{"status":"ok","timestamp":1610646604631,"user_tz":-60,"elapsed":2047,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"238e5390-65d5-490e-e96f-8d46eae689c9"},"source":["df[df.apply(lambda x: '{\\'vars\\': [\\'c\\']}' in str(x.answers[0]['head']), axis=1)].answers[0][0]['results']['bindings'][0]['c']['value']"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"},"text/plain":["'8'"]},"metadata":{"tags":[]},"execution_count":23}]},{"cell_type":"code","metadata":{"id":"7qYgfexcJ4oK","colab":{"base_uri":"https://localhost:8080/","height":410},"executionInfo":{"status":"ok","timestamp":1610646604631,"user_tz":-60,"elapsed":2045,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"0b475dee-ab39-4711-8280-00dfa6a11a49"},"source":["df[df.apply(lambda x: '{\\'vars\\': [\\'uri\\']}' in str(x.answers[0]['head']), axis=1)].head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>99</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>What is the time zone of Salt Lake City?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Mountain_Time_Zone'}}]}}]</td>\n","      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX dbp: &lt;http://dbpedia.org/property/&gt; SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City &lt;http://dbpe...</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Who killed Caesar?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Marcus_Junius_Brutus_the_Young...</td>\n","      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX dbc: &lt;http://dbpedia.org/resource/Category:&gt; SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assa...</td>\n","    </tr>\n","    <tr>\n","      <th>86</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>What is the highest mountain in Germany?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Zugspitze'}}]}}]</td>\n","      <td>PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; PREFIX onto: &lt;http://dbpedia.org/on...</td>\n","    </tr>\n","    <tr>\n","      <th>84</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Which American presidents were in office during the Vietnam War?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/John_F._Kennedy'}}, {'uri': {'...</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX dbc: &lt;http://...</td>\n","    </tr>\n","    <tr>\n","      <th>81</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Butch Otter is the governor of which U.S. state?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Idaho'}}]}}]</td>\n","      <td>SELECT DISTINCT ?uri WHERE { ?uri a &lt;http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates&gt; ; &lt;http://dbpedia.org/property/governor&gt; &lt;http:...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   answertype  ...                                                                                                                                           query.sparql\n","id             ...                                                                                                                                                       \n","99   resource  ...  PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City <http://dbpe...\n","98   resource  ...  PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assa...\n","86   resource  ...  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX onto: <http://dbpedia.org/on...\n","84   resource  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://...\n","81   resource  ...  SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/governor> <http:...\n","\n","[5 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":24}]},{"cell_type":"code","metadata":{"id":"JD1bSLlwKur2","colab":{"base_uri":"https://localhost:8080/","height":52},"executionInfo":{"status":"ok","timestamp":1610646604632,"user_tz":-60,"elapsed":2045,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"596389a5-d9d4-40f9-ec8e-677ffa2e3fae"},"source":["df[df.apply(lambda x: '{\\'vars\\': [\\'uri\\']}' in str(x.answers[0]['head']), axis=1)].iloc[0]['query.sparql']"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"},"text/plain":["'PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City <http://dbpedia.org/ontology/timeZone> ?uri }'"]},"metadata":{"tags":[]},"execution_count":25}]},{"cell_type":"code","metadata":{"id":"seOyPbO4RjPZ","colab":{"base_uri":"https://localhost:8080/","height":35},"executionInfo":{"status":"ok","timestamp":1610646604632,"user_tz":-60,"elapsed":2043,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"97b63043-db04-4d7e-9623-042885fd2275"},"source":["df.iloc[0].answers[0]['results']['bindings'][0]['uri']['value']"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"},"text/plain":["'http://dbpedia.org/resource/Mountain_Time_Zone'"]},"metadata":{"tags":[]},"execution_count":26}]},{"cell_type":"code","metadata":{"id":"w0g8PEoZLOqd"},"source":["# if x.answertype=='resource': x.answers = x.answers[0]['results']['bindings'][0]['uri']['value']\n","# elif x.answertype=='number': x.answers = x.answers[0]['results']['bindings'][0]['c']['value']\n","# elif x.answertype=='string': x.answers = x.answers[0][0]['results']['bindings'][0]['string']['value']\n","# elif x.answertype=='date':   x.answers = x.answers[0]['results']['bindings'][0]['date']['value']\n","# elif x.answertype=='boolean': x.answers = x.answers[0].boolean"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":140},"id":"bmhcGv9dwz07","executionInfo":{"status":"ok","timestamp":1610646929823,"user_tz":-60,"elapsed":447,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"496fda8c-4b0a-4099-c3fe-610ea6395161"},"source":["df.head(1)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>99</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>What is the time zone of Salt Lake City?</td>\n","      <td>[{'head': {'vars': ['uri']}, 'results': {'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Mountain_Time_Zone'}}]}}]</td>\n","      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX dbp: &lt;http://dbpedia.org/property/&gt; SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City &lt;http://dbpe...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   answertype  ...                                                                                                                                           query.sparql\n","id             ...                                                                                                                                                       \n","99   resource  ...  PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City <http://dbpe...\n","\n","[1 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":38}]},{"cell_type":"code","metadata":{"id":"jnrrwX6VxCyI"},"source":["def findResult(answer):\n","  try: \n","    if 'boolean' in str(answer): return answer['boolean']\n","    else: return answer['results']['bindings'][0][answer['head']['vars'][0]]['value']\n","  except: \n","    print('Failure - Returning None:' + str(answer));return None"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":35},"id":"rGgoMWL9xtVd","executionInfo":{"status":"ok","timestamp":1610648668576,"user_tz":-60,"elapsed":422,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"afb527fb-17d7-4290-81eb-0d05741777b7"},"source":["findResult(df.iloc[99].answers[0])"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"},"text/plain":["'\"No-One Could Ever Love You More\" (Norway)'"]},"metadata":{"tags":[]},"execution_count":62}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"8DtwlqIgIQvO","executionInfo":{"status":"ok","timestamp":1610648688852,"user_tz":-60,"elapsed":760,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"eb2b2bb2-fd3c-4d8b-b9a3-e3f11c2f0c84"},"source":["findResult(df[df.apply(lambda x: '{}' in str(x.answers[0]['head']), axis=1)].iloc[0].answers[0])"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["True"]},"metadata":{"tags":[]},"execution_count":64}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"pAlYlKQdwbRF","executionInfo":{"status":"ok","timestamp":1610648763055,"user_tz":-60,"elapsed":439,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"9a52b8e3-241d-4040-c3a3-3dd9df816960"},"source":["x= df.answers.apply(lambda x: findResult(x[0]))"],"execution_count":null,"outputs":[{"output_type":"stream","text":["Failure - Returning None:{'head': {'vars': ['date']}, 'results': {}}\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"LPBH-QGDJUdj"},"source":["df.answers = x"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":203},"id":"pm9ohRiG0cOs","executionInfo":{"status":"ok","timestamp":1610648796514,"user_tz":-60,"elapsed":779,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"2cabfb45-5700-4ec6-847f-9b47c94b5498"},"source":["df.head(2)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>99</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>True</td>\n","      <td>False</td>\n","      <td>What is the time zone of Salt Lake City?</td>\n","      <td>http://dbpedia.org/resource/Mountain_Time_Zone</td>\n","      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX dbp: &lt;http://dbpedia.org/property/&gt; SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City &lt;http://dbpe...</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Who killed Caesar?</td>\n","      <td>http://dbpedia.org/resource/Marcus_Junius_Brutus_the_Younger</td>\n","      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX dbc: &lt;http://dbpedia.org/resource/Category:&gt; SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assa...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   answertype  ...                                                                                                                                           query.sparql\n","id             ...                                                                                                                                                       \n","99   resource  ...  PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Salt_Lake_City <http://dbpe...\n","98   resource  ...  PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assa...\n","\n","[2 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":73}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"o4TLQEat1gE5","executionInfo":{"status":"ok","timestamp":1610648796515,"user_tz":-60,"elapsed":764,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"8c287383-b676-4d86-ccb5-6523ef3ed968"},"source":["(df['hybrid']==True).value_counts()\n","# hybrid is useless"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["False    150\n","Name: hybrid, dtype: int64"]},"metadata":{"tags":[]},"execution_count":74}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ZDcYdX-21uPK","executionInfo":{"status":"ok","timestamp":1610648796516,"user_tz":-60,"elapsed":753,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"a42012dc-8d1f-4b76-8e30-952b7929e7c7"},"source":["(df['onlydbo']==True).value_counts()\n","# hybrid is useless"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["True     120\n","False     30\n","Name: onlydbo, dtype: int64"]},"metadata":{"tags":[]},"execution_count":75}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":443},"id":"1To1l63R0icZ","executionInfo":{"status":"ok","timestamp":1610648796516,"user_tz":-60,"elapsed":744,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"c6ac22e8-bb8a-4acc-f438-84d8d9379839"},"source":["df.groupby(['onlydbo']).get_group(False).head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>answertype</th>\n","      <th>aggregation</th>\n","      <th>onlydbo</th>\n","      <th>hybrid</th>\n","      <th>question</th>\n","      <th>answers</th>\n","      <th>query.sparql</th>\n","    </tr>\n","    <tr>\n","      <th>id</th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>98</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Who killed Caesar?</td>\n","      <td>http://dbpedia.org/resource/Marcus_Junius_Brutus_the_Younger</td>\n","      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX dbc: &lt;http://dbpedia.org/resource/Category:&gt; SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assa...</td>\n","    </tr>\n","    <tr>\n","      <th>84</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Which American presidents were in office during the Vietnam War?</td>\n","      <td>http://dbpedia.org/resource/John_F._Kennedy</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX dbc: &lt;http://...</td>\n","    </tr>\n","    <tr>\n","      <th>81</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Butch Otter is the governor of which U.S. state?</td>\n","      <td>http://dbpedia.org/resource/Idaho</td>\n","      <td>SELECT DISTINCT ?uri WHERE { ?uri a &lt;http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates&gt; ; &lt;http://dbpedia.org/property/governor&gt; &lt;http:...</td>\n","    </tr>\n","    <tr>\n","      <th>44</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Which European countries have a constitutional monarchy?</td>\n","      <td>http://dbpedia.org/resource/Sweden</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX dbc: &lt;http://dbpedia.org/resource/Category:&gt; PREFIX dbr:...</td>\n","    </tr>\n","    <tr>\n","      <th>210</th>\n","      <td>resource</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>False</td>\n","      <td>Which monarchs of the United Kingdom were married to a German?</td>\n","      <td>http://dbpedia.org/resource/William_IV_of_the_United_Kingdom</td>\n","      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX yago: &lt;http://dbpedia.org/class/yago/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX rdf: &lt;h...</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["    answertype  ...                                                                                                                                           query.sparql\n","id              ...                                                                                                                                                       \n","98    resource  ...  PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assa...\n","84    resource  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://...\n","81    resource  ...  SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/governor> <http:...\n","44    resource  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dbr:...\n","210   resource  ...  PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <h...\n","\n","[5 rows x 7 columns]"]},"metadata":{"tags":[]},"execution_count":76}]},{"cell_type":"code","metadata":{"id":"6ZF_aVoKA0yA"},"source":["def rmPrefix(x):\n","  return x[x.find(\"SELECT\"):]"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"sUHJFE5pA0q2"},"source":["df['purequery']=df['query.sparql'].apply(lambda x: rmPrefix(x))"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4D7mO4NG0iVv","executionInfo":{"status":"ok","timestamp":1610648813872,"user_tz":-60,"elapsed":18073,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"0f10c213-4e7f-41bd-8ca7-5ac5112ac4cc"},"source":["from google.colab import drive\n","drive.mount('drive')"],"execution_count":null,"outputs":[{"output_type":"stream","text":["Mounted at drive\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"sK5HxQqR3BIk"},"source":["df.to_csv('train9-prep.csv')\n","!cp train9-prep.csv \"drive/My Drive/\""],"execution_count":null,"outputs":[]}]}