{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"try-tree-sitter.ipynb","provenance":[],"authorship_tag":"ABX9TyMa0IKoPxt0+g+nZFC8mLMZ"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"kXhd5s8lWDS6","executionInfo":{"status":"ok","timestamp":1621179718065,"user_tz":-120,"elapsed":3431,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"d1fb9b93-51bb-470c-ffef-3fcfd5b75a11"},"source":["!pip install tree_sitter -qqq\n","!git clone https://github.com/BonaBeavis/tree-sitter-sparql"],"execution_count":35,"outputs":[{"output_type":"stream","text":["fatal: destination path 'tree-sitter-sparql' already exists and is not an empty directory.\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"Ci2sdC0xyLeS","executionInfo":{"status":"ok","timestamp":1621179718065,"user_tz":-120,"elapsed":3419,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}}},"source":["from tree_sitter import Language, Parser\n","\n","Language.build_library(\n","  'build/my-languages.so',\n","  ['tree-sitter-sparql']\n",")\n","\n","SPARQL_LANGUAGE = Language('build/my-languages.so', 'sparql')\n","parser = Parser()\n","parser.set_language(SPARQL_LANGUAGE)"],"execution_count":36,"outputs":[]},{"cell_type":"code","metadata":{"id":"MgR59ORpyeGv","executionInfo":{"status":"ok","timestamp":1621179718066,"user_tz":-120,"elapsed":3417,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}}},"source":["code = 'PREFIX foaf:  <http://xmlns.com/foaf/0.1/> SELECT ?name WHERE { ?person foaf:name ?name . }'"],"execution_count":37,"outputs":[]},{"cell_type":"code","metadata":{"id":"ZZRUwY_jySkB","executionInfo":{"status":"ok","timestamp":1621179718066,"user_tz":-120,"elapsed":3415,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}}},"source":["tree = parser.parse(bytes(code, \"utf8\"))"],"execution_count":38,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ghW_66oRyvbz","executionInfo":{"status":"ok","timestamp":1621179718449,"user_tz":-120,"elapsed":3794,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"8738f1c8-1f97-4fb6-9247-9b37d3c1c5fc"},"source":["tree.root_node.children"],"execution_count":39,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[<Node kind=prologue, start_point=(0, 0), end_point=(0, 42)>,\n"," <Node kind=select_query, start_point=(0, 43), end_point=(0, 91)>]"]},"metadata":{"tags":[]},"execution_count":39}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"vJFyCRuny8QK","executionInfo":{"status":"ok","timestamp":1621179718449,"user_tz":-120,"elapsed":3791,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"c5e2597b-218b-4a98-e02a-37de3aa55b07"},"source":["tree.root_node.children[1].children"],"execution_count":40,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[<Node kind=select_clause, start_point=(0, 43), end_point=(0, 55)>,\n"," <Node kind=where_clause, start_point=(0, 56), end_point=(0, 91)>]"]},"metadata":{"tags":[]},"execution_count":40}]},{"cell_type":"code","metadata":{"id":"-0c_hUHj0RdQ","executionInfo":{"status":"ok","timestamp":1621179718450,"user_tz":-120,"elapsed":3788,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}}},"source":["def get_string_from_code(node, lines):\n","  line_start = node.start_point[0]\n","  line_end = node.end_point[0]\n","  char_start = node.start_point[1]\n","  char_end = node.end_point[1]\n","  if line_start != line_end:\n","    code_list.append(' '.join([lines[line_start][char_start:]] + lines[line_start+1:line_end] + [lines[line_end][:char_end]]))\n","  else:\n","    code_list.append(lines[line_start][char_start:char_end])\n","\n","def my_traverse(node, code_list):\n","  lines = code.split('\\n')\n","  if node.child_count == 0:\n","    get_string_from_code(node, lines)\n","  elif node.type == 'string':\n","    get_string_from_code(node, lines)\n","  else:\n","    for n in node.children:\n","      my_traverse(n, code_list)\n"," \n","  return ' '.join(code_list)"],"execution_count":41,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"UEvaQ2-M0UiT","executionInfo":{"status":"ok","timestamp":1621179718450,"user_tz":-120,"elapsed":3785,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"6ff1d044-68e5-450d-c82c-53cfc87b468c"},"source":["code_list=[]\n","tokenized_code = my_traverse(tree.root_node, code_list)\n","print(\"Output after tokenization: \" + tokenized_code)"],"execution_count":42,"outputs":[{"output_type":"stream","text":["Output after tokenization: PREFIX foaf : < > SELECT ?name WHERE { ?person foaf : name ?name . }\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"_kk8bljX1W9E","executionInfo":{"status":"ok","timestamp":1621179718450,"user_tz":-120,"elapsed":3782,"user":{"displayName":"Shahriar Yazdipour","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj7ldLv317JVrv6jtloGcYIgoqAhT08NCy6q5wtrA=s64","userId":"06955205838397477388"}},"outputId":"d5988409-d9a8-496f-d1f0-b954b418976e"},"source":["code = 'SELECT ?name WHERE { ?person foaf:name ?name . }'\n","tree = parser.parse(bytes(code, \"utf8\"))\n","code_list=[]\n","tokenized_code = my_traverse(tree.root_node, code_list)\n","print(\"Output after tokenization: \" + tokenized_code)"],"execution_count":43,"outputs":[{"output_type":"stream","text":["Output after tokenization: SELECT ?name WHERE { ?person foaf : name ?name . }\n"],"name":"stdout"}]}]}