{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"Ġd":261,"Ġ?":262,"Ġdb":263,"ur":264,"er":265,"ct":266,"uri":267,"Ġdbo":268,"in":269,"Ġ{":270,"Ġ}":271,"st":272,"le":273,"se":274,"her":275,"here":276,"where":277,"ĠĊ":278,"Ġwhere":279,"or":280,"lect":281,"Ġse":282,"Ġselect":283,"ist":284,"inct":285,"istinct":286,"pe":287,"Ġdistinct":288,"at":289,"re":290,"Ġdbr":291,"ia":292,"on":293,"ce":294,"ht":295,"org":296,"Ġ<":297,"db":298,"dia":299,"tp":300,"//":301,"://":302,"pedia":303,"http":304,"dbpedia":305,"so":306,"un":307,"ty":308,"an":309,"urce":310,"source":311,"Ġ;":312,"resource":313,"ion":314,"ar":315,"Ġa":316,"ate":317,"al":318,"co":319,"it":320,"th":321,"date":322,"il":323,"ation":324,"Ġ.":325,"ro":326,"lo":327,"unt":328,"type":329,"es":330,"of":331,"df":332,"rdf":333,"Ġrdf":334,"en":335,"am":336,"la":337,"ch":338,"li":339,"count":340,"ing":341,"der":342,"Ġas":343,"um":344,"ge":345,"(?":346,"po":347,"fil":348,"ry":349,"pro":350,"ity":351,"Ġ1":352,"Ġdbp":353,"ic":354,"to":355,"by":356,"ir":357,"mit":358,"order":359,"per":360,"Ġli":361,"Ġby":362,"Ġlimit":363,"num":364,"pla":365,"ter":366,"Ġorder":367,"is":368,"country":369,"Ġ(":370,"union":371,"loc":372,"off":373,"Ġask":374,"au":375,"de":376,"city":377,"Ġunion":378,"el":379,"place":380,"ber":381,"gu":382,"me":383,"ring":384,"Ġfil":385,"Ġfilter":386,"Ġdes":387,"set":388,"Ġdesc":389,"Ġoff":390,"Ġoffset":391,"are":392,"ed":393,"lan":394,"ul":395,"Ġ0":396,"bir":397,"star":398,"birth":399,"go":400,"gy":401,"the":402,"location":403,"ele":404,"proper":405,"property":406,"ig":407,"logy":408,"he":409,"ver":410,"onto":411,"pop":412,"film":413,"starring":414,"ontology":415,"ca":416,"man":417,"ra":418,"use":419,"Ġ)":420,"ran":421,"ye":422,"lea":423,"ent":424,"age":425,"bo":426,"Ġ\"":427,"state":428,"ild":429,"elev":430,"mp":431,"ok":432,"ri":433,"spo":434,"tal":435,"ve":436,"ctor":437,"thor":438,"ame":439,"author":440,"langu":441,"00":442,"ad":443,"du":444,"ger":445,"ke":446,"lin":447,"mo":448,"spouse":449,"language":450,"child":451,"number":452,"as":453,"di":454,"distinct":455,"elevation":456,"ik":457,"name":458,"par":459,"ub":460,"Ġ>":461,"und":462,"ulation":463,"birthplace":464,"population":465,"ain":466,"te":467,"ort":468,"ight":469,"year":470,"book":471,"fo":472,"ne":473,"str":474,"ath":475,"res":476,"unit":477,"death":478,"height":479,"united":480,"ac":481,"for":482,"oh":483,"port":484,"son":485,"wn":486,"ian":487,"all":488,"comp":489,"total":490,"states":491,"populationtotal":492,"ay":493,"air":494,"ho":495,"joh":496,"mar":497,"sity":498,"up":499,"vi":500,"area":501,"leader":502,"numberof":503,"_(":504,"ago":505,"bel":506,"cer":507,"den":508,"ren":509,"rector":510,"uni":511,"any":512,"arge":513,"alia":514,"rank":515,"german":516,"mount":517,"director":518,"company":519,"\")":520,"ab":521,"ies":522,"ime":523,"mu":524,"ser":525,"wik":526,"Ġre":527,"gex":528,"cap":529,"john":530,"germany":531,"Ġregex":532,"))":533,"be":534,"bat":535,"dge":536,"gro":537,"id":538,"ld":539,"lu":540,"ph":541,"pres":542,"rit":543,"sh":544,"sp":545,"sic":546,"war":547,"yer":548,"ine":549,"indu":550,"stry":551,"ater":552,"reat":553,"sof":554,"ite":555,"ital":556,"ill":557,"Ġasc":558,"austr":559,"birthdate":560,"cave":561,"industry":562,"australia":563,"19":564,"act":565,"actor":566,"eur":567,"est":568,"ls":569,"mam":570,"no":571,"ram":572,"ss":573,"tle":574,"yago":575,"ste":576,"one":577,"and":578,"almam":579,"lake":580,"produ":581,"person":582,"team":583,"found":584,"deathplace":585,"numberofe":586,"univer":587,"mountain":588,"music":589,"capital":590,"almamater":591,"ag":592,"ak":593,"ap":594,"ba":595,"bu":596,"cy":597,"creat":598,"des":599,"if":600,"large":601,"mer":602,"ming":603,"ng":604,"pub":605,"ru":606,"sd":607,"ta":608,"time":609,"xsd":610,"inf":611,"ama":612,"land":613,"airport":614,"wikic":615,"university":616,"creator":617,"publi":618,"\"@":619,"._":620,"01":621,"cur":622,"cor":623,"car":624,"cup":625,"do":626,"dis":627,"gram":628,"ham":629,"ken":630,"min":631,"ment":632,"ner":633,"og":634,"otal":635,"qu":636,"writ":637,"will":638,"zone":639,"Ġyago":640,"string":641,"atotal":642,"iam":643,"arch":644,"col":645,"loye":646,"ence":647,"ames":648,"label":649,"pol":650,"program":651,"player":652,"gue":653,"areatotal":654,"mploye":655,"rency":656,"series":657,"battle":658,"euro":659,"timezone":660,"currency":661,"writer":662,"william":663,"mployees":664,"ace":665,"bs":666,"bur":667,"bre":668,"bro":669,"bul":670,"bri":671,"ball":672,"band":673,"can":674,"ccup":675,"din":676,"dan":677,"ft":678,"ie":679,"im":680,"ip":681,"ky":682,"lor":683,"nt":684,"nation":685,"os":686,"own":687,"occup":688,"pri":689,"sw":690,"spe":691,"ts":692,"tion":693,"tit":694,"vis":695,"we":696,"Ġ'":697,"ley":698,"leng":699,"sedate":700,"atstate":701,"relea":702,"organ":703,"soc":704,"atedin":705,"com":706,"loper":707,"ess":708,"lig":709,"icia":710,"locatedin":711,"officia":712,"deve":713,"theunited":714,"raft":715,"league":716,"party":717,"new":718,"ack":719,"density":720,"ident":721,"luence":722,"phy":723,"president":724,"spain":725,"softheunited":726,"producer":727,"foundation":728,"largest":729,"influence":730,"wikicatstate":731,"bridge":732,"owner":733,"occupation":734,"spec":735,"length":736,"releasedate":737,"locatedinarea":738,"developer":739,"softheunitedstates":740,"wikicatstatesoftheunitedstates":741,"'^":742,"av":743,"awar":744,"border":745,"bama":746,"ck":747,"cla":748,"ear":749,"frank":750,"gi":751,"gen":752,"games":753,"hal":754,"ire":755,"iso":756,"ico":757,"je":758,"kno":759,"mi":760,"ned":761,"ot":762,"obama":763,"pare":764,"piso":765,"ric":766,"sher":767,"sky":768,"tist":769,"ton":770,"telev":771,"targe":772,"tairport":773,"uta":774,"ven":775,"wo":776,"xico":777,"yn":778,"yor":779,"ze":780,"Ġ!":781,"Ġ2":782,"Ġcount":783,"istan":784,"pean":785,"dby":786,"ance":787,"ange":788,"artist":789,"rome":790,"che":791,"lid":792,"prof":793,"ision":794,"mexico":795,"gover":796,"raham":797,"rance":798,"ket":799,"lincol":800,"paris":801,"Ġ>=":802,"foun":803,"iance":804,"alliance":805,"airlin":806,"mark":807,"denmark":808,"abraham":809,"dget":810,"ground":811,"group":812,"itect":813,"numberofemployees":814,"numberofepiso":815,"ages":816,"budget":817,"minglanguage":818,"publisher":819,"core":820,"kenned":821,"architect":822,"programminglanguage":823,"national":824,"soccer":825,"official":826,"largestcity":827,"'^^":828,"award":829,"genre":830,"parent":831,"television":832,"targetairport":833,"utah":834,"york":835,"govern":836,"lincoln":837,"numberofepisodes":838,"kennedy":839,"201":840,"af":841,"aq":842,"ast":843,"ach":844,"ager":845,"bor":846,"bon":847,"bar":848,"ben":849,"bum":850,"bas":851,"bru":852,"cl":853,"cher":854,"con":855,"craft":856,"eg":857,"et":858,"eth":859,"ethe":860,"fam":861,"fif":862,"har":863,"hav":864,"ile":865,"ise":866,"ice":867,"iel":868,"jul":869,"jap":870,"king":871,"kel":872,"mation":873,"mis":874,"muse":875,"mad":876,"may":877,"muni":878,"non":879,"pre":880,"pill":881,"rist":882,"ron":883,"runt":884,"rum":885,"sy":886,"sse":887,"sub":888,"sho":889,"tw":890,"tor":891,"tel":892,"trum":893,"uc":894,"uz":895,"vation":896,"wer":897,"wor":898,"wine":899,"west":900,"Ġgroup":901,"Ġhav":902,"eral":903,"ince":904,"instr":905,"ster":906,"levation":907,"herelevation":908,"pen":909,"atner":910,"ree":911,"cess":912,"unch":913,"ang":914,"ard":915,"ars":916,"ary":917,"arter":918,"ali":919,"alber":920,"alay":921,"album":922,"colo":923,"iter":924,"itor":925,"itic":926,"ily":927,"roy":928,"Ġrdfs":929,"amin":930,"launch":931,"chic":932,"chel":933,"christ":934,"lish":935,"ingyear":936,"ument":937,"poser":938,"proj":939,"ica":940,"tom":941,"town":942,"iraq":943,"isation":944,"elvis":945,"berg":946,"berlin":947,"guy":948,"ult":949,"gold":950,"goethe":951,"igner":952,"head":953,"rayer":954,"raphy":955,"entrance":956,"Ġ\"^":957,"rid":958,"000":959,"ada":960,"park":961,"part":962,"books":963,"net":964,"result":965,"deathdate":966,"ford":967,"formation":968,"portrayer":969,"wnfor":970,"holid":971,"vide":972,"leadername":973,"presley":974,"shatner":975,"softw":976,"nobel":977,"stein":978,"steven":979,"musical":980,"baik":981,"designer":982,"iff":983,"merkel":984,"public":985,"carbs":986,"mineral":987,"menttype":988,"ography":989,"quarter":990,"politic":991,"european":992,"burj":993,"bulls":994,"ballplayer":995,"canada":996,"prize":997,"tiondate":998,"title":999,"organisation":1000,"composer":1001,"densityrank":1002,"foundationplace":1003,"influenced":1004,"species":1005,"class":1006,"earth":1007,"ject":1008,"knownfor":1009,"otherelevation":1010,"Ġ!=":1011,"angela":1012,"ketballplayer":1013,"founde":1014,"airline":1015,"nationality":1016,"soccercl":1017,"officiallanguage":1018,"televisionsho":1019,"governmenttype":1020,"barack":1021,"basketballplayer":1022,"bruce":1023,"family":1024,"japan":1025,"miss":1026,"museum":1027,"mayor":1028,"munich":1029,"pillars":1030,"runtime":1031,"world":1032,"Ġhaving":1033,"instrument":1034,"chicago":1035,"headquarter":1036,"holiday":1037,"software":1038,"soccerclub":1039,"televisionshow":1040,"\",":1041,",_":1042,".>":1043,"12":1044,"14":1045,"28":1046,"29":1047,"31":1048,"50":1049,"78":1050,"_%":1051,"ader":1052,"astr":1053,"apol":1054,"bn":1055,"bia":1056,"bra":1057,"cr":1058,"cro":1059,"cam":1060,"cau":1061,"clin":1062,"cru":1063,"cali":1064,"don":1065,"dar":1066,"dlabel":1067,"draft":1068,"drome":1069,"ein":1070,"ese":1071,"een":1072,"ever":1073,"employees":1074,"east":1075,"fe":1076,"ff":1077,"flo":1078,"fir":1079,"fran":1080,"fren":1081,"fact":1082,"gh":1083,"gm":1084,"gin":1085,"gal":1086,"gare":1087,"game":1088,"great":1089,"gang":1090,"hig":1091,"hab":1092,"him":1093,"ib":1094,"iz":1095,"ide":1096,"ive":1097,"iden":1098,"jack":1099,"jamin":1100,"ka":1101,"ker":1102,"lcity":1103,"llor":1104,"lyn":1105,"liter":1106,"ma":1107,"ms":1108,"mon":1109,"mun":1110,"mel":1111,"mas":1112,"mund":1113,"mine":1114,"ni":1115,"nat":1116,"nia":1117,"nic":1118,"nter":1119,"nik":1120,"od":1121,"ol":1122,"ou":1123,"oper":1124,"pr":1125,"pt":1126,"pal":1127,"pran":1128,"pad":1129,"pages":1130,"piraq":1131,"slo":1132,"sch":1133,"smo":1134,"site":1135,"score":1136,"suc":1137,"tv":1138,"tur":1139,"tter":1140,"tis":1141,"tele":1142,"tarea":1143,"ute":1144,"ufact":1145,"van":1146,"ww":1147,"win":1148,"wal":1149,"zer":1150,"Ġ3":1151,"Ġ8":1152,"Ġ=":1153,"Ġxsd":1154,"ure":1155,"urer":1156,"ural":1157,"cts":1158,"ction":1159,"ina":1160,"inte":1161,"inhab":1162,"sting":1163,"stad":1164,"leon":1165,"letiondate":1166,"seas":1167,"herland":1168,"ory":1169,"orcount":1170,"orig":1171,"pet":1172,"peace":1173,"ating":1174,"atic":1175,"atcher":1176,"rea":1177,"real":1178,"redi":1179,"recor":1180,"republic":1181,"resting":1182,"onur":1183,"onau":1184,"onnumber":1185,"sopran":1186,"ank":1187,"ann":1188,"ant":1189,"anic":1190,"ants":1191,"sourcecountry":1192,"ara":1193,"ald":1194,"alty":1195,"alie":1196,"cover":1197,"cosmo":1198,"itzer":1199,"itants":1200,"thron":1201,"thatcher":1202,"rober":1203,"roach":1204,"route":1205,"low":1206,"end":1207,"ams":1208,"last":1209,"cho":1210,"chie":1211,"chess":1212,"chance":1213,"chard":1214,"china":1215,"ingdate":1216,"ingredi":1217,"pope":1218,"Ġ10":1219,"Ġ100":1220,"ication":1221,"tower":1222,"perl":1223,"ish":1224,"ispart":1225,"office":1226,"guin":1227,"metown":1228,"eden":1229,"edire":1230,"editor":1231,"birthname":1232,"locationcountry":1233,"locationcity":1234,"vertis":1235,"manufact":1236,"bour":1237,"ilding":1238,"oklyn":1239,"river":1240,"richard":1241,"advertis":1242,"key":1243,"link":1244,"motor":1245,"languagefamily":1246,"children":1247,"years":1248,"ney":1249,"residen":1250,"deathcau":1251,"fornia":1252,"portman":1253,"completiondate":1254,"hometown":1255,"johann":1256,"margare":1257,"vice":1258,"viation":1259,"numberofpages":1260,"belgi":1261,"abbre":1262,"wikip":1263,"beer":1264,"begin":1265,"batman":1266,"ritchie":1267,"199":1268,"1950":1269,"action":1270,"actica":1271,"active":1272,"ssia":1273,"product":1274,"foundingyear":1275,"mountains":1276,"musicby":1277,"musiccomposer":1278,"apon":1279,"bale":1280,"building":1281,"russia":1282,"inflow":1283,"wikicate":1284,"dom":1285,"discover":1286,"minist":1287,"ogame":1288,"queen":1289,"programme":1290,"battlestar":1291,"europop":1292,"writers":1293,"burton":1294,"brown":1295,"brooklyn":1296,"bandleader":1297,"switzer":1298,"sweden":1299,"titanic":1300,"weapon":1301,"organiz":1302,"commun":1303,"ession":1304,"light":1305,"influencedby":1306,"specia":1307,"franklin":1308,"michel":1309,"rick":1310,"skyteam":1311,"wood":1312,"istanbul":1313,"profit":1314,"profession":1315,"afric":1316,"ageredire":1317,"benjamin":1318,"ethnic":1319,"julia":1320,"kingdom":1321,"madrid":1322,"nonprofit":1323,"syl":1324,"sses":1325,"subject":1326,"trumpet":1327,"uzi":1328,"cessor":1329,"albert":1330,"alayas":1331,"colom":1332,"royalty":1333,"launchpad":1334,"christian":1335,"netherland":1336,"formationyear":1337,"videogame":1338,"stevens":1339,"baikonur":1340,"politician":1341,"foundedby":1342,"mission":1343,"astronau":1344,"apollo":1345,"crosses":1346,"clint":1347,"cruise":1348,"california":1349,"draftteam":1350,"einstein":1351,"everest":1352,"eastwood":1353,"floorcount":1354,"first":1355,"franc":1356,"french":1357,"gmt":1358,"galactica":1359,"himalayas":1360,"monarch":1361,"natalie":1362,"prince":1363,"successor":1364,"turk":1365,"telecommun":1366,"integer":1367,"inhabitants":1368,"seasonnumber":1369,"origin":1370,"recordlabel":1371,"restingplace":1372,"sopranos":1373,"cosmodrome":1374,"thrones":1375,"roberts":1376,"chancellor":1377,"ingredient":1378,"ispartof":1379,"manufacturer":1380,"advertising":1381,"residence":1382,"deathcause":1383,"margaret":1384,"belgium":1385,"abbreviation":1386,"wikipageredire":1387,"discoverer":1388,"switzerland":1389,"organization":1390,"michelle":1391,"netherlands":1392,"astronaut":1393,"telecommunication":1394,"wikipageredirects":1395,"&&":1396,"&_":1397,"'@":1398,"'_":1399,"'))":1400,"('":1401,")>":1402,"200":1403,"2000":1404,"30":1405,"45":1406,"400":1407,"51":1408,"68":1409,"80":1410,"978":1411,"_&_":1412,"ae":1413,"ale":1414,"ade":1415,"acity":1416,"ael":1417,"ake":1418,"avi":1419,"bb":1420,"bi":1421,"bl":1422,"br":1423,"buri":1424,"bes":1425,"bad":1426,"bund":1427,"bac":1428,"bay":1429,"bald":1430,"cf":1431,"ci":1432,"cm":1433,"cle":1434,"cat":1435,"cre":1436,"cate":1437,"cit":1438,"cing":1439,"care":1440,"cca":1441,"cri":1442,"cub":1443,"cid":1444,"cze":1445,"cket":1446,"ckey":1447,"da":1448,"dc":1449,"dy":1450,"dÃ":1451,"dre":1452,"ddate":1453,"dro":1454,"dam":1455,"dic":1456,"dort":1457,"dwar":1458,"dyn":1459,"eu":1460,"elect":1461,"eli":1462,"egy":1463,"eve":1464,"eise":1465,"eiff":1466,"fi":1467,"fin":1468,"fre":1469,"fon":1470,"far":1471,"fal":1472,"fth":1473,"fli":1474,"fring":1475,"fri":1476,"fort":1477,"fest":1478,"face":1479,"flor":1480,"fire":1481,"france":1482,"fiel":1483,"fgang":1484,"gr":1485,"gre":1486,"gar":1487,"gla":1488,"gra":1489,"gran":1490,"gne":1491,"gky":1492,"gree":1493,"glish":1494,"gory":1495,"hy":1496,"hor":1497,"hat":1498,"hun":1499,"hil":1500,"hof":1501,"hing":1502,"hel":1503,"hine":1504,"hank":1505,"hlight":1506,"ii":1507,"ij":1508,"io":1509,"iv":1510,"iy":1511,"idia":1512,"ipedia":1513,"iro":1514,"ium":1515,"ibor":1516,"jer":1517,"jor":1518,"jan":1519,"jes":1520,"jac":1521,"jup":1522,"james":1523,"jav":1524,"ki":1525,"ko":1526,"kw":1527,"kent":1528,"kub":1529,"kos":1530,"khal":1531,"ll":1532,"ler":1533,"lat":1534,"lon":1535,"lion":1536,"ling":1537,"lls":1538,"lfgang":1539,"mv":1540,"mÃ":1541,"mur":1542,"mist":1543,"mal":1544,"mil":1545,"men":1546,"mic":1547,"mau":1548,"mber":1549,"main":1550,"mck":1551,"malay":1552,"miff":1553,"mbl":1554,"na":1555,"ny":1556,"nor":1557,"ntp":1558,"nes":1559,"nas":1560,"names":1561,"ness":1562,"nile":1563,"nnon":1564,"nang":1565,"nberg":1566,"nstein":1567,"ningdate":1568,"nsyl":1569,"nddate":1570,"op":1571,"ox":1572,"oon":1573,"oce":1574,"olo":1575,"ola":1576,"ois":1577,"ology":1578,"over":1579,"olin":1580,"old":1581,"otle":1582,"oming":1583,"odis":1584,"open":1585,"py":1586,"pur":1587,"pin":1588,"ple":1589,"pher":1590,"pat":1591,"pit":1592,"pth":1593,"ppo":1594,"pau":1595,"plan":1596,"pul":1597,"pig":1598,"pid":1599,"plu":1600,"pak":1601,"rate":1602,"ris":1603,"rhe":1604,"rms":1605,"rhine":1606,"sa":1607,"sur":1608,"suri":1609,"sin":1610,"sia":1611,"sun":1612,"san":1613,"sate":1614,"sal":1615,"sco":1616,"sit":1617,"sla":1618,"sing":1619,"smit":1620,"sul":1621,"sig":1622,"she":1623,"sport":1624,"sian":1625,"sche":1626,"sbon":1627,"spark":1628,"sci":1629,"sidia":1630,"skos":1631,"smÃ":1632,"ti":1633,"tan":1634,"tation":1635,"tro":1636,"tes":1637,"tran":1638,"tain":1639,"tay":1640,"tim":1641,"tance":1642,"ud":1643,"ue":1644,"ut":1645,"udia":1646,"uth":1647,"udi":1648,"ugla":1649,"via":1650,"von":1651,"vel":1652,"vas":1653,"vik":1654,"vak":1655,"vince":1656,"vader":1657,"vol":1658,"vatic":1659,"vara":1660,"wy":1661,"wil":1662,"wes":1663,"wing":1664,"wild":1665,"was":1666,"wall":1667,"way":1668,"wren":1669,"water":1670,"wish":1671,"wbac":1672,"xas":1673,"xim":1674,"yl":1675,"yle":1676,"ying":1677,"yok":1678,"yuz":1679,"za":1680,"zon":1681,"zil":1682,"zen":1683,"zab":1684,"zak":1685,"zant":1686,"¤ki":1687,"¼sse":1688,"Ġ4":1689,"Ġof":1690,"Ġ(?":1691,"Ġbo":1692,"Ġyear":1693,"Ġfo":1694,"Ġgermany":1695,"Ġchrist":1696,"Ġchess":1697,"Ġ&&":1698,"Ġop":1699,"Ġskos":1700,"Ġdct":1701,"Ġdbc":1702,"urdu":1703,"urke":1704,"erit":1705,"erne":1706,"erac":1707,"erson":1708,"erup":1709,"ereg":1710,"erica":1711,"eroon":1712,"urismÃ":1713,"inc":1714,"india":1715,"inco":1716,"inter":1717,"inley":1718,"intel":1719,"insul":1720,"invas":1721,"stat":1722,"ston":1723,"stan":1724,"stian":1725,"stall":1726,"stone":1727,"stree":1728,"story":1729,"studi":1730,"style":1731,"lee":1732,"lel":1733,"lego":1734,"lennon":1735,"ses":1736,"sey":1737,"seine":1738,"seba":1739,"senter":1740,"seating":1741,"secre":1742,"sembl":1743,"senddate":1744,"hero":1745,"herit":1746,"herber":1747,"herak":1748,"ore":1749,"orf":1750,"oreg":1751,"istotle":1752,"peare":1753,"pedro":1754,"ator":1755,"atlan":1756,"atra":1757,"atac":1758,"ature":1759,"red":1760,"rew":1761,"reed":1762,"relig":1763,"onia":1764,"ones":1765,"onerac":1766,"ced":1767,"ces":1768,"center":1769,"centp":1770,"Ġ<=":1771,"sox":1772,"sovi":1773,"solu":1774,"south":1775,"soyuz":1776,"unc":1777,"unge":1778,"unkw":1779,"tyear":1780,"anography":1781,"ansa":1782,"ioneu":1783,"arme":1784,"arno":1785,"ardo":1786,"aristotle":1787,"alth":1788,"alplace":1789,"alman":1790,"alad":1791,"aldi":1792,"alparty":1793,"coa":1794,"cola":1795,"code":1796,"cook":1797,"coach":1798,"coppo":1799,"cocoa":1800,"itary":1801,"thic":1802,"three":1803,"thodis":1804,"datetime":1805,"illin":1806,"ilip":1807,"ationdate":1808,"rot":1809,"role":1810,"rotter":1811,"rocket":1812,"rolls":1813,"rourke":1814,"roses":1815,"lou":1816,"lowe":1817,"esia":1818,"eslig":1819,"espeare":1820,"ofy":1821,"ofwater":1822,"ency":1823,"english":1824,"enna":1825,"amph":1826,"america":1827,"lawren":1828,"laonerac":1829,"chan":1830,"chir":1831,"chag":1832,"chip":1833,"chile":1834,"chael":1835,"charme":1836,"lity":1837,"liber":1838,"limer":1839,"life":1840,"libr":1841,"lisbon":1842,"ingstates":1843,"ingrid":1844,"deral":1845,"umde":1846,"umbia":1847,"gel":1848,"geography":1849,"poland":1850,"poet":1851,"prodi":1852,"prote":1853,"project":1854,"proinsul":1855,"Ġ1400":1856,"Ġ1978":1857,"ick":1858,"ics":1859,"icro":1860,"icio":1861,"toy":1862,"tobi":1863,"iran":1864,"mittance":1865,"orders":1866,"persian":1867,"numemployees":1868,"placid":1869,"playing":1870,"terms":1871,"ism":1872,"isar":1873,"isis":1874,"island":1875,"autobi":1876,"del":1877,"demo":1878,"depart":1879,"elton":1880,"bernstein":1881,"gus":1882,"mean":1883,"metal":1884,"mecca":1885,"member":1886,"metro":1887,"methodis":1888,"ringste":1889,"settle":1890,"eddi":1891,"educ":1892,"startyear":1893,"birthyear":1894,"goog":1895,"gogh":1896,"gogne":1897,"gothic":1898,"goofy":1899,"locations":1900,"eleph":1901,"ign":1902,"hest":1903,"heine":1904,"heming":1905,"heck":1906,"health":1907,"verage":1908,"vercraft":1909,"cake":1910,"cairo":1911,"manager":1912,"manhat":1913,"rachel":1914,"racing":1915,"rapid":1916,"races":1917,"range":1918,"yeti":1919,"entist":1920,"body":1921,"boston":1922,"rio":1923,"spoken":1924,"vet":1925,"vement":1926,"vester":1927,"ctoralad":1928,"languages":1929,"0000":1930,"adams":1931,"admittance":1932,"duke":1933,"gere":1934,"movi":1935,"mosco":1936,"movement":1937,"asia":1938,"ascri":1939,"assembl":1940,"ascentp":1941,"elevationm":1942,"parbat":1943,"uble":1944,"populationdensityrank":1945,"texas":1946,"tegel":1947,"yearsenddate":1948,"foot":1949,"neil":1950,"access":1951,"formu":1952,"forbes":1953,"ohama":1954,"song":1955,"sonny":1956,"iana":1957,"house":1958,"hotel":1959,"hockey":1960,"hovercraft":1961,"marc":1962,"mary":1963,"marsh":1964,"marine":1965,"maribor":1966,"viction":1967,"vienna":1968,"leaderparty":1969,"leadertitle":1970,"numberofvis":1971,"numberoflocations":1972,"cers":1973,"ceres":1974,"alias":1975,"ablish":1976,"muham":1977,"service":1978,"wikipedia":1979,"capacity":1980,"captain":1981,")))":1982,"bean":1983,"bear":1984,"beck":1985,"beij":1986,"beverage":1987,"growing":1988,"ida":1989,"ldorf":1990,"luke":1991,"lufth":1992,"phalia":1993,"philip":1994,"press":1995,"rita":1996,"shak":1997,"ship":1998,"span":1999,"space":2000,"spiel":2001,"springste":2002,"sics":2003,"wars":2004,"warcraft":2005,"warzen":2006,"sofdenmark":2007,"iteof":2008,"italy":2009,"1978":2010,"1930":2011,"1945":2012,"1980":2013,"eurasia":2014,"estonia":2015,"establish":2016,"lscho":2017,"ramid":2018,"ramones":2019,"steel":2020,"andrew":2021,"lakesofdenmark":2022,"produced":2023,"foundingdate":2024,"universal":2025,"mountainrange":2026,"musician":2027,"agent":2028,"agency":2029,"aki":2030,"aking":2031,"apple":2032,"aprio":2033,"bach":2034,"butter":2035,"ifa":2036,"mers":2037,"meryl":2038,"ngman":2039,"nglish":2040,"amazon":2041,"carver":2042,"carolin":2043,"carrot":2044,"dougla":2045,"doctoralad":2046,"double":2047,"disney":2048,"dissolu":2049,"disorders":2050,"hamster":2051,"minster":2052,"ques":2053,"colate":2054,"columbia":2055,"polyn":2056,"guevara":2057,"currencycode":2058,"bsite":2059,"bside":2060,"breed":2061,"brewer":2062,"breaking":2063,"broader":2064,"ballpark":2065,"bandmember":2066,"cano":2067,"cannes":2068,"daniel":2069,"dancers":2070,"immer":2071,"lord":2072,"nations":2073,"prix":2074,"prime":2075,"swimmer":2076,"tsplayer":2077,"tional":2078,"tionyear":2079,"visor":2080,"weight":2081,"website":2082,"socrate":2083,"ligence":2084,"officialscho":2085,"physics":2086,"largestmetro":2087,"borders":2088,"borderingstates":2089,"claudia":2090,"gimp":2091,"giza":2092,"hallowe":2093,"ireland":2094,"jewish":2095,"knox":2096,"mier":2097,"michael":2098,"skype":2099,"skywal":2100,"venia":2101,"wook":2102,"wolfgang":2103,"Ġ2000":2104,"peanut":2105,"angels":2106,"chemist":2107,"chewbac":2108,"lidae":2109,"founder":2110,"airlines":2111,"agesite":2112,"architecture":2113,"architectural":2114,"soccerplayer":2115,"officiallanguages":2116,"governor":2117,"2013":2118,"2014":2119,"2018":2120,"asty":2121,"boris":2122,"borou":2123,"bond":2124,"bono":2125,"benicio":2126,"cons":2127,"confli":2128,"conviction":2129,"egger":2130,"fifa":2131,"fifth":2132,"fifamin":2133,"harry":2134,"harold":2135,"harris":2136,"juliana":2137,"pretation":2138,"presenter":2139,"premier":2140,"ronics":2141,"syngman":2142,"subsidia":2143,"toro":2144,"trump":2145,"wineproduced":2146,"westphalia":2147,"westminster":2148,"penguin":2149,"pennsyl":2150,"arygenre":2151,"alberta":2152,"colour":2153,"itors":2154,"royce":2155,"launchsite":2156,"bergman":2157,"goldman":2158,"goldmine":2159,"entrancecount":2160,"netinco":2161,"video":2162,"musicalartist":2163,"baikal":2164,"iffer":2165,"publicationdate":2166,"politicalparty":2167,"europeanism":2168,"founded":2169,"japanese":2170,"missile":2171,"worldherit":2172,"headquarters":2173,"28200":2174,"281978":2175,"brad":2176,"brazil":2177,"cratic":2178,"crisis":2179,"cambridge":2180,"cameroon":2181,"donald":2182,"darth":2183,"dartsplayer":2184,"federal":2185,"ganges":2186,"highlight":2187,"highest":2188,"ibm":2189,"ibian":2190,"ideology":2191,"jackson":2192,"kazant":2193,"kaurismÃ":2194,"kerou":2195,"literature":2196,"literarygenre":2197,"maxim":2198,"melon":2199,"melbour":2200,"mass":2201,"minecraft":2202,"nikos":2203,"nikola":2204,"olcolour":2205,"operation":2206,"operator":2207,"palme":2208,"palace":2209,"slovak":2210,"slovenia":2211,"schwarzen":2212,"schiffer":2213,"sitecore":2214,"vania":2215,"www":2216,"winereg":2217,"walt":2218,"Ġ300":2219,"stadter":2220,"stadium":2221,"leonard":2222,"leonardo":2223,"atingdisorders":2224,"reaper":2225,"ankara":2226,"routeend":2227,"ends":2228,"chocolate":2229,"chessplayer":2230,"Ġ100000":2231,"Ġ1000000":2232,"guinness":2233,"bourgogne":2234,"motors":2235,"yearsstartyear":2236,"neymar":2237,"vicepresident":2238,"begins":2239,"beginningdate":2240,"1990":2241,"1997":2242,"activeyearsenddate":2243,"activeyearsstartyear":2244,"wikicatenglish":2245,"wikicateatingdisorders":2246,"minister":2247,"ministry":2248,"queens":2249,"lighthouse":2250,"specials":2251,"speciality":2252,"africa":2253,"african":2254,"ethnicity":2255,"ethnicgroup":2256,"sylvester":2257,"colombo":2258,"colombia":2259,"firstascentp":2260,"francis":2261,"monarchs":2262,"turkish":2263,"turkmen":2264,"ispartofmil":2265,"telecommunications":2266,"alec":2267,"adele":2268,"aviv":2269,"bbc":2270,"burialplace":2271,"bundeslig":2272,"baldwin":2273,"cfa":2274,"cleese":2275,"category":2276,"cities":2277,"cuban":2278,"czech":2279,"dÃ¼sse":2280,"dreams":2281,"dicaprio":2282,"dortmund":2283,"dwarf":2284,"dynasty":2285,"electronics":2286,"elizab":2287,"egypt":2288,"eisenberg":2289,"eiffel":2290,"fiction":2291,"finance":2292,"freud":2293,"fonda":2294,"farmers":2295,"falcons":2296,"friends":2297,"festiv":2298,"facebook":2299,"florida":2300,"field":2301,"grunge":2302,"green":2303,"garry":2304,"grape":2305,"grand":2306,"gkyunkw":2307,"greece":2308,"hylidae":2309,"horse":2310,"hunger":2311,"hillel":2312,"hofstadter":2313,"hington":2314,"hells":2315,"hanks":2316,"iycm":2317,"jersey":2318,"jordan":2319,"jane":2320,"jesse":2321,"jacques":2322,"jupiter":2323,"javascri":2324,"koch":2325,"kubrick":2326,"khalifa":2327,"lliteof":2328,"latvia":2329,"london":2330,"mvp":2331,"murphy":2332,"malta":2333,"mickey":2334,"maude":2335,"mainspan":2336,"mckinley":2337,"malaysia":2338,"miffy":2339,"north":2340,"nasa":2341,"namesake":2342,"nanga":2343,"oxford":2344,"oceanography":2345,"olof":2346,"overlord":2347,"openingyear":2348,"pyramid":2349,"purl":2350,"pines":2351,"pherd":2352,"patrick":2353,"pitt":2354,"paul":2355,"planet":2356,"pulp":2357,"pigs":2358,"pluto":2359,"pakistan":2360,"rhee":2361,"surname":2362,"suriname":2363,"sinatra":2364,"sungkyunkw":2365,"satelliteof":2366,"slack":2367,"single":2368,"smith":2369,"sigmund":2370,"shepherd":2371,"schema":2372,"sparkling":2373,"scientist":2374,"tesla":2375,"transit":2376,"taylor":2377,"velvet":2378,"viking":2379,"vincent":2380,"volcano":2381,"vatican":2382,"wyoming":2383,"wilson":2384,"weser":2385,"wildlife":2386,"washington":2387,"yokohama":2388,"zakis":2389,"Ġbound":2390,"Ġfoaf":2391,"Ġchristmas":2392,"Ġoptional":2393,"eritrea":2394,"ernest":2395,"eruptionyear":2396,"interpretation":2397,"intelligence":2398,"invasion":2399,"statue":2400,"stanley":2401,"stallone":2402,"streep":2403,"studios":2404,"sebastian":2405,"seatingcapacity":2406,"secret":2407,"herbert":2408,"heraklion":2409,"oregon":2410,"atlanta":2411,"atacama":2412,"religion":2413,"soviet":2414,"ioneudate":2415,"arnold":2416,"almanac":2417,"cookie":2418,"coppola":2419,"itaryconfli":2420,"illinois":2421,"rotterdam":2422,"amphibian":2423,"lawrence":2424,"laoneracer":2425,"chirac":2426,"chagall":2427,"charmed":2428,"liberty":2429,"limerick":2430,"library":2431,"umdepth":2432,"prodigy":2433,"protein":2434,"proinsulin":2435,"autobiography":2436,"democratic":2437,"department":2438,"metalcore":2439,"methodism":2440,"settlement":2441,"eddie":2442,"education":2443,"google":2444,"elephant":2445,"heineken":2446,"hemingway":2447,"heckler":2448,"manhattan":2449,"bodyofwater":2450,"spokenin":2451,"admittancedate":2452,"movie":2453,"moscow":2454,"assembly":2455,"football":2456,"accessioneudate":2457,"formulaoneracer":2458,"marshall":2459,"numberofvisitors":2460,"muhammad":2461,"becker":2462,"beijing":2463,"growinggrape":2464,"lufthansa":2465,"philippines":2466,"shakespeare":2467,"shipnamesake":2468,"spielberg":2469,"springsteen":2470,"established":2471,"carolina":2472,"douglas":2473,"doctoraladvisor":2474,"dissolutiondate":2475,"polynesia":2476,"brewery":2477,"danielle":2478,"socrates":2479,"officialschoolcolour":2480,"halloween":2481,"skywalker":2482,"chewbacca":2483,"architecturalstyle":2484,"borough":2485,"subsidiary":2486,"pennsylvania":2487,"netincome":2488,"worldheritagesite":2489,"282004":2490,"highlights":2491,"kazantzakis":2492,"kaurismÃ¤ki":2493,"kerouac":2494,"maximumdepth":2495,"melbourne":2496,"schwarzenegger":2497,"wineregion":2498,"wikicatenglishmonarchs":2499,"firstascentperson":2500,"turkmenistan":2501,"ispartofmilitaryconfli":2502,"bundesliga":2503,"dÃ¼sseldorf":2504,"elizabeth":2505,"festival":2506,"javascript":2507,"sungkyunkwan":2508,"ispartofmilitaryconflict":2509}