#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ d
Ġ ?
Ġd b
u r
e r
c t
ur i
Ġdb o
i n
Ġ {
Ġ }
s t
l e
s e
h er
her e
w here
Ġ Ċ
Ġ where
o r
le ct
Ġ se
Ġse lect
i st
in ct
ist inct
p e
Ġd istinct
a t
r e
Ġdb r
i a
o n
c e
h t
or g
Ġ <
d b
d ia
t p
/ /
: //
pe dia
ht tp
db pedia
s o
u n
t y
a n
ur ce
so urce
Ġ ;
re source
i on
a r
Ġ a
at e
a l
c o
i t
t h
d ate
i l
at ion
Ġ .
r o
l o
un t
ty pe
e s
o f
d f
r df
Ġ rdf
e n
a m
l a
c h
l i
co unt
in g
d er
Ġa s
u m
g e
( ?
p o
f il
r y
p ro
i ty
Ġ 1
Ġdb p
i c
t o
b y
i r
m it
or der
p er
Ġ li
Ġ by
Ġli mit
n um
p la
t er
Ġ order
i s
count ry
Ġ (
un ion
lo c
of f
Ġas k
a u
d e
c ity
Ġ union
e l
pla ce
b er
g u
m e
r ing
Ġ fil
Ġfil ter
Ġd es
se t
Ġdes c
Ġ off
Ġoff set
a re
e d
l an
u l
Ġ 0
b ir
st ar
bir th
g o
g y
th e
loc ation
e le
pro per
proper ty
i g
lo gy
h e
v er
on to
po p
fil m
star ring
onto logy
c a
m an
r a
u se
Ġ )
r an
y e
le a
en t
a ge
b o
Ġ "
st ate
il d
ele v
m p
o k
r i
s po
t al
v e
ct or
th or
am e
au thor
lan gu
0 0
a d
d u
g er
k e
l in
m o
spo use
langu age
ch ild
num ber
a s
d i
d istinct
elev ation
i k
n ame
p ar
u b
Ġ >
un d
ul ation
birth place
pop ulation
a in
t e
or t
ig ht
ye ar
bo ok
f o
n e
st r
at h
re s
un it
de ath
he ight
unit ed
a c
f or
o h
p ort
s on
w n
ia n
al l
co mp
to tal
state s
population total
a y
a ir
h o
j oh
m ar
s ity
u p
v i
are a
lea der
number of
_ (
a go
b el
c er
d en
re n
re ctor
un i
an y
ar ge
al ia
ran k
ger man
mo unt
di rector
comp any
" )
a b
i es
i me
m u
s er
w ik
Ġ re
ge x
ca p
joh n
german y
Ġre gex
) )
b e
b at
d ge
g ro
i d
l d
l u
p h
p res
r it
s h
s p
s ic
w ar
y er
in e
in du
st ry
at er
re at
so f
it e
it al
il l
Ġas c
au str
birth date
ca ve
indu stry
austr alia
1 9
a ct
a ctor
e ur
e st
l s
m am
n o
r am
s s
t le
y ago
st e
on e
an d
al mam
la ke
pro du
per son
te am
fo und
death place
numberof e
uni ver
mount ain
mu sic
cap ital
almam ater
a g
a k
a p
b a
b u
c y
c reat
d es
i f
l arge
m er
m ing
n g
p ub
r u
s d
t a
t ime
x sd
in f
am a
lan d
air port
wik ic
univer sity
creat or
pub li
" @
. _
0 1
c ur
c or
c ar
c up
d o
d is
g ram
h am
k en
m in
m ent
n er
o g
o tal
q u
w rit
w ill
z one
Ġ yago
st ring
at otal
ia m
ar ch
co l
lo ye
en ce
am es
la bel
po l
pro gram
pla yer
gu e
are atotal
mp loye
ren cy
ser ies
bat tle
eur o
time zone
cur rency
writ er
will iam
mploye es
a ce
b s
b ur
b re
b ro
b ul
b ri
b all
b and
c an
c cup
d in
d an
f t
i e
i m
i p
k y
l or
n t
n ation
o s
o wn
o ccup
p ri
s w
s pe
t s
t ion
t it
v is
w e
Ġ '
le y
le ng
se date
at state
re lea
org an
so c
ate din
co m
lo per
es s
li g
ic ia
loc atedin
off icia
de ve
the united
ra ft
lea gue
par ty
ne w
ac k
den sity
id ent
lu ence
ph y
pres ident
sp ain
sof theunited
produ cer
found ation
large st
inf luence
wikic atstate
bri dge
own er
occup ation
spe c
leng th
relea sedate
locatedin area
deve loper
softheunited states
wikicatstate softheunitedstates
' ^
a v
a war
b order
b ama
c k
c la
e ar
f rank
g i
g en
g ames
h al
i re
i so
i co
j e
k no
m i
n ed
o t
o bama
p are
p iso
r ic
s her
s ky
t ist
t on
t elev
t arge
t airport
u ta
v en
w o
x ico
y n
y or
z e
Ġ !
Ġ 2
Ġ count
ist an
pe an
db y
an ce
an ge
ar tist
ro me
ch e
li d
pro f
is ion
me xico
go ver
ra ham
ran ce
ke t
lin col
par is
Ġ> =
fo un
ian ce
all iance
air lin
mar k
den mark
ab raham
dge t
gro und
gro up
ite ct
numberofe mployees
numberofe piso
ag es
bu dget
ming language
publi sher
cor e
ken ned
arch itect
program minglanguage
nation al
soc cer
officia l
largest city
'^ ^
awar d
gen re
pare nt
telev ision
targe tairport
uta h
yor k
gover n
lincol n
numberofepiso des
kenned y
2 01
a f
a q
a st
a ch
a ger
b or
b on
b ar
b en
b um
b as
b ru
c l
c her
c on
c raft
e g
e t
e th
e the
f am
f if
h ar
h av
i le
i se
i ce
i el
j ul
j ap
k ing
k el
m ation
m is
m use
m ad
m ay
m uni
n on
p re
p ill
r ist
r on
r unt
r um
s y
s se
s ub
s ho
t w
t or
t el
t rum
u c
u z
v ation
w er
w or
w ine
w est
Ġ group
Ġ hav
er al
in ce
in str
st er
le vation
here levation
pe n
at ner
re e
ce ss
un ch
an g
ar d
ar s
ar y
ar ter
al i
al ber
al ay
al bum
co lo
it er
it or
it ic
il y
ro y
Ġrdf s
am in
la unch
ch ic
ch el
ch rist
li sh
ing year
um ent
po ser
pro j
ic a
to m
to wn
ir aq
is ation
el vis
ber g
ber lin
gu y
ul t
go ld
go ethe
ig ner
he ad
ra yer
ra phy
ent rance
Ġ" ^
ri d
00 0
ad a
par k
par t
book s
ne t
res ult
death date
for d
for mation
port rayer
wn for
ho lid
vi de
leader name
pres ley
sh atner
sof tw
no bel
ste in
ste ven
music al
ba ik
des igner
if f
mer kel
publi c
car bs
min eral
ment type
og raphy
qu arter
pol itic
euro pean
bur j
bul ls
ball player
can ada
pri ze
tion date
tit le
organ isation
com poser
density rank
foundation place
influence d
spec ies
cla ss
ear th
je ct
kno wnfor
ot herelevation
Ġ! =
ange la
ket ballplayer
foun de
airlin e
national ity
soccer cl
official language
television sho
govern menttype
bar ack
bas ketballplayer
bru ce
fam ily
jap an
mis s
muse um
may or
muni ch
pill ars
runt ime
wor ld
Ġhav ing
instr ument
chic ago
head quarter
holid ay
softw are
soccercl ub
televisionsho w
" ,
, _
. >
1 2
1 4
2 8
2 9
3 1
5 0
7 8
_ %
a der
a str
a pol
b n
b ia
b ra
c r
c ro
c am
c au
c lin
c ru
c ali
d on
d ar
d label
d raft
d rome
e in
e se
e en
e ver
e mployees
e ast
f e
f f
f lo
f ir
f ran
f ren
f act
g h
g m
g in
g al
g are
g ame
g reat
g ang
h ig
h ab
h im
i b
i z
i de
i ve
i den
j ack
j amin
k a
k er
l city
l lor
l yn
l iter
m a
m s
m on
m un
m el
m as
m und
m ine
n i
n at
n ia
n ic
n ter
n ik
o d
o l
o u
o per
p r
p t
p al
p ran
p ad
p ages
p iraq
s lo
s ch
s mo
s ite
s core
s uc
t v
t ur
t ter
t is
t ele
t area
u te
u fact
v an
w w
w in
w al
z er
Ġ 3
Ġ 8
Ġ =
Ġ xsd
ur e
ur er
ur al
ct s
ct ion
in a
in te
in hab
st ing
st ad
le on
le tiondate
se as
her land
or y
or count
or ig
pe t
pe ace
at ing
at ic
at cher
re a
re al
re di
re cor
re public
re sting
on ur
on au
on number
so pran
an k
an n
an t
an ic
an ts
source country
ar a
al d
al ty
al ie
co ver
co smo
it zer
it ants
th ron
th atcher
ro ber
ro ach
ro ute
lo w
en d
am s
la st
ch o
ch ie
ch ess
ch ance
ch ard
ch ina
ing date
ing redi
po pe
Ġ1 0
Ġ1 00
ic ation
to wer
per l
is h
is part
off ice
gu in
me town
ed en
ed ire
ed itor
birth name
location country
location city
ver tis
man ufact
bo ur
ild ing
ok lyn
ri ver
ri chard
ad vertis
ke y
lin k
mo tor
language family
child ren
year s
ne y
res iden
death cau
for nia
port man
comp letiondate
ho metown
joh ann
mar gare
vi ce
vi ation
numberof pages
bel gi
ab bre
wik ip
be er
be gin
bat man
rit chie
19 9
19 50
act ion
act ica
act ive
ss ia
produ ct
found ingyear
mountain s
music by
music composer
ap on
ba le
bu ilding
ru ssia
inf low
wikic ate
do m
dis cover
min ist
og ame
qu een
program me
battle star
euro pop
writer s
bur ton
bro wn
bro oklyn
band leader
sw itzer
sw eden
tit anic
we apon
organ iz
com mun
ess ion
lig ht
influence dby
spec ia
frank lin
mi chel
ric k
sky team
wo od
istan bul
prof it
prof ession
af ric
ager edire
ben jamin
eth nic
jul ia
king dom
mad rid
non profit
sy l
sse s
sub ject
trum pet
uz i
cess or
alber t
alay as
colo m
roy alty
launch pad
christ ian
net herland
formation year
vide ogame
steven s
baik onur
politic ian
founde dby
miss ion
astr onau
apol lo
cro sses
clin t
cru ise
cali fornia
draft team
ein stein
ever est
east wood
flo orcount
fir st
fran c
fren ch
gm t
gal actica
him alayas
mon arch
nat alie
pr ince
suc cessor
tur k
tele commun
inte ger
inhab itants
seas onnumber
orig in
recor dlabel
resting place
sopran os
cosmo drome
thron es
rober ts
chance llor
ingredi ent
ispart of
manufact urer
advertis ing
residen ce
deathcau se
margare t
belgi um
abbre viation
wikip ageredire
discover er
switzer land
organiz ation
michel le
netherland s
astronau t
telecommun ication
wikipageredire cts
& &
& _
' @
' _
' ))
( '
) >
2 00
2 000
3 0
4 5
4 00
5 1
6 8
8 0
9 78
_ &_
a e
a le
a de
a city
a el
a ke
a vi
b b
b i
b l
b r
b uri
b es
b ad
b und
b ac
b ay
b ald
c f
c i
c m
c le
c at
c re
c ate
c it
c ing
c are
c ca
c ri
c ub
c id
c ze
c ket
c key
d a
d c
d y
d Ã
d re
d date
d ro
d am
d ic
d ort
d war
d yn
e u
e lect
e li
e gy
e ve
e ise
e iff
f i
f in
f re
f on
f ar
f al
f th
f li
f ring
f ri
f ort
f est
f ace
f lor
f ire
f rance
f iel
f gang
g r
g re
g ar
g la
g ra
g ran
g ne
g ky
g ree
g lish
g ory
h y
h or
h at
h un
h il
h of
h ing
h el
h ine
h ank
h light
i i
i j
i o
i v
i y
i dia
i pedia
i ro
i um
i bor
j er
j or
j an
j es
j ac
j up
j ames
j av
k i
k o
k w
k ent
k ub
k os
k hal
l l
l er
l at
l on
l ion
l ing
l ls
l fgang
m v
m Ã
m ur
m ist
m al
m il
m en
m ic
m au
m ber
m ain
m ck
m alay
m iff
m bl
n a
n y
n or
n tp
n es
n as
n ames
n ess
n ile
n non
n ang
n berg
n stein
n ingdate
n syl
n ddate
o p
o x
o on
o ce
o lo
o la
o is
o logy
o ver
o lin
o ld
o tle
o ming
o dis
o pen
p y
p ur
p in
p le
p her
p at
p it
p th
p po
p au
p lan
p ul
p ig
p id
p lu
p ak
r ate
r is
r he
r ms
r hine
s a
s ur
s uri
s in
s ia
s un
s an
s ate
s al
s co
s it
s la
s ing
s mit
s ul
s ig
s he
s port
s ian
s che
s bon
s park
s ci
s idia
s kos
s mÃ
t i
t an
t ation
t ro
t es
t ran
t ain
t ay
t im
t ance
u d
u e
u t
u dia
u th
u di
u gla
v ia
v on
v el
v as
v ik
v ak
v ince
v ader
v ol
v atic
v ara
w y
w il
w es
w ing
w ild
w as
w all
w ay
w ren
w ater
w ish
w bac
x as
x im
y l
y le
y ing
y ok
y uz
z a
z on
z il
z en
z ab
z ak
z ant
¤ ki
¼ sse
Ġ 4
Ġ of
Ġ (?
Ġ bo
Ġ year
Ġ fo
Ġ germany
Ġ christ
Ġ chess
Ġ &&
Ġ op
Ġ skos
Ġd ct
Ġdb c
ur du
ur ke
er it
er ne
er ac
er son
er up
er eg
er ica
er oon
uri smÃ
in c
in dia
in co
in ter
in ley
in tel
in sul
in vas
st at
st on
st an
st ian
st all
st one
st ree
st ory
st udi
st yle
le e
le l
le go
le nnon
se s
se y
se ine
se ba
se nter
se ating
se cre
se mbl
se nddate
her o
her it
her ber
her ak
or e
or f
or eg
ist otle
pe are
pe dro
at or
at lan
at ra
at ac
at ure
re d
re w
re ed
re lig
on ia
on es
on erac
ce d
ce s
ce nter
ce ntp
Ġ< =
so x
so vi
so lu
so uth
so yuz
un c
un ge
un kw
ty ear
an ography
an sa
ion eu
ar me
ar no
ar do
ar istotle
al th
al place
al man
al ad
al di
al party
co a
co la
co de
co ok
co ach
co ppo
co coa
it ary
th ic
th ree
th odis
date time
il lin
il ip
ation date
ro t
ro le
ro tter
ro cket
ro lls
ro urke
ro ses
lo u
lo we
es ia
es lig
es peare
of y
of water
en cy
en glish
en na
am ph
am erica
la wren
la onerac
ch an
ch ir
ch ag
ch ip
ch ile
ch ael
ch arme
li ty
li ber
li mer
li fe
li br
li sbon
ing states
ing rid
der al
um de
um bia
ge l
ge ography
po land
po et
pro di
pro te
pro ject
pro insul
Ġ1 400
Ġ1 978
ic k
ic s
ic ro
ic io
to y
to bi
ir an
mit tance
order s
per sian
num employees
pla cid
pla ying
ter ms
is m
is ar
is is
is land
au tobi
de l
de mo
de part
el ton
ber nstein
gu s
me an
me tal
me cca
me mber
me tro
me thodis
ring ste
set tle
ed di
ed uc
star tyear
birth year
go og
go gh
go gne
go thic
go ofy
location s
ele ph
ig n
he st
he ine
he ming
he ck
he alth
ver age
ver craft
ca ke
ca iro
man ager
man hat
ra chel
ra cing
ra pid
ra ces
ran ge
ye ti
ent ist
bo dy
bo ston
ri o
spo ken
ve t
ve ment
ve ster
ctor alad
langu ages
00 00
ad ams
ad mittance
du ke
ger e
mo vi
mo sco
mo vement
as ia
as cri
as sembl
as centp
elevation m
par bat
ub le
population densityrank
te xas
te gel
year senddate
fo ot
ne il
ac cess
for mu
for bes
oh ama
son g
son ny
ian a
ho use
ho tel
ho ckey
ho vercraft
mar c
mar y
mar sh
mar ine
mar ibor
vi ction
vi enna
leader party
leader title
numberof vis
numberof locations
cer s
cer es
alia s
ab lish
mu ham
ser vice
wik ipedia
cap acity
cap tain
)) )
be an
be ar
be ck
be ij
be verage
gro wing
id a
ld orf
lu ke
lu fth
ph alia
ph ilip
pres s
rit a
sh ak
sh ip
sp an
sp ace
sp iel
sp ringste
sic s
war s
war craft
war zen
sof denmark
ite of
ital y
19 78
19 30
19 45
19 80
eur asia
est onia
est ablish
ls cho
ram id
ram ones
ste el
and rew
lake sofdenmark
produ ced
found ingdate
univer sal
mountain range
music ian
ag ent
ag ency
ak i
ak ing
ap ple
ap rio
ba ch
bu tter
if a
mer s
mer yl
ng man
ng lish
ama zon
car ver
car olin
car rot
do ugla
do ctoralad
do uble
dis ney
dis solu
dis orders
ham ster
min ster
qu es
col ate
col umbia
pol yn
gue vara
currency code
bs ite
bs ide
bre ed
bre wer
bre aking
bro ader
ball park
band member
can o
can nes
dan iel
dan cers
im mer
lor d
nation s
pri x
pri me
sw immer
ts player
tion al
tion year
vis or
we ight
we bsite
soc rate
lig ence
officia lscho
phy sics
largest metro
border s
border ingstates
cla udia
gi mp
gi za
hal lowe
ire land
je wish
kno x
mi er
mi chael
sky pe
sky wal
ven ia
wo ok
wo lfgang
Ġ2 000
pean ut
ange ls
che mist
che wbac
lid ae
foun der
airlin es
ages ite
architect ure
architect ural
soccer player
official languages
govern or
201 3
201 4
201 8
ast y
bor is
bor ou
bon d
bon o
ben icio
con s
con fli
con viction
eg ger
fif a
fif th
fif amin
har ry
har old
har ris
jul iana
pre tation
pre senter
pre mier
ron ics
sy ngman
sub sidia
tor o
trum p
wine produced
west phalia
west minster
pen guin
pen nsyl
ary genre
alber ta
colo ur
itor s
roy ce
launch site
berg man
gold man
gold mine
entrance count
net inco
vide o
musical artist
baik al
iff er
public ationdate
politic alparty
european ism
founde d
japan ese
miss ile
world herit
headquarter s
28 200
28 1978
bra d
bra zil
cr atic
cr isis
cam bridge
cam eroon
don ald
dar th
dar tsplayer
fe deral
gang es
hig hlight
hig hest
ib m
ib ian
ide ology
jack son
ka zant
ka urismÃ
ker ou
liter ature
liter arygenre
ma xim
mel on
mel bour
mas s
mine craft
nik os
nik ola
ol colour
oper ation
oper ator
pal me
pal ace
slo vak
slo venia
sch warzen
sch iffer
site core
van ia
ww w
win ereg
wal t
Ġ3 00
stad ter
stad ium
leon ard
leon ardo
ating disorders
rea per
ank ara
route end
end s
cho colate
chess player
Ġ100 000
Ġ100 0000
guin ness
bour gogne
motor s
years startyear
ney mar
vice president
begin s
begin ningdate
199 0
199 7
active yearsenddate
active yearsstartyear
wikicate nglish
wikicate atingdisorders
minist er
minist ry
queen s
light house
specia ls
specia lity
afric a
afric an
ethnic ity
ethnic group
syl vester
colom bo
colom bia
first ascentp
franc is
monarch s
turk ish
turk men
ispartof mil
telecommunication s
ale c
ade le
avi v
bb c
buri alplace
bund eslig
bald win
cf a
cle ese
cate gory
cit ies
cub an
cze ch
dÃ ¼sse
dre ams
dic aprio
dort mund
dwar f
dyn asty
elect ronics
eli zab
egy pt
eise nberg
eiff el
fi ction
fin ance
fre ud
fon da
far mers
fal cons
fri ends
fest iv
face book
flor ida
fiel d
gr unge
gre en
gar ry
gra pe
gran d
gky unkw
gree ce
hy lidae
hor se
hun ger
hil lel
hof stadter
hing ton
hel ls
hank s
iy cm
jer sey
jor dan
jan e
jes se
jac ques
jup iter
jav ascri
ko ch
kub rick
khal ifa
ll iteof
lat via
lon don
mv p
mur phy
mal ta
mic key
mau de
main span
mck inley
malay sia
miff y
nor th
nas a
names ake
nang a
ox ford
oce anography
olo f
over lord
open ingyear
py ramid
pur l
pin es
pher d
pat rick
pit t
pau l
plan et
pul p
pig s
plu to
pak istan
rhe e
sur name
suri name
sin atra
sun gkyunkw
sate lliteof
sla ck
sing le
smit h
sig mund
she pherd
sche ma
spark ling
sci entist
tes la
tran sit
tay lor
vel vet
vik ing
vince nt
vol cano
vatic an
wy oming
wil son
wes er
wild life
was hington
yok ohama
zak is
Ġbo und
Ġfo af
Ġchrist mas
Ġop tional
erit rea
erne st
erup tionyear
inter pretation
intel ligence
invas ion
stat ue
stan ley
stall one
stree p
studi os
seba stian
seating capacity
secre t
herber t
herak lion
oreg on
atlan ta
atac ama
relig ion
sovi et
ioneu date
arno ld
alman ac
cook ie
coppo la
itary confli
illin ois
rotter dam
amph ibian
lawren ce
laonerac er
chir ac
chag all
charme d
liber ty
limer ick
libr ary
umde pth
prodi gy
prote in
proinsul in
autobi ography
demo cratic
depart ment
metal core
methodis m
settle ment
eddi e
educ ation
goog le
eleph ant
heine ken
heming way
heck ler
manhat tan
body ofwater
spoken in
admittance date
movi e
mosco w
assembl y
foot ball
access ioneudate
formu laoneracer
marsh all
numberofvis itors
muham mad
beck er
beij ing
growing grape
lufth ansa
philip pines
shak espeare
ship namesake
spiel berg
springste en
establish ed
carolin a
dougla s
doctoralad visor
dissolu tiondate
polyn esia
brewer y
daniel le
socrate s
officialscho olcolour
hallowe en
skywal ker
chewbac ca
architectural style
borou gh
subsidia ry
pennsyl vania
netinco me
worldherit agesite
28200 4
highlight s
kazant zakis
kaurismÃ ¤ki
kerou ac
maxim umdepth
melbour ne
schwarzen egger
winereg ion
wikicatenglish monarchs
firstascentp erson
turkmen istan
ispartofmil itaryconfli
bundeslig a
dÃ¼sse ldorf
elizab eth
festiv al
javascri pt
sungkyunkw an
ispartofmilitaryconfli ct
