#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ d
Ġ ?
Ġd b
u r
e r
c t
ur i
Ġdb o
i n
Ġ {
Ġ }
s t
l e
s e
h er
her e
w here
Ġ Ċ
Ġ where
o r
le ct
Ġ se
Ġse lect
i st
in ct
ist inct
p e
Ġd istinct
a t
r e
Ġdb r
i a
o n
c e
h t
or g
Ġ <
d b
d ia
t p
/ /
: //
pe dia
ht tp
db pedia
s o
u n
t y
a n
ur ce
so urce
Ġ ;
re source
i on
a r
Ġ a
at e
a l
c o
i t
t h
d ate
i l
at ion
Ġ .
r o
l o
un t
ty pe
e s
o f
d f
r df
Ġ rdf
e n
a m
l a
c h
l i
co unt
in g
d er
Ġa s
u m
g e
( ?
p o
f il
r y
p ro
i ty
Ġ 1
Ġdb p
i c
t o
b y
i r
m it
or der
p er
Ġ li
Ġ by
Ġli mit
n um
p la
t er
Ġ order
i s
count ry
Ġ (
un ion
lo c
of f
Ġas k
a u
d e
c ity
Ġ union
e l
pla ce
b er
g u
m e
r ing
Ġ fil
Ġfil ter
Ġd es
se t
Ġdes c
Ġ off
Ġoff set
a re
e d
l an
u l
Ġ 0
b ir
st ar
bir th
g o
g y
th e
loc ation
e le
pro per
proper ty
i g
lo gy
h e
v er
on to
po p
fil m
star ring
onto logy
c a
m an
r a
u se
Ġ )
r an
y e
le a
en t
a ge
b o
Ġ "
st ate
il d
ele v
m p
o k
r i
s po
t al
v e
ct or
th or
am e
au thor
lan gu
0 0
a d
d u
g er
k e
l in
m o
spo use
langu age
ch ild
num ber
a s
d i
d istinct
elev ation
i k
n ame
p ar
u b
Ġ >
un d
ul ation
birth place
pop ulation
a in
t e
or t
ig ht
ye ar
bo ok
f o
n e
st r
at h
re s
un it
de ath
he ight
unit ed
a c
f or
o h
p ort
s on
w n
ia n
al l
co mp
to tal
state s
population total
a y
a ir
h o
j oh
m ar
s ity
u p
v i
are a
lea der
number of
_ (
a go
b el
c er
d en
re n
re ctor
un i
an y
ar ge
al ia
ran k
ger man
mo unt
di rector
comp any
" )
a b
i es
i me
m u
s er
w ik
Ġ re
ge x
ca p
joh n
german y
Ġre gex
) )
b e
b at
d ge
g ro
i d
l d
l u
p h
p res
r it
s h
s p
s ic
w ar
y er
in e
in du
st ry
at er
re at
so f
it e
it al
il l
Ġas c
au str
birth date
ca ve
indu stry
austr alia
1 9
a ct
a ctor
e ur
e st
l s
m am
n o
r am
s s
t le
y ago
st e
on e
an d
al mam
la ke
pro du
per son
te am
fo und
death place
numberof e
uni ver
mount ain
mu sic
cap ital
almam ater
a g
a k
a p
b a
b u
c y
c reat
d es
i f
l arge
m er
m ing
n g
p ub
r u
s d
t a
t ime
x sd
in f
am a
lan d
air port
wik ic
univer sity
creat or
pub li
" @
. _
0 1
c ur
c or
c ar
c up
d o
d is
g ram
h am
k en
m in
m ent
n er
o g
o tal
q u
w rit
w ill
z one
Ġ yago
st ring
at otal
ia m
ar ch
co l
lo ye
en ce
am es
la bel
po l
pro gram
pla yer
gu e
are atotal
mp loye
ren cy
ser ies
bat tle
eur o
time zone
cur rency
writ er
will iam
mploye es
a ce
b s
b ur
b re
b ro
b ul
b ri
b all
b and
c an
c cup
d in
d an
f t
i e
i m
i p
k y
l or
n t
n ation
o s
o wn
o ccup
p ri
s w
s pe
t s
t ion
t it
v is
w e
Ġ '
le y
le ng
se date
at state
re lea
org an
so c
ate din
co m
lo per
es s
li g
ic ia
loc atedin
off icia
de ve
the united
ra ft
lea gue
par ty
ne w
ac k
den sity
id ent
lu ence
ph y
pres ident
sp ain
sof theunited
produ cer
found ation
large st
inf luence
wikic atstate
bri dge
own er
occup ation
spe c
leng th
relea sedate
locatedin area
deve loper
softheunited states
wikicatstate softheunitedstates
' ^
a v
a war
b order
b ama
c k
c la
e ar
f rank
g i
g en
g ames
h al
i re
i so
i co
j e
k no
m i
n ed
o t
o bama
p are
p iso
r ic
s her
s ky
t ist
t on
t elev
t arge
t airport
u ta
v en
w o
x ico
y n
y or
z e
Ġ !
Ġ 2
Ġ count
ist an
pe an
db y
an ce
an ge
ar tist
ro me
ch e
li d
pro f
is ion
me xico
go ver
ra ham
ran ce
ke t
lin col
par is
Ġ> =
fo un
ian ce
all iance
air lin
mar k
den mark
ab raham
dge t
gro und
gro up
ite ct
numberofe mployees
numberofe piso
ag es
bu dget
ming language
publi sher
cor e
ken ned
arch itect
program minglanguage
nation al
soc cer
officia l
largest city
'^ ^
awar d
gen re
pare nt
telev ision
targe tairport
uta h
yor k
gover n
lincol n
numberofepiso des
kenned y
2 01
a f
a q
a st
a ch
a ger
b or
b on
b ar
b en
b um
b as
b ru
c l
c her
c on
c raft
e g
e t
e th
e the
f am
f if
h ar
h av
i le
i se
i ce
i el
j ul
j ap
k ing
k el
m ation
m is
m use
m ad
m ay
m uni
n on
p re
p ill
r ist
r on
r unt
r um
s y
s se
s ub
s ho
t w
t or
t el
t rum
u c
u z
v ation
w er
w or
w ine
w est
Ġ group
Ġ hav
er al
in ce
in str
st er
le vation
here levation
pe n
at ner
re e
ce ss
un ch
an g
ar d
ar s
ar y
ar ter
al i
al ber
al ay
al bum
co lo
it er
it or
it ic
il y
ro y
Ġrdf s
am in
la unch
ch ic
ch el
ch rist
li sh
ing year
um ent
po ser
pro j
ic a
to m
to wn
ir aq
is ation
el vis
ber g
ber lin
gu y
ul t
go ld
go ethe
ig ner
he ad
ra yer
ra phy
ent rance
Ġ" ^
ri d
00 0
ad a
par k
par t
book s
ne t
res ult
death date
for d
for mation
port rayer
wn for
ho lid
vi de
leader name
pres ley
sh atner
sof tw
no bel
ste in
ste ven
music al
ba ik
des igner
if f
mer kel
publi c
car bs
min eral
ment type
og raphy
qu arter
pol itic
euro pean
bur j
bul ls
ball player
can ada
pri ze
tion date
tit le
organ isation
com poser
density rank
foundation place
influence d
spec ies
cla ss
ear th
je ct
kno wnfor
ot herelevation
Ġ! =
ange la
ket ballplayer
foun de
airlin e
national ity
soccer cl
official language
television sho
govern menttype
bar ack
bas ketballplayer
bru ce
fam ily
jap an
mis s
muse um
may or
muni ch
pill ars
runt ime
wor ld
Ġhav ing
instr ument
chic ago
head quarter
holid ay
softw are
soccercl ub
televisionsho w
" ,
, _
. >
1 2
1 4
2 8
2 9
3 1
5 0
7 8
_ %
a der
a str
a pol
b n
b ia
b ra
c r
c ro
c am
c au
c lin
c ru
c ali
d on
d ar
d label
d raft
d rome
e in
e se
e en
e ver
e mployees
e ast
f e
f f
f lo
f ir
f ran
f ren
f act
g h
g m
g in
g al
g are
g ame
g reat
g ang
h ig
h ab
h im
i b
i z
i de
i ve
i den
j ack
j amin
k a
k er
l city
l lor
l yn
l iter
m a
m s
m on
m un
m el
m as
m und
m ine
n i
n at
n ia
n ic
n ter
n ik
o d
o l
o u
o per
p r
p t
p al
p ran
p ad
p ages
p iraq
s lo
s ch
s mo
s ite
s core
s uc
t v
t ur
t ter
t is
t ele
t area
u te
u fact
v an
w w
w in
w al
z er
Ġ 3
Ġ 8
Ġ =
Ġ xsd
ur e
ur er
ur al
ct s
ct ion
in a
in te
in hab
st ing
st ad
le on
le tiondate
se as
her land
or y
or count
or ig
pe t
pe ace
at ing
at ic
at cher
re a
re al
re di
re cor
re public
re sting
on ur
on au
on number
so pran
an k
an n
an t
an ic
an ts
source country
ar a
al d
al ty
al ie
co ver
co smo
it zer
it ants
th ron
th atcher
ro ber
ro ach
ro ute
lo w
en d
am s
la st
ch o
ch ie
ch ess
ch ance
ch ard
ch ina
ing date
ing redi
po pe
Ġ1 0
Ġ1 00
ic ation
to wer
per l
is h
is part
off ice
gu in
me town
ed en
ed ire
ed itor
birth name
location country
location city
ver tis
man ufact
bo ur
ild ing
ok lyn
ri ver
ri chard
ad vertis
ke y
lin k
mo tor
language family
child ren
year s
ne y
res iden
death cau
for nia
port man
comp letiondate
ho metown
joh ann
mar gare
vi ce
vi ation
numberof pages
bel gi
ab bre
wik ip
be er
be gin
bat man
rit chie
19 9
19 50
act ion
act ica
act ive
ss ia
produ ct
found ingyear
mountain s
music by
music composer
ap on
ba le
bu ilding
ru ssia
inf low
wikic ate
do m
dis cover
min ist
og ame
qu een
program me
battle star
euro pop
writer s
bur ton
bro wn
bro oklyn
band leader
sw itzer
sw eden
tit anic
we apon
organ iz
com mun
ess ion
lig ht
influence dby
spec ia
frank lin
mi chel
ric k
sky team
wo od
istan bul
prof it
prof ession
af ric
ager edire
ben jamin
eth nic
jul ia
king dom
mad rid
non profit
sy l
sse s
sub ject
trum pet
uz i
cess or
alber t
alay as
colo m
roy alty
launch pad
christ ian
net herland
formation year
vide ogame
steven s
baik onur
politic ian
founde dby
miss ion
astr onau
apol lo
cro sses
clin t
cru ise
cali fornia
draft team
ein stein
ever est
east wood
flo orcount
fir st
fran c
fren ch
gm t
gal actica
him alayas
mon arch
nat alie
pr ince
suc cessor
tur k
tele commun
inte ger
inhab itants
seas onnumber
orig in
recor dlabel
resting place
sopran os
cosmo drome
thron es
rober ts
chance llor
ingredi ent
ispart of
manufact urer
advertis ing
residen ce
deathcau se
margare t
belgi um
abbre viation
wikip ageredire
discover er
switzer land
organiz ation
michel le
netherland s
astronau t
telecommun ication
wikipageredire cts
