id,question,answers,orig_query,sparql
82,Which actors were born in Germany?,http://dbpedia.org/resource/Susan_Wayland,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Actor { ?uri dbo:birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri dbo:birthPlace> ?place . ?place dbo:country> <http://dbpedia.org/resource/Germany> } }
83,How much carbs does peanut butter have?,20.0,SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs },SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> dbp:carbs ?carbs }
84,Who produced the most films?,http://dbpedia.org/resource/Adolph_Zukor,SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?film rdf:type <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1
85,How many employees does Google have?,57100,SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num },SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> dbo:numberOfEmployees ?num }
86,Give me all actors who were born in Berlin.,http://dbpedia.org/resource/Dru_Berrymore,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Actor ; dbo:birthPlace> <http://dbpedia.org/resource/Berlin> }
87,Who created Goofy?,http://dbpedia.org/resource/Frank_Webb_(cartoonist),SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> dbo:creator ?uri }
88,Which music albums contain the song Last Christmas?,http://dbpedia.org/resource/Classic_Christmas_(Joe_McElderry_album),"SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }","SELECT DISTINCT ?uri WHERE { ?single dbo:album ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }"
89,When was Alberta admitted as province?,1905-09-01,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date },SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> dbp:admittancedate ?date }
90,How many missions does the Soyuz programme have?,139,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri dbp:programme <http://dbpedia.org/resource/Soyuz_programme> }
91,Give me all the TV shows with Neil Patrick Harris.,http://dbpedia.org/resource/Capitol_Critters,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:TelevisionShow ; dbo:starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }
92,When were the Hells Angels founded?,1948-03-17,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date },SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> dbp:founded ?date }
93,What is the net income of Apple?,5.3394E10,SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni },SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> dbo:netIncome ?ni }
94,Give me all Swedish holidays.,http://dbpedia.org/resource/Gustavus_Adolphus_Day,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Holiday ; dbo:country> <http://dbpedia.org/resource/Sweden> }
95,In which city was the former Dutch queen Juliana buried?,http://dbpedia.org/resource/Delft,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a dbo:Settlement }
96,List all the musicals with music by Leonard Bernstein.,http://dbpedia.org/resource/Wonderful_Town,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Musical ; dbo:musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }
97,Give me all companies in the advertising industry.,307,"SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri <http://dbpedia.org/ontology/industry> ?industry FILTER regex(?industry, ""advertising"", ""i"") } }","SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Company { ?uri dbo:industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri dbo:industry> ?industry FILTER regex(?industry, ""advertising"", ""i"") } }"
98,What is the largest metropolitan area in Washington state?,"http://dbpedia.org/resource/Seattle-Tacoma-Olympia,_WA_CSA",SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> dbp:largestmetro ?uri }
99,Who killed John Lennon?,http://dbpedia.org/resource/Mark_David_Chapman,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }
100,Which writers studied in Istanbul?,http://dbpedia.org/resource/Niyazi_Berkes,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Writer { ?uri dbo:almaMater> ?x } UNION { ?uri dbo:education> ?x } { ?x dbo:city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } }
101,Give me all Australian metalcore bands.,http://dbpedia.org/resource/Capture_the_Crown,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Band> ; <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Metalcore> { ?uri <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/hometown> ?h . ?h <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Band ; dbo:genre> <http://dbpedia.org/resource/Metalcore> { ?uri dbo:hometown> <http://dbpedia.org/resource/Australia> } UNION { ?uri dbo:hometown> ?h . ?h dbo:country> <http://dbpedia.org/resource/Australia> } }
102,Which countries adopted the Euro?,http://dbpedia.org/resource/Basque_Country_(greater_region),"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }","SELECT DISTINCT ?uri WHERE { ?uri a dbo:Country { ?uri dbo:currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }"
103,Give me all types of eating disorders.,http://dbpedia.org/resource/Ingestive_behaviors,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> },SELECT DISTINCT ?uri WHERE { ?uri a yago:WikicatEatingDisorders }
104,Was Marc Chagall a jew?,False,"ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }","ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> dbp:ethnicity ""Jewish""@en }"
105,What was Brazil's lowest rank in the FIFA World Ranking?,22,SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n },SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> dbp:fifaMin ?n }
106,How many films did Leonardo DiCaprio star in?,27,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Film ; dbo:starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> }
107,Was Margaret Thatcher a chemist?,True,ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> },ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> dbo:profession <http://dbpedia.org/resource/Chemist> }
108,Which U.S. states are in the same time zone as Utah?,http://dbpedia.org/resource/Nebraska,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Utah> <http://dbpedia.org/property/timezone> ?x . ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/timezone> ?x FILTER ( ?uri != <http://dbpedia.org/resource/Utah> ) },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Utah> dbp:timezone ?x . ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; dbp:timezone> ?x FILTER ( ?uri != <http://dbpedia.org/resource/Utah> ) }
109,Give me all books written by Danielle Steel.,http://dbpedia.org/resource/Thurston_House_(novel),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Book ; dbo:author> <http://dbpedia.org/resource/Danielle_Steel> }
110,Which country has the most official languages?,http://dbpedia.org/resource/Sark,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1
111,What is the total amount of men and women serving in the FDNY?,15629,SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num },SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> dbp:employees ?num }
112,Which actor played Chewbacca?,http://dbpedia.org/resource/Joonas_Suotamo,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/ontology/portrayer> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> dbo:portrayer ?uri }
113,Give me all libraries established earlier than 1400.,http://dbpedia.org/resource/Nanpura_Parsi_Library,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Library ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }
114,Which programming languages were influenced by Perl?,http://dbpedia.org/resource/Perl_Data_Language,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> { ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Perl> } UNION { <http://dbpedia.org/resource/Perl> <http://dbpedia.org/ontology/influenced> ?uri } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:ProgrammingLanguage { ?uri dbo:influencedBy> <http://dbpedia.org/resource/Perl> } UNION { <http://dbpedia.org/resource/Perl> dbo:influenced> ?uri } }
115,In which U.S. state is Mount McKinley located?,http://dbpedia.org/resource/Alaska,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mount_McKinley> dbo:wikiPageRedirects ?x . ?x <http://dbpedia.org/ontology/locatedInArea> ?uri. ?uri rdf:type yago:WikicatStatesOfTheUnitedStates },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mount_McKinley> dbo:wikiPageRedirects ?x . ?x dbo:locatedInArea ?uri. ?uri rdf:type yago:WikicatStatesOfTheUnitedStates }
116,What airlines are part of the SkyTeam alliance?,http://dbpedia.org/resource/CityJet,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Airline> { ?uri <http://dbpedia.org/ontology/alliance> <http://dbpedia.org/resource/SkyTeam> } UNION { ?uri <http://dbpedia.org/ontology/Alliance> <http://dbpedia.org/resource/SkyTeam> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Airline { ?uri dbo:alliance> <http://dbpedia.org/resource/SkyTeam> } UNION { ?uri dbo:Alliance> <http://dbpedia.org/resource/SkyTeam> } }
117,Which ships were called after Benjamin Franklin?,http://dbpedia.org/resource/HMS_Canopus_(1798),SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/shipNamesake> <http://dbpedia.org/resource/Benjamin_Franklin> },SELECT DISTINCT ?uri WHERE { ?uri dbp:shipNamesake <http://dbpedia.org/resource/Benjamin_Franklin> }
118,Give me all Methodist politicians.,"http://dbpedia.org/resource/Charles_S._Chestnut,_IV",SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Politician ; dbo:religion> <http://dbpedia.org/resource/Methodism> }
120,What is the highest mountain?,http://dbpedia.org/resource/Kings_Peak_(Idaho),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri a dbo:Mountain ; dbo:elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1
121,Which poet wrote the most books?,http://dbpedia.org/resource/Jules_Verne,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Poet> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Poet> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x rdf:type <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1
122,Which programming languages influenced Javascript?,http://dbpedia.org/resource/Self_(programming_language),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> ; <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/JavaScript> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:ProgrammingLanguage ; dbo:influenced> <http://dbpedia.org/resource/JavaScript> }
123,Which musician wrote the most books?,http://dbpedia.org/resource/Jo_Nesbø,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Musician> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Musician> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x rdf:type <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1
124,Which films starring Clint Eastwood did he direct himself?,http://dbpedia.org/resource/Play_Misty_for_Me,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Clint_Eastwood> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Clint_Eastwood> },SELECT DISTINCT ?uri WHERE { ?uri dbo:director <http://dbpedia.org/resource/Clint_Eastwood> ; dbo:starring> <http://dbpedia.org/resource/Clint_Eastwood> }
126,Which instruments does Cat Stevens play?,http://dbpedia.org/resource/Baldwin_Piano_Company,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cat_Stevens> <http://dbpedia.org/ontology/instrument> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cat_Stevens> dbo:instrument ?uri }
127,How many airlines are members of the Star Alliance?,97,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> ; <http://dbpedia.org/ontology/alliance> <http://dbpedia.org/resource/Star_Alliance> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Airline ; dbo:alliance> <http://dbpedia.org/resource/Star_Alliance> }
128,Give me all actors called Baldwin.,http://dbpedia.org/resource/Judith_Baldwin,PREFIX foaf:<http://xmlns.com/foaf/0.1/> SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . } },SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> . } UNION { ?uri rdf:type <http://dbpedia.org/ontology/Actor> . } }
129,Who wrote The Hunger Games?,http://dbpedia.org/resource/Suzanne_Collins,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Hunger_Games> <http://dbpedia.org/property/author> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Hunger_Games> dbp:author ?uri }
130,For which label did Elvis record his first album?,http://dbpedia.org/resource/Pickwick_Records,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x rdf:type dbo:Album ; dbo:artist res:Elvis_Presley ; dbo:releaseDate ?y ; dbo:recordLabel ?uri } ORDER BY ASC(?y) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?x rdf:type dbo:Album ; dbo:artist dbr:Elvis_Presley ; dbo:releaseDate ?y ; dbo:recordLabel ?uri } ORDER BY ASC(?y) OFFSET 0 LIMIT 1
131,Is Christian Bale starring in Batman Begins?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Batman_Begins dbo:starring res:Christian_Bale },ASK WHERE { dbr:Batman_Begins dbo:starring dbr:Christian_Bale }
132,Where is the residence of the prime minister of Spain?,http://dbpedia.org/resource/Palacio_de_la_Moncloa,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Prime_Minister_of_Spain> <http://dbpedia.org/property/residence> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Prime_Minister_of_Spain> dbp:residence ?uri }
133,Which actor was casted in the most movies?,http://dbpedia.org/resource/Andy_Lau,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?f <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?f <http://dbpedia.org/ontology/starring> ?uri . } ORDER BY DESC(COUNT(DISTINCT(?f))) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type <http://dbpedia.org/ontology/Actor> . ?f rdf:type> <http://dbpedia.org/ontology/Film> . ?f <http://dbpedia.org/ontology/starring> ?uri . } ORDER BY DESC(COUNT(DISTINCT(?f))) OFFSET 0 LIMIT 1
134,Which countries have more than two official languages?,http://dbpedia.org/resource/Basque_Country_(greater_region),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> ; <http://dbpedia.org/ontology/officialLanguage> ?language } GROUP BY ?uri HAVING ( COUNT(?language) > 2 ),SELECT DISTINCT ?uri WHERE { ?uri a dbo:Country ; dbo:officialLanguage> ?language } GROUP BY ?uri HAVING ( COUNT(?language) > 2 )
135,Which countries have more than ten caves?,http://dbpedia.org/resource/India,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?cave a <http://dbpedia.org/ontology/Cave> { ?cave <http://dbpedia.org/ontology/location> ?uri } UNION { ?cave <http://dbpedia.org/ontology/location> ?loc . ?loc <http://dbpedia.org/ontology/country> ?uri } } GROUP BY ?uri HAVING ( COUNT(?cave) > 10 ),SELECT DISTINCT ?uri WHERE { ?uri a dbo:Country . ?cave a dbo:Cave> { ?cave dbo:location> ?uri } UNION { ?cave dbo:location> ?loc . ?loc dbo:country> ?uri } } GROUP BY ?uri HAVING ( COUNT(?cave) > 10 )
136,Show me all songs from Bruce Springsteen released between 1980 and 1990.,http://dbpedia.org/resource/Downbound_Train,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Song> . ?uri <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Bruce_Springsteen> . ?uri <http://dbpedia.org/ontology/releaseDate> ?date . FILTER (?date >= '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date) },SELECT DISTINCT ?uri WHERE { ?uri rdf:type <http://dbpedia.org/ontology/Song> . ?uri <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Bruce_Springsteen> . ?uri <http://dbpedia.org/ontology/releaseDate> ?date . FILTER (?date >= '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date) }
137,Which television shows were created by John Cleese?,http://dbpedia.org/resource/Monty_Python's_Personal_Best,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/John_Cleese> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:TelevisionShow ; dbo:creator> <http://dbpedia.org/resource/John_Cleese> }
138,When did Latvia join the EU?,2004-05-01,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Latvia> <http://dbpedia.org/property/accessioneudate> ?date },SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Latvia> dbp:accessioneudate ?date }
139,Which soccer players were born on Malta?,http://dbpedia.org/resource/Steve_Bezzina,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerPlayer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Malta> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerPlayer ; dbo:birthPlace> <http://dbpedia.org/resource/Malta> }
140,How many politicians graduated from Columbia University?,12,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Politician> ; <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Columbia_University> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri dbo:profession <http://dbpedia.org/resource/Politician> ; dbo:almaMater> <http://dbpedia.org/resource/Columbia_University> }
141,Give me the birthdays of all actors of the television show Charmed.,1973-9-5,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date },SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> dbo:starring ?actor . ?actor dbo:birthDate> ?date }
142,Which telecommunications organizations are located in Belgium?,7,"SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Organisation> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Telecommunication> } UNION { ?uri <http://dbpedia.org/property/industry> ?industry FILTER regex(?industry, ""Telecommunications"") } { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Belgium> } UNION { ?uri <http://dbpedia.org/property/locationCountry> ""Belgium""@en } }","SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Organisation { ?uri dbo:industry> <http://dbpedia.org/resource/Telecommunication> } UNION { ?uri <http://dbpedia.org/property/industry> ?industry FILTER regex(?industry, ""Telecommunications"") } { ?uri dbo:location> <http://dbpedia.org/resource/Belgium> } UNION { ?uri <http://dbpedia.org/property/locationCountry> ""Belgium""@en } }"
143,Give me a list of all lakes in Denmark.,http://dbpedia.org/resource/Arresø,SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } },SELECT DISTINCT ?uri WHERE { { ?uri a dbo:Lake ; dbo:country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }
144,How many children does Eddie Murphy have?,9,SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Eddie_Murphy> <http://dbpedia.org/property/children> ?n },SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Eddie_Murphy> dbp:children ?n }
145,Show me all English Gothic buildings in Kent.,"http://dbpedia.org/resource/St_Mary's_Church,_Capel-le-Ferne",SELECT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Building> ; <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/English_Gothic_architecture> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Kent> },SELECT ?uri WHERE { ?uri a dbo:Building ; dbo:architecturalStyle> <http://dbpedia.org/resource/English_Gothic_architecture> ; dbo:location> <http://dbpedia.org/resource/Kent> }
146,Who is the manager of Real Madrid?,http://dbpedia.org/resource/Zinedine_Zidane,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Real_Madrid_C.F.> <http://dbpedia.org/ontology/manager> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Real_Madrid_C.F.> dbo:manager ?uri }
147,In which countries can you pay using the West African CFA franc?,http://dbpedia.org/resource/French_Upper_Volta,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/West_African_CFA_franc> },SELECT DISTINCT ?uri WHERE { ?uri dbo:currency <http://dbpedia.org/resource/West_African_CFA_franc> }
148,Which holidays are celebrated around the world?,http://dbpedia.org/resource/National_Sorry_Day,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }
149,What is the longest river?,http://dbpedia.org/resource/Irtysh_River,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> { ?uri <http://dbpedia.org/ontology/length> ?l } UNION { ?uri <http://dbpedia.org/property/length> ?l } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri a dbo:River { ?uri dbo:length> ?l } UNION { ?uri <http://dbpedia.org/property/length> ?l } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1
150,Which organizations were founded in 1930?,http://dbpedia.org/resource/Lidl,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Organisation> { ?uri <http://dbpedia.org/ontology/formationYear> ?date } UNION { ?uri <http://dbpedia.org/ontology/foundingYear> ?date } FILTER regex(?date, ""^1930"") }","SELECT DISTINCT ?uri WHERE { ?uri a dbo:Organisation { ?uri dbo:formationYear> ?date } UNION { ?uri dbo:foundingYear> ?date } FILTER regex(?date, ""^1930"") }"
151,What is the birth name of Angela Merkel?,Angela Dorothea Kasner,SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/Angela_Merkel> <http://dbpedia.org/property/birthName> ?string },SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/Angela_Merkel> dbp:birthName ?string }
152,Who has Tom Cruise been married to?,http://dbpedia.org/resource/Katie_Holmes,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tom_Cruise> },SELECT DISTINCT ?uri WHERE { ?uri dbo:spouse <http://dbpedia.org/resource/Tom_Cruise> }
153,Which weapons did Heckler & Koch develop?,http://dbpedia.org/resource/XM25_CDTE,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Weapon> ; <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Heckler_&_Koch> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Weapon ; <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Heckler_&_Koch> }
154,What is the smallest city by area in Germany?,http://dbpedia.org/resource/Eckernförde,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX skos: <http://www.w3.org/2004/02/skos/core#> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dct: <http://purl.org/dc/terms/> SELECT ?city WHERE { ?m skos:broader dbc:Cities_in_Germany . ?city dct:subject ?m ; dbo:areaTotal ?area } ORDER BY ?area LIMIT 1,SELECT ?city WHERE { ?m skos:broader dbc:Cities_in_Germany . ?city dct:subject ?m ; dbo:areaTotal ?area } ORDER BY ?area LIMIT 1
155,What is the ruling party in Lisbon?,http://dbpedia.org/resource/Socialist_Party_(Portugal),SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lisbon> <http://dbpedia.org/property/leaderParty> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lisbon> dbp:leaderParty ?uri }
156,How heavy is Jupiter's lightest moon?,1100.0,SELECT DISTINCT ?n WHERE { ?uri <http://dbpedia.org/property/satelliteOf> <http://dbpedia.org/resource/Jupiter> ; <http://dbpedia.org/ontology/mass> ?n } ORDER BY ASC(?n) OFFSET 0 LIMIT 1,SELECT DISTINCT ?n WHERE { ?uri <http://dbpedia.org/property/satelliteOf> <http://dbpedia.org/resource/Jupiter> ; dbo:mass ?n } ORDER BY ASC(?n) OFFSET 0 LIMIT 1
157,How many employees does IBM have?,377757,SELECT DISTINCT ?number WHERE { <http://dbpedia.org/resource/IBM> <http://dbpedia.org/ontology/numberOfEmployees> ?number },SELECT DISTINCT ?number WHERE { <http://dbpedia.org/resource/IBM> dbo:numberOfEmployees ?number }
158,List all episodes of the first season of the HBO television series The Sopranos!,http://dbpedia.org/resource/Isabella_(The_Sopranos),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 },SELECT DISTINCT ?uri WHERE { ?uri dbo:series dbr:The_Sopranos ; dbo:seasonNumber 1 }
159,What does ICRO stand for?,http://dbpedia.org/resource/Irish_Cave_Rescue_Organisation,"SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/abbreviation> ""ICRO"" }","SELECT DISTINCT ?uri WHERE { ?uri dbo:abbreviation ""ICRO"" }"
161,Give me all films produced by Hal Roach.,http://dbpedia.org/resource/The_McGuerins_from_Brooklyn,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:producer> <http://dbpedia.org/resource/Hal_Roach> }
162,Who played Agent Smith in Matrix?,http://dbpedia.org/resource/Hugo_Weaving,PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Agent_Smith <http://dbpedia.org/ontology/portrayer> ?uri },SELECT DISTINCT ?uri WHERE { dbr:Agent_Smith dbo:portrayer ?uri }
