id,question,answers,orig_query,sparql
253,Which companies produce hovercrafts?,http://dbpedia.org/resource/Saunders-Roe,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:product res:Hovercraft },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:product dbr:Hovercraft }
254,Who was the wife of U.S. president Lincoln?,http://dbpedia.org/resource/Mary_Todd_Lincoln,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Abraham_Lincoln dbo:spouse ?uri },SELECT DISTINCT ?uri WHERE { dbr:Abraham_Lincoln dbo:spouse ?uri }
255,Which species does an elephant belong?,Proboscidea,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?species WHERE { dbr:Elephant dbp:species ?species },SELECT ?species WHERE { dbr:Elephant dbp:species ?species }
256,How many people live in the capital of Australia?,381488,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Australia dbo:capital ?x . ?x dbo:populationTotal ?num },SELECT DISTINCT ?num WHERE { dbr:Australia dbo:capital ?x . ?x dbo:populationTotal ?num }
257,In which ancient empire could you pay with cocoa beans?,http://dbpedia.org/resource/Aztec_Empire,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:currency res:Cocoa_bean },SELECT DISTINCT ?uri WHERE { ?uri dbo:currency dbr:Cocoa_bean }
258,How many theories did Albert Einstein come up with?,12,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { dbr:Albert_Einstein dbo:knownFor ?uri },SELECT (COUNT(?uri) AS ?count) WHERE { dbr:Albert_Einstein dbo:knownFor ?uri }
259,Who composed the soundtrack for Cameron's Titanic?,http://dbpedia.org/resource/James_Horner,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Titanic_(1997_film)> dbo:musicComposer ?uri },SELECT DISTINCT ?uri WHERE { dbr:Titanic_(1997_film) dbo:musicComposer ?uri }
260,Give me the runtime of Toy Story.,4860.0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime },SELECT DISTINCT ?runtime WHERE { dbr:Toy_Story dbo:runtime ?runtime }
262,With how many countries Iran has borders?,http://dbpedia.org/resource/Pakistan,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?border WHERE { dbr:Geography_of_Iran dbp:borders ?border } LIMIT 8,SELECT ?border WHERE { dbr:Geography_of_Iran dbp:borders ?border } LIMIT 8
263,Which electronics companies were founded in Beijing?,http://dbpedia.org/resource/Lenovo,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:industry res:Electronics ; dbo:foundationPlace res:Beijing },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:industry dbr:Electronics ; dbo:foundationPlace dbr:Beijing }
264,Who was the successor of John F. Kennedy?,http://dbpedia.org/resource/Benjamin_A._Smith_II,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:successor ?uri },SELECT DISTINCT ?uri WHERE { dbr:John_F._Kennedy dbo:successor ?uri }
265,Who is the mayor of Paris?,http://dbpedia.org/resource/Anne_Hidalgo,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Paris dbo:mayor ?uri },SELECT DISTINCT ?uri WHERE { dbr:Paris dbo:mayor ?uri }
266,Did Arnold Schwarzenegger attend a university?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Arnold_Schwarzenegger dbo:almaMater ?x . ?x rdf:type dbo:University },ASK WHERE { dbr:Arnold_Schwarzenegger dbo:almaMater ?x . ?x rdf:type dbo:University }
267,Is James Bond married?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:James_Bond dbo:spouse ?uri },ASK WHERE { dbr:James_Bond dbo:spouse ?uri }
268,Does the Isar flow into a lake?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?x dbo:inflow res:Isar ; rdf:type dbo:Lake },ASK WHERE { ?x dbo:inflow dbr:Isar ; rdf:type dbo:Lake }
269,Which Indian company has the most employees?,http://dbpedia.org/resource/Railway_Board,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:location res:India ; dbo:numberOfEmployees ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:location dbr:India ; dbo:numberOfEmployees ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1
270,Who was John F. Kennedy's vice president?,http://dbpedia.org/resource/Lyndon_B._Johnson,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:vicePresident ?uri },SELECT DISTINCT ?uri WHERE { dbr:John_F._Kennedy dbo:vicePresident ?uri }
271,Which country does the creator of Miffy come from?,http://dbpedia.org/resource/Netherlands,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Miffy dbo:creator ?x . ?x dbo:nationality ?uri },SELECT DISTINCT ?uri WHERE { dbr:Miffy dbo:creator ?x . ?x dbo:nationality ?uri }
273,In what city is the Heineken brewery?,http://dbpedia.org/resource/Amsterdam,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Heineken dbo:manufacturer ?x . ?x dbo:locationCity ?uri },SELECT DISTINCT ?uri WHERE { dbr:Heineken dbo:manufacturer ?x . ?x dbo:locationCity ?uri }
274,Is Barack Obama a democrat?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Barack_Obama dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> },ASK WHERE { dbr:Barack_Obama dbo:party dbr:Democratic_Party_(United_States) }
275,List the children of Margaret Thatcher.,http://dbpedia.org/resource/Carol_Thatcher,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri },SELECT DISTINCT ?uri WHERE { dbr:Margaret_Thatcher dbo:child ?uri }
276,From which region is the Melon de Bourgogne?,http://dbpedia.org/resource/Southern_Ontario,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Melon_de_Bourgogne dbo:wineRegion ?uri },SELECT DISTINCT ?uri WHERE { dbr:Melon_de_Bourgogne dbo:wineRegion ?uri }
278,how big is the total area of North Rhine- Westphalia?,3.40841e+10,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?tarea WHERE { dbr:North_Rhine-Westphalia dbo:areaTotal ?tarea },SELECT ?tarea WHERE { dbr:North_Rhine-Westphalia dbo:areaTotal ?tarea }
279,Which city has the most inhabitants?,http://dbpedia.org/resource/Carei,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:populationTotal ?pop } ORDER BY DESC(?pop) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:populationTotal ?pop } ORDER BY DESC(?pop) OFFSET 0 LIMIT 1
280,What is Donald Trump's main business?,http://dbpedia.org/resource/Trump_Hotel_Las_Vegas,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?owner WHERE { ?owner dbo:owner dbr:Donald_Trump },SELECT ?owner WHERE { ?owner dbo:owner dbr:Donald_Trump }
281,When will start the final match of the football world cup 2018?,2018-07-15,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?Date WHERE { dbr:2018_FIFA_World_Cup dbp:date ?Date } ORDER BY DESC(?Date) LIMIT 1,SELECT ?Date WHERE { dbr:2018_FIFA_World_Cup dbp:date ?Date } ORDER BY DESC(?Date) LIMIT 1
282,Which films did Stanley Kubrick direct?,http://dbpedia.org/resource/Day_of_the_Fight,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:director res:Stanley_Kubrick },SELECT DISTINCT ?uri WHERE { ?uri dbo:director dbr:Stanley_Kubrick }
283,how much is the population  Iraq?,37056169,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?pIraq WHERE { dbr:Iraq dbo:populationTotal ?pIraq },SELECT ?pIraq WHERE { dbr:Iraq dbo:populationTotal ?pIraq }
284,How many inhabitants does the largest city in Canada have?,2615060,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Canada dbo:largestCity ?city . ?city dbo:populationTotal ?num },SELECT DISTINCT ?num WHERE { dbr:Canada dbo:largestCity ?city . ?city dbo:populationTotal ?num }
285,Who is the mayor of the capital of French Polynesia?,http://dbpedia.org/resource/Michel_Buillard,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:French_Polynesia dbo:capital ?x . ?x dbo:mayor ?uri },SELECT DISTINCT ?uri WHERE { dbr:French_Polynesia dbo:capital ?x . ?x dbo:mayor ?uri }
286,Give me all actors starring in movies directed by William Shatner.,http://dbpedia.org/resource/Tom_Towles,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri },SELECT DISTINCT ?uri WHERE { ?x dbo:director dbr:William_Shatner ; dbo:starring ?uri }
287,How tall is Claudia Schiffer?,1.81,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?height WHERE { res:Claudia_Schiffer dbo:height ?height },SELECT DISTINCT ?height WHERE { dbr:Claudia_Schiffer dbo:height ?height }
288,how much is the population densty rank of germany?,58,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?rank WHERE { dbr:Germany dbp:populationDensityRank ?rank },SELECT ?rank WHERE { dbr:Germany dbp:populationDensityRank ?rank }
289,What is the highest mountain in Italy?,http://dbpedia.org/resource/Mont_Blanc,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Italy ; dbo:elevation ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea dbr:Italy ; dbo:elevation ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1
290,List all games by GMT.,http://dbpedia.org/resource/Washington's_War,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games },SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher dbr:GMT_Games }
291,What is the official language of Suriname?,http://dbpedia.org/resource/Dutch_language,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Suriname dbo:officialLanguage ?uri },SELECT DISTINCT ?uri WHERE { dbr:Suriname dbo:officialLanguage ?uri }
292,In which city did Nikos Kazantzakis die?,http://dbpedia.org/resource/Freiburg_im_Breisgau,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Nikos_Kazantzakis dbo:deathPlace ?uri . ?uri rdf:type dbo:Town },SELECT DISTINCT ?uri WHERE { dbr:Nikos_Kazantzakis dbo:deathPlace ?uri . ?uri rdf:type dbo:Town }
293,What is in a chocolate chip cookie?,http://dbpedia.org/resource/Chocolate_chip,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Chocolate_chip_cookie dbo:ingredient ?uri },SELECT DISTINCT ?uri WHERE { dbr:Chocolate_chip_cookie dbo:ingredient ?uri }
294,In which country is the Limerick Lake?,http://dbpedia.org/resource/Canada,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Limerick_Lake dbo:country ?uri },SELECT DISTINCT ?uri WHERE { dbr:Limerick_Lake dbo:country ?uri }
295,Give me all video games published by Mean Hamster Software.,http://dbpedia.org/resource/Crossbow_(video_game),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher dbr:Mean_Hamster_Software }
296,Give me all members of Prodigy.,http://dbpedia.org/resource/Maxim_(musician),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri },SELECT DISTINCT ?uri WHERE { dbr:The_Prodigy dbo:bandMember ?uri }
297,In which time zone is Rome?,http://dbpedia.org/resource/Central_European_Time,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Rome dbo:timeZone ?uri },SELECT DISTINCT ?uri WHERE { dbr:Rome dbo:timeZone ?uri }
298,How high is the lighthouse in Colombo?,15.0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Colombo_Lighthouse dbo:height ?num },SELECT DISTINCT ?num WHERE { dbr:Colombo_Lighthouse dbo:height ?num }
299,Who are the writers of the Wall album of Pink Floyd?,"Gilmour,",PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?writers WHERE { dbr:The_Wall dbp:writer ?writers },SELECT ?writers WHERE { dbr:The_Wall dbp:writer ?writers }
300,Who is the mayor of Rotterdam?,http://dbpedia.org/resource/Ahmed_Aboutaleb,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Rotterdam dbo:leaderName ?uri },SELECT DISTINCT ?uri WHERE { dbr:Rotterdam dbo:leaderName ?uri }
301,What is the largest city in Australia?,http://dbpedia.org/resource/Sydney,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Australia dbo:largestCity ?uri },SELECT DISTINCT ?uri WHERE { dbr:Australia dbo:largestCity ?uri }
302,Who was married to president Chirac?,http://dbpedia.org/resource/Bernadette_Chirac,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Jacques_Chirac dbo:spouse ?uri },SELECT DISTINCT ?uri WHERE { dbr:Jacques_Chirac dbo:spouse ?uri }
303,What form of government is found in South Africa?,http://dbpedia.org/resource/Unitary_state,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { dbr:South_Africa dbo:governmentType ?uri },SELECT ?uri WHERE { dbr:South_Africa dbo:governmentType ?uri }
304,How high is the Yokohama Marine Tower?,106.07,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Yokohama_Marine_Tower dbo:height ?num },SELECT DISTINCT ?num WHERE { dbr:Yokohama_Marine_Tower dbo:height ?num }
306,Who is the tallest basketball player?,http://dbpedia.org/resource/Thijs_Vermeulen,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:BasketballPlayer ; dbo:height ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:BasketballPlayer ; dbo:height ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1
307,How many languages are spoken in Turkmenistan?,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?x) AS ?c) WHERE { res:Turkmenistan dbo:language ?x },SELECT (COUNT(DISTINCT ?x) AS ?c) WHERE { dbr:Turkmenistan dbo:language ?x }
308,Did Che Guevara have children?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Che_Guevara dbo:child ?uri },ASK WHERE { dbr:Che_Guevara dbo:child ?uri }
309,Did Kaurismäki ever win the Grand Prix at Cannes?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aki_Kaurismäki dbo:award <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> },ASK WHERE { dbr:Aki_Kaurismäki dbo:award dbr:Grand_Prix_(Cannes_Film_Festival) }
310,To which party does the mayor of Paris belong?,http://dbpedia.org/resource/Socialist_Party_(France),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Paris dbo:mayor ?x . ?x dbo:party ?uri },SELECT DISTINCT ?uri WHERE { dbr:Paris dbo:mayor ?x . ?x dbo:party ?uri }
311,Who is the Formula 1 race driver with the most races?,http://dbpedia.org/resource/Michael_Schumacher,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:FormulaOneRacer ; dbo:races ?x } ORDER BY DESC(?x) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:FormulaOneRacer ; dbo:races ?x } ORDER BY DESC(?x) OFFSET 0 LIMIT 1
312,What country is Sitecore from?,http://dbpedia.org/resource/Denmark,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Sitecore dbo:foundationPlace ?uri },SELECT DISTINCT ?uri WHERE { dbr:Sitecore dbo:foundationPlace ?uri }
313,Give me the birth place of Frank Sinatra.,"http://dbpedia.org/resource/Hoboken,_New_Jersey",PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place },SELECT DISTINCT ?place WHERE { dbr:Frank_Sinatra dbo:birthPlace ?place }
314,Is Christian Bale starring in Velvet Goldmine?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Velvet_Goldmine dbo:starring res:Christian_Bale },ASK WHERE { dbr:Velvet_Goldmine dbo:starring dbr:Christian_Bale }
315,Who is the son of Sonny and Cher?,http://dbpedia.org/resource/Chaz_Bono,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:parent res:Cher ; dbo:parent res:Sonny_Bono },SELECT DISTINCT ?uri WHERE { ?uri dbo:parent dbr:Cher ; dbo:parent dbr:Sonny_Bono }
316,How many ethnic groups live in Slovenia?,4,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Slovenia dbo:ethnicGroup ?uri },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { dbr:Slovenia dbo:ethnicGroup ?uri }
317,What is the capital of Cameroon?,http://dbpedia.org/resource/Yaoundé,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Cameroon dbo:capital ?uri },SELECT DISTINCT ?uri WHERE { dbr:Cameroon dbo:capital ?uri }
318,Was Natalie Portman born in the United States?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Natalie_Portman dbo:birthPlace ?city . ?city dbo:country res:United_States },ASK WHERE { dbr:Natalie_Portman dbo:birthPlace ?city . ?city dbo:country dbr:United_States }
319,How many pages does War and Peace have?,1225,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:War_and_Peace dbo:numberOfPages ?n },SELECT DISTINCT ?n WHERE { dbr:War_and_Peace dbo:numberOfPages ?n }
320,Who is the oldest child of Meryl Streep?,http://dbpedia.org/resource/Henry_Wolfe_Gummer,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Meryl_Streep dbo:child ?uri . ?uri dbo:birthDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { dbr:Meryl_Streep dbo:child ?uri . ?uri dbo:birthDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1
321,Which television shows were created by Walt Disney?,http://dbpedia.org/resource/Mickey_Mouse_Clubhouse,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:TelevisionShow ; dbo:creator res:Walt_Disney },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:TelevisionShow ; dbo:creator dbr:Walt_Disney }
322,What does IYCM stand for?,http://dbpedia.org/resource/Youth_Climate_Movement,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:abbreviation ""IYCM"" }","SELECT DISTINCT ?uri WHERE { ?uri dbo:abbreviation ""IYCM"" }"
323,Which types of grapes grow in Oregon?,http://dbpedia.org/resource/Tempranillo,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Oregon_wine dbo:growingGrape ?uri },SELECT DISTINCT ?uri WHERE { dbr:Oregon_wine dbo:growingGrape ?uri }
324,Was U.S. president Jackson involved in a war?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Andrew_Jackson dbo:battle ?battle },ASK WHERE { dbr:Andrew_Jackson dbo:battle ?battle }
325,When was the Titanic completed?,1912-04-02,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:RMS_Titanic dbo:completionDate ?date },SELECT DISTINCT ?date WHERE { dbr:RMS_Titanic dbo:completionDate ?date }
326,Did Tesla win a nobel prize in physics?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics },ASK WHERE { dbr:Nikola_Tesla dbo:award dbr:Nobel_Prize_in_Physics }
327,How many states are in Mexico?,31,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { ?uri dbo:type dbr:States_of_Mexico },SELECT (COUNT(?uri) AS ?count) WHERE { ?uri dbo:type dbr:States_of_Mexico }
329,How much did the Lego Movie cost?,6.0E7,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:The_Lego_Movie dbo:budget ?n },SELECT DISTINCT ?n WHERE { dbr:The_Lego_Movie dbo:budget ?n }
330,Who composed the music for Harold and Maude?,http://dbpedia.org/resource/Cat_Stevens,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Harold_and_Maude dbo:musicComposer ?uri },SELECT DISTINCT ?uri WHERE { dbr:Harold_and_Maude dbo:musicComposer ?uri }
332,Which city has the least inhabitants?,http://dbpedia.org/resource/Bakhdida,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:populationTotal ?pop } ORDER BY ASC(?pop) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:populationTotal ?pop } ORDER BY ASC(?pop) OFFSET 0 LIMIT 1
333,Where is Syngman Rhee buried?,http://dbpedia.org/resource/Seoul_National_Cemetery,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Syngman_Rhee dbo:restingPlace ?uri },SELECT DISTINCT ?uri WHERE { dbr:Syngman_Rhee dbo:restingPlace ?uri }
334,Does Neymar play for Real Madrid?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Neymar dbo:team <http://dbpedia.org/resource/Real_Madrid_C.F.> },ASK WHERE { dbr:Neymar dbo:team dbr:Real_Madrid_C.F. }
335,Who wrote the book The Pillars of the Earth?,http://dbpedia.org/resource/Ken_Follett,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri },SELECT DISTINCT ?uri WHERE { dbr:The_Pillars_of_the_Earth dbo:author ?uri }
336,Do Prince Harry and Prince William have the same parents?,True,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . res:Prince_Harry dbo:parent ?x }","ASK WHERE { dbr:Prince_William,_Duke_of_Cambridge dbo:parent ?x . dbr:Prince_Harry dbo:parent ?x }"
337,Who was the doctoral supervisor of Albert Einstein?,http://dbpedia.org/resource/Alfred_Kleiner,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Albert_Einstein dbo:doctoralAdvisor ?uri },SELECT DISTINCT ?uri WHERE { dbr:Albert_Einstein dbo:doctoralAdvisor ?uri }
338,Does Breaking Bad have more episodes than Game of Thrones?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Breaking_Bad dbo:numberOfEpisodes ?x . res:Game_of_Thrones dbo:numberOfEpisodes ?y FILTER ( ?y > ?x ) },ASK WHERE { dbr:Breaking_Bad dbo:numberOfEpisodes ?x . dbr:Game_of_Thrones dbo:numberOfEpisodes ?y FILTER ( ?y > ?x ) }
339,Who was Vincent van Gogh inspired by?,http://dbpedia.org/resource/Anton_Mauve,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:influenced res:Vincent_van_Gogh },SELECT DISTINCT ?uri WHERE { ?uri dbo:influenced dbr:Vincent_van_Gogh }
340,Which building after the Burj Khalifa has the most floors?,http://dbpedia.org/resource/102_Incheon_Tower,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Burj_Khalifa dbo:floorCount ?burj . ?uri rdf:type dbo:Building ; dbo:floorCount ?proj FILTER ( ?proj < ?burj ) } ORDER BY DESC(?proj) LIMIT 1,SELECT DISTINCT ?uri WHERE { dbr:Burj_Khalifa dbo:floorCount ?burj . ?uri rdf:type dbo:Building ; dbo:floorCount ?proj FILTER ( ?proj < ?burj ) } ORDER BY DESC(?proj) LIMIT 1
341,What was the final result of the War of the Roses?,Decisive Tudor victory,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT DISTINCT ?result WHERE { ?uri dbo:isPartOfMilitaryConflict dbr:Wars_of_the_Roses ; dbo:result ?result ; dbo:date ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1,SELECT DISTINCT ?result WHERE { ?uri dbo:isPartOfMilitaryConflict dbr:Wars_of_the_Roses ; dbo:result ?result ; dbo:date ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1
342,How much did Pulp Fiction cost?,8.0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:Pulp_Fiction dbo:budget ?n },SELECT DISTINCT ?n WHERE { dbr:Pulp_Fiction dbo:budget ?n }
343,Is proinsulin a protein?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Proinsulin rdf:type dbo:Protein },ASK WHERE { dbr:Proinsulin rdf:type dbo:Protein }
344,Do Urdu and Persian have a common root?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { dbr:Urdu dbo:languageFamily ?uri . dbr:Persian_language dbo:languageFamily ?uri },ASK WHERE { dbr:Urdu dbo:languageFamily ?uri . dbr:Persian_language dbo:languageFamily ?uri }
345,Who is starring in Spanish movies produced by Benicio del Toro?,http://dbpedia.org/resource/Benicio_del_Toro,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?film rdf:type dbo:Film ; dbo:country res:Spain ; dbo:producer res:Benicio_del_Toro ; dbo:starring ?uri . ?uri rdf:type dbo:Person },SELECT DISTINCT ?uri WHERE { ?film rdf:type dbo:Film ; dbo:country dbr:Spain ; dbo:producer dbr:Benicio_del_Toro ; dbo:starring ?uri . ?uri rdf:type dbo:Person }
346,Is Lake Baikal bigger than the Great Bear Lake?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Lake_Baikal dbo:areaTotal ?a1 . res:Great_Bear_Lake dbo:areaTotal ?a2 FILTER ( ?a1 > ?a2 ) },ASK WHERE { dbr:Lake_Baikal dbo:areaTotal ?a1 . dbr:Great_Bear_Lake dbo:areaTotal ?a2 FILTER ( ?a1 > ?a2 ) }
347,Show me all books in Asimov's Foundation series.,http://dbpedia.org/resource/The_Originist,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series },SELECT DISTINCT ?uri WHERE { ?uri dbo:series dbr:Foundation_series }
348,Where was Bach born?,http://dbpedia.org/resource/Eisenach,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Johann_Sebastian_Bach dbo:birthPlace ?uri },SELECT DISTINCT ?uri WHERE { dbr:Johann_Sebastian_Bach dbo:birthPlace ?uri }
349,Which city has the oldest running metro?,http://dbpedia.org/resource/Almaty,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?loc WHERE { ?uri dbo:type dbr:Rapid_transit ; dbo:openingYear ?date ; dbo:location ?loc . ?loc rdf:type dbo:City } ORDER BY ASC(?date) LIMIT 1,SELECT ?loc WHERE { ?uri dbo:type dbr:Rapid_transit ; dbo:openingYear ?date ; dbo:location ?loc . ?loc rdf:type dbo:City } ORDER BY ASC(?date) LIMIT 1
350,Who designed the Brooklyn Bridge?,http://dbpedia.org/resource/John_Augustus_Roebling,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Brooklyn_Bridge dbo:architect ?uri },SELECT DISTINCT ?uri WHERE { dbr:Brooklyn_Bridge dbo:architect ?uri }
351,How many people live in Eurasia?,5041175000,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?population WHERE { res:Eurasia dbo:populationTotal ?population },SELECT DISTINCT ?population WHERE { dbr:Eurasia dbo:populationTotal ?population }
352,Who is the host of the BBC Wildlife Specials?,http://dbpedia.org/resource/David_Attenborough,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:BBC_Wildlife_Specials dbo:presenter ?uri },SELECT DISTINCT ?uri WHERE { dbr:BBC_Wildlife_Specials dbo:presenter ?uri }
354,What country is Mount Everest in?,http://dbpedia.org/resource/China,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Mount_Everest dbo:locatedInArea ?uri . ?uri rdf:type dbo:Country },SELECT DISTINCT ?uri WHERE { dbr:Mount_Everest dbo:locatedInArea ?uri . ?uri rdf:type dbo:Country }
