id,question,answers,orig_query,sparql
1,List all boardgames by GMT.,http://dbpedia.org/resource/Washington's_War,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games },SELECT ?uri WHERE { ?uri dbo:publisher dbr:GMT_Games }
2,Who developed Skype?,http://dbpedia.org/resource/Microsoft,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Skype dbo:developer ?uri. },SELECT DISTINCT ?uri WHERE { dbr:Skype dbo:developer ?uri. }
3,Which people were born in Heraklion?,http://dbpedia.org/resource/Kapsetaki_duo,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX onto: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri rdf:type onto:Person ; onto:birthPlace <http://dbpedia.org/resource/Heraklion>. },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Person ; dbo:birthPlace dbr:Heraklion. }
4,In which U.S. state is Area 51 located?,http://dbpedia.org/resource/Nevada,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Area_51 dbo:location ?uri . ?uri dbo:country res:United_States. },SELECT DISTINCT ?uri WHERE { dbr:Area_51 dbo:location ?uri . ?uri dbo:country dbr:United_States. }
5,Who is the mayor of New York City?,http://dbpedia.org/resource/Bill_de_Blasio,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:New_York_City dbo:leaderName ?uri },SELECT DISTINCT ?uri WHERE { dbr:New_York_City dbo:leaderName ?uri }
7,Where did Abraham Lincoln die?,"http://dbpedia.org/resource/Washington,_D.C.",PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Abraham_Lincoln dbo:deathPlace ?uri. },SELECT DISTINCT ?uri WHERE { dbr:Abraham_Lincoln dbo:deathPlace ?uri. }
8,Which airports does Air China serve?,http://dbpedia.org/resource/Tianjin_Binhai_International_Airport,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Air_China dbo:targetAirport ?uri },SELECT DISTINCT ?uri WHERE { dbr:Air_China dbo:targetAirport ?uri }
9,Give me all actors starring in movies directed by and starring William Shatner.,http://dbpedia.org/resource/Tom_Towles,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } },SELECT DISTINCT ?uri WHERE { ?x dbo:director dbr:William_Shatner ; dbo:starring dbr:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }
10,What are the official languages of the Philippines?,http://dbpedia.org/resource/Philippine_English,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Philippines dbo:officialLanguage ?uri },SELECT DISTINCT ?uri WHERE { dbr:Philippines dbo:officialLanguage ?uri }
11,Give me all Danish films.,http://dbpedia.org/resource/Stolen_Spring_(film),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country dbr:Denmark }
12,Which movies starring Brad Pitt were directed by Guy Ritchie?,http://dbpedia.org/resource/Snatch_(film),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Brad_Pitt ; dbo:director res:Guy_Ritchie },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring dbr:Brad_Pitt ; dbo:director dbr:Guy_Ritchie }
13,Give me the grandchildren of Bruce Lee.,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri },SELECT DISTINCT ?uri WHERE { dbr:Bruce_Lee dbo:child ?child . ?child dbp:children ?uri }
14,Which other weapons did the designer of the Uzi develop?,http://dbpedia.org/resource/Minebea_PM-9,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Weapon ; dbp:designer ?x . res:Uzi dbp:designer ?x FILTER ( ?uri != res:Uzi ) },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Weapon ; dbp:designer ?x . dbr:Uzi dbp:designer ?x FILTER ( ?uri != dbr:Uzi ) }
15,Who is the owner of Universal Studios?,http://dbpedia.org/resource/Comcast,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Universal_Studios dbo:owner ?uri },SELECT DISTINCT ?uri WHERE { dbr:Universal_Studios dbo:owner ?uri }
16,Which state of the USA has the highest population density?,http://dbpedia.org/resource/New_Jersey,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:densityrank ?rank } ORDER BY ASC(?rank) LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:densityrank ?rank } ORDER BY ASC(?rank) LIMIT 1
17,Which monarchs were married to a German?,http://dbpedia.org/resource/Mieszko_I_of_Poland,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Monarch ; dbo:spouse ?spouse { ?spouse dbo:birthPlace res:Germany } UNION { ?spouse dbo:birthPlace ?p . ?p dbo:country res:Germany } },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Monarch ; dbo:spouse ?spouse { ?spouse dbo:birthPlace dbr:Germany } UNION { ?spouse dbo:birthPlace ?p . ?p dbo:country dbr:Germany } }
18,Which organizations were founded in 1950?,http://dbpedia.org/resource/B.A._Schiff_&_Associates,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Organisation { ?uri dbo:formationYear ?date } UNION { ?uri dbo:foundingYear ?date } UNION { ?uri dbp:foundation ?date } UNION { ?uri dbp:formation ?date } FILTER regex(?date, ""^1950"") }","SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Organisation { ?uri dbo:formationYear ?date } UNION { ?uri dbo:foundingYear ?date } UNION { ?uri dbp:foundation ?date } UNION { ?uri dbp:formation ?date } FILTER regex(?date, ""^1950"") }"
19,Who created the comic Captain America?,http://dbpedia.org/resource/Jack_Kirby,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Captain_America dbo:creator ?uri },SELECT DISTINCT ?uri WHERE { dbr:Captain_America dbo:creator ?uri }
20,Give me the Apollo 14 astronauts.,http://dbpedia.org/resource/Stuart_Roosa,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 },SELECT DISTINCT ?uri WHERE { ?uri dbo:mission dbr:Apollo_14 }
21,Who wrote the book The pillars of the Earth?,http://dbpedia.org/resource/Ken_Follett,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri },SELECT DISTINCT ?uri WHERE { dbr:The_Pillars_of_the_Earth dbo:author ?uri }
23,Which spaceflights were launched from Baikonur?,http://dbpedia.org/resource/Orbital_Piloted_Assembly_and_Experiment_Complex,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/launchPad> res:Baikonur_Cosmodrome },SELECT DISTINCT ?uri WHERE { ?uri dbp:launchPad dbr:Baikonur_Cosmodrome }
24,Give me a list of all trumpet players that were bandleaders.,http://dbpedia.org/resource/Terumasa_Hino,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet },SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation dbr:Bandleader ; dbo:instrument dbr:Trumpet }
25,Which U.S. states are in the same timezone as Utah?,http://dbpedia.org/resource/Nebraska,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Utah dbp:timezone ?x . ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?x FILTER ( ?uri != res:Utah ) },SELECT DISTINCT ?uri WHERE { dbr:Utah dbp:timezone ?x . ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?x FILTER ( ?uri != dbr:Utah ) }
26,Which U.S. states possess gold minerals?,http://dbpedia.org/resource/Mississippi,"PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:mineral ?mineral FILTER regex(?mineral, ""gold"", ""i"") }","SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:mineral ?mineral FILTER regex(?mineral, ""gold"", ""i"") }"
27,Who is the daughter of Ingrid Bergman married to?,Joseph Daly,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Ingrid_Bergman dbo:child ?child . ?child <http://dbpedia.org/property/spouse> ?uri },SELECT DISTINCT ?uri WHERE { dbr:Ingrid_Bergman dbo:child ?child . ?child dbp:spouse ?uri }
28,How deep is Lake Placid?,12.192,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Lake_Placid_(Texas)> dbo:maximumDepth ?n },SELECT DISTINCT ?n WHERE { dbr:Lake_Placid_(Texas) dbo:maximumDepth ?n }
29,Show me all museums in London.,http://dbpedia.org/resource/Leighton_House_Museum,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Museum ; dbo:location> <http://dbpedia.org/resource/London> }
30,Which caves have more than 3 entrances?,http://dbpedia.org/resource/Ease_Gill_Caverns,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Cave> ; <http://dbpedia.org/property/entranceCount> ?entrance FILTER ( ?entrance > 3 ) },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Cave ; <http://dbpedia.org/property/entranceCount> ?entrance FILTER ( ?entrance > 3 ) }
31,Who is the tallest player of the Atlanta Falcons?,http://dbpedia.org/resource/Matt_Schaub,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Atlanta_Falcons> ; <http://dbpedia.org/ontology/height> ?h } ORDER BY DESC(?h) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri dbo:team <http://dbpedia.org/resource/Atlanta_Falcons> ; dbo:height> ?h } ORDER BY DESC(?h) OFFSET 0 LIMIT 1
32,What are the top-10 action role-playing video games according to IGN?,http://dbpedia.org/resource/Mass_Effect_2:_Lair_of_the_Shadow_Broker,SELECT DISTINCT ?uri WHERE { ?uri <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Action_role-playing_video_games> ; <http://dbpedia.org/property/ign> ?score } ORDER BY DESC(?score) LIMIT 10,SELECT DISTINCT ?uri WHERE { ?uri <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Action_role-playing_video_games> ; dbp:ign ?score } ORDER BY DESC(?score) LIMIT 10
33,Give me all writers that won the Nobel Prize in literature.,http://dbpedia.org/resource/Hermann_Hesse,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Writer ; dbo:award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }
34,Show me all basketball players that are higher than 2 meters.,http://dbpedia.org/resource/Jānis_Porziņģis,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) },SELECT DISTINCT ?uri WHERE { ?uri a dbo:BasketballPlayer ; dbo:height> ?n FILTER ( ?n > 2.0 ) }
35,When was the Statue of Liberty built?,1886-10-28,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Statue_of_Liberty> <http://dbpedia.org/property/beginningDate> ?date },SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Statue_of_Liberty> dbp:beginningDate ?date }
36,Which states border Illinois?,http://dbpedia.org/resource/Kentucky,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Illinois> <http://dbpedia.org/property/borderingstates> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Illinois> dbp:borderingstates ?uri }
37,Who developed Minecraft?,http://dbpedia.org/resource/Mojang,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Minecraft> <http://dbpedia.org/ontology/developer> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Minecraft> dbo:developer ?uri }
38,Where did Hillel Slovak die?,http://dbpedia.org/resource/Hollywood,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hillel_Slovak> <http://dbpedia.org/ontology/deathPlace> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hillel_Slovak> dbo:deathPlace ?uri }
39,What movies does Jesse Eisenberg play in?,http://dbpedia.org/resource/Batman_v_Superman:_Dawn_of_Justice,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jesse_Eisenberg> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:starring> <http://dbpedia.org/resource/Jesse_Eisenberg> }
40,Give all swimmers that were born in Moscow.,http://dbpedia.org/resource/Irena_Olevsky,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Swimmer ; dbo:birthPlace> <http://dbpedia.org/resource/Moscow> }
41,Give me all cosmonauts.,http://dbpedia.org/resource/Yury_Usachov,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> { ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Russia> } UNION { ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Soviet_Union> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut { ?uri dbo:nationality> <http://dbpedia.org/resource/Russia> } UNION { ?uri dbo:nationality> <http://dbpedia.org/resource/Soviet_Union> } }
42,Give me all Swiss non-profit organizations.,http://dbpedia.org/resource/Swiss_Medical_Students’_Association,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Switzerland> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Switzerland> } },SELECT DISTINCT ?uri WHERE { ?uri dbo:type <http://dbpedia.org/resource/Nonprofit_organization> { ?uri dbo:location> <http://dbpedia.org/resource/Switzerland> } UNION { ?uri dbo:location> ?x . ?x dbo:country> <http://dbpedia.org/resource/Switzerland> } }
43,Which presidents were born in 1945?,http://dbpedia.org/resource/Abdirahman_Farole,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/President> ; <http://dbpedia.org/ontology/birthDate> ?date FILTER regex(?date, ""^1945"") }","SELECT DISTINCT ?uri WHERE { ?uri a dbo:President ; dbo:birthDate> ?date FILTER regex(?date, ""^1945"") }"
44,What kind of music did Lou Reed play?,http://dbpedia.org/resource/Proto-punk,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lou_Reed> <http://dbpedia.org/ontology/genre> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lou_Reed> dbo:genre ?uri }
45,Where do the Red Sox play?,http://dbpedia.org/resource/Fenway_Park,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boston_Red_Sox> <http://dbpedia.org/property/ballpark> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boston_Red_Sox> dbp:ballpark ?uri }
46,Show a list of soccer clubs that play in the Bundesliga.,http://dbpedia.org/resource/Borussia_Mönchengladbach,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league> <http://dbpedia.org/resource/Bundesliga> }
47,Which volcanos in Japan erupted since 2000?,http://dbpedia.org/resource/Mount_Meakan,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Volcano> ; <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Japan> ; <http://dbpedia.org/ontology/eruptionYear> ?date FILTER ( year(?date) >= 2000 ) },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Volcano ; dbo:locatedInArea> <http://dbpedia.org/resource/Japan> ; dbo:eruptionYear> ?date FILTER ( year(?date) >= 2000 ) }
48,Which bridges cross the Seine?,http://dbpedia.org/resource/Pont_de_Normandie,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Bridge> ; <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Seine> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Bridge ; dbo:crosses> <http://dbpedia.org/resource/Seine> }
49,What is the official color of the University of Oxford?,Oxford blue,SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/University_of_Oxford> <http://dbpedia.org/ontology/officialSchoolColour> ?string },SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/University_of_Oxford> dbo:officialSchoolColour ?string }
50,How many films did Hal Roach produce?,530,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri dbo:producer <http://dbpedia.org/resource/Hal_Roach> }
51,Give me all Danish movies.,http://dbpedia.org/resource/Stolen_Spring_(film),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:country> <http://dbpedia.org/resource/Denmark> }
52,What is the most frequent cause of death?,http://dbpedia.org/resource/Myocardial_infarction,SELECT DISTINCT ?x WHERE { ?uri <http://dbpedia.org/ontology/deathCause> ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1,SELECT DISTINCT ?x WHERE { ?uri dbo:deathCause ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1
53,Who are the four youngest MVP basketball players?,http://dbpedia.org/resource/Frank_Jackson_(basketball),"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/birthDate> ?date ; <http://dbpedia.org/property/highlights> ?h FILTER regex(?h, ""MVP"") } ORDER BY DESC(?date) OFFSET 0 LIMIT 4","SELECT DISTINCT ?uri WHERE { ?uri a dbo:BasketballPlayer ; dbo:birthDate> ?date ; <http://dbpedia.org/property/highlights> ?h FILTER regex(?h, ""MVP"") } ORDER BY DESC(?date) OFFSET 0 LIMIT 4"
54,Give me all companies in Munich.,http://dbpedia.org/resource/Allianz,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Munich> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Company { ?uri dbo:location> <http://dbpedia.org/resource/Munich> } UNION { ?uri dbo:headquarter> <http://dbpedia.org/resource/Munich> } UNION { ?uri dbo:locationCity> <http://dbpedia.org/resource/Munich> } }
55,Give me the capitals of all countries that the Himalayas run through.,http://dbpedia.org/resource/Thimphu,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> dbo:country ?country . ?country dbo:capital> ?uri }
56,How many movies did Park Chan-wook direct?,15,SELECT COUNT(DISTINCT ?uri AS ?uri) WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Park_Chan-wook> . },SELECT COUNT(DISTINCT ?uri AS ?uri) WHERE { ?uri dbo:director <http://dbpedia.org/resource/Park_Chan-wook> . }
57,Which rivers flow into a German lake?,http://dbpedia.org/resource/Brüeler_Bach,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> . ?x <http://dbpedia.org/ontology/inflow> ?uri ; a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:River . ?x dbo:inflow> ?uri ; a dbo:Lake> ; dbo:country> <http://dbpedia.org/resource/Germany> }
58,How many airlines are there?,4262,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Airline }
59,Give me all islands that belong to Japan.,http://dbpedia.org/resource/Iwo_Jima,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Island ; dbo:country> <http://dbpedia.org/resource/Japan> }
60,How many inhabitants does Maribor have?,95881,SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Maribor> <http://dbpedia.org/ontology/populationTotal> ?num },SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Maribor> dbo:populationTotal ?num }
61,Give me all Apollo 14 astronauts.,http://dbpedia.org/resource/Stuart_Roosa,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> },SELECT DISTINCT ?uri WHERE { ?uri dbo:mission <http://dbpedia.org/resource/Apollo_14> }
62,Which companies have more than 1 million employees?,http://dbpedia.org/resource/Mammoth_Resource_Partners,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/numberOfEmployees> ?n } UNION { ?uri <http://dbpedia.org/property/numEmployees> ?n } FILTER ( ?n > 1000000 ) },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Company { ?uri dbo:numberOfEmployees> ?n } UNION { ?uri <http://dbpedia.org/property/numEmployees> ?n } FILTER ( ?n > 1000000 ) }
63,In which films directed by Garry Marshall was Julia Roberts starring?,http://dbpedia.org/resource/Mother's_Day_(2016_film),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> ; <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Garry_Marshall> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:starring> <http://dbpedia.org/resource/Julia_Roberts> ; dbo:director> <http://dbpedia.org/resource/Garry_Marshall> }
64,Give me all soccer clubs in the Premier League.,http://dbpedia.org/resource/2012–13_Arsenal_F.C._season,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league> <http://dbpedia.org/resource/Premier_League> }
65,What is the highest place of the Urals?,http://dbpedia.org/resource/Mount_Narodnaya,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ural_Mountains> <http://dbpedia.org/property/highest> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ural_Mountains> dbp:highest ?uri }
66,Who is the governor of Wyoming?,http://dbpedia.org/resource/Matt_Mead,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wyoming> <http://dbpedia.org/property/governor> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wyoming> dbp:governor ?uri }
67,Where did the architect of the Eiffel Tower study?,http://dbpedia.org/resource/École_Spéciale_d'Architecture,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eiffel_Tower> <http://dbpedia.org/ontology/architect> ?x . ?x <http://dbpedia.org/property/almaMater> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eiffel_Tower> dbo:architect ?x . ?x <http://dbpedia.org/property/almaMater> ?uri }
68,Give me all world heritage sites designated within the past two years.,http://dbpedia.org/resource/Castle_of_Grinzane_Cavour,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/WorldHeritageSite> . { ?uri <http://dbpedia.org/property/year> '2013'^^xsd:integer . } UNION { ?uri <http://dbpedia.org/property/year> '2014'^^xsd:integer . } },SELECT DISTINCT ?uri WHERE { ?uri rdf:type <http://dbpedia.org/ontology/WorldHeritageSite> . { ?uri <http://dbpedia.org/property/year> '2013'^^xsd:integer . } UNION { ?uri <http://dbpedia.org/property/year> '2014'^^xsd:integer . } }
69,Give me all actors who were born in Paris after 1950.,http://dbpedia.org/resource/Gaston_Dubosc,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) },SELECT DISTINCT ?uri WHERE { ?uri rdf:type <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) }
70,Which movies star both Liz Taylor and Richard Burton?,http://dbpedia.org/resource/The_Taming_of_the_Shrew_(1967_film),SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Elizabeth_Taylor> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Burton> },SELECT DISTINCT ?uri WHERE { ?uri dbo:starring <http://dbpedia.org/resource/Elizabeth_Taylor> ; dbo:starring> <http://dbpedia.org/resource/Richard_Burton> }
71,Give me all Australian nonprofit organizations.,http://dbpedia.org/resource/YourView,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } },SELECT DISTINCT ?uri WHERE { ?uri dbo:type <http://dbpedia.org/resource/Nonprofit_organization> { ?uri dbo:locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri dbo:location> ?x . ?x dbo:country> <http://dbpedia.org/resource/Australia> } }
72,Which pope succeeded John Paul II?,http://dbpedia.org/resource/Pope_Benedict_XVI,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pope_John_Paul_II> <http://dbpedia.org/property/successor> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pope_John_Paul_II> dbp:successor ?uri }
73,Give me all ESA astronauts.,http://dbpedia.org/resource/Dirk_Frimout,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }
74,Who was president of Pakistan in 1978?,http://dbpedia.org/resource/Muhammad_Zia-ul-Haq,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/President_of_Pakistan> ; <http://dbpedia.org/property/years> 1978 },SELECT DISTINCT ?uri WHERE { ?uri dbp:title <http://dbpedia.org/resource/President_of_Pakistan> ; dbp:years> 1978 }
75,Who is the owner of Rolls-Royce?,http://dbpedia.org/resource/Vickers_plc,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolls-Royce_Motors> <http://dbpedia.org/ontology/owner> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolls-Royce_Motors> dbo:owner ?uri }
76,How many museums does Paris have?,http://dbpedia.org/resource/Musée_de_l'Homme,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Museum ; dbo:location> <http://dbpedia.org/resource/Paris> }
77,Where was JFK assassinated?,http://dbpedia.org/resource/Parkland_Memorial_Hospital,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> dbo:deathPlace ?uri }
78,Give me all federal chancellors of Germany.,http://dbpedia.org/resource/Konrad_Adenauer,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/office> ""Chancellor of Germany"" } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }","SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:office> ""Chancellor of Germany"" } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }"
79,Show me everyone who was born on Halloween.,http://dbpedia.org/resource/Aaron_Osmond,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/birthDate> ?date } UNION { ?uri <http://dbpedia.org/property/birthDate> ?date } <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:birthDate> ?date } UNION { ?uri <http://dbpedia.org/property/birthDate> ?date } <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date }
80,Which beer originated in Ireland?,http://dbpedia.org/resource/Guinness,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> },SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; dbo:origin <http://dbpedia.org/resource/Beer_in_Ireland> }
81,To which countries does the Himalayan mountain system extend?,http://dbpedia.org/resource/Bhutan,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> dbo:country ?uri }
