id,question,answers,orig_query,sparql
163,Which Greek parties are pro-European?,http://dbpedia.org/resource/Union_of_Centrists,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/PoliticalParty> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Greece> ; <http://dbpedia.org/ontology/ideology> <http://dbpedia.org/resource/Pro-Europeanism> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:PoliticalParty ; dbo:country> <http://dbpedia.org/resource/Greece> ; dbo:ideology> <http://dbpedia.org/resource/Pro-Europeanism> }
164,Give me a list of all bandleaders that play trumpet.,http://dbpedia.org/resource/Terumasa_Hino,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> },SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation <http://dbpedia.org/resource/Bandleader> ; dbo:instrument> <http://dbpedia.org/resource/Trumpet> }
165,What is the second highest mountain on Earth?,http://dbpedia.org/resource/Y_Ro_Wen,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri a dbo:Mountain ; dbo:elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1
166,Is Egypts largest city also its capital?,False,ASK WHERE { <http://dbpedia.org/resource/Egypt> <http://dbpedia.org/ontology/largestCity> ?large ; <http://dbpedia.org/ontology/capital> ?capital FILTER ( ?large = ?capital ) },ASK WHERE { <http://dbpedia.org/resource/Egypt> dbo:largestCity ?large ; dbo:capital> ?capital FILTER ( ?large = ?capital ) }
167,Which rockets were launched from Baikonur?,http://dbpedia.org/resource/Energia,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Rocket> ; <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Baikonur_Cosmodrome> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Rocket ; dbo:launchSite> <http://dbpedia.org/resource/Baikonur_Cosmodrome> }
168,How many programming languages are there?,2031,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:ProgrammingLanguage }
169,Which Chess players died in the same place they were born in?,http://dbpedia.org/resource/Alessandro_Salvio,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ChessPlayer> ; <http://dbpedia.org/ontology/birthPlace> ?x ; <http://dbpedia.org/ontology/deathPlace> ?y FILTER ( ?x = ?y ) },SELECT DISTINCT ?uri WHERE { ?uri a dbo:ChessPlayer ; dbo:birthPlace> ?x ; dbo:deathPlace> ?y FILTER ( ?x = ?y ) }
170,Who is the owner of Facebook?,http://dbpedia.org/resource/Eduardo_Saverin,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Facebook> dbo:foundedBy ?uri }
171,Give me all movies with Tom Cruise.,http://dbpedia.org/resource/All_the_Right_Moves_(film),SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:starring> <http://dbpedia.org/resource/Tom_Cruise> }
172,In which U.S. state is Fort Knox located?,http://dbpedia.org/resource/Kentucky,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Fort_Knox dbo:location ?uri . ?uri dbo:country res:United_States },SELECT DISTINCT ?uri WHERE { dbr:Fort_Knox dbo:location ?uri . ?uri dbo:country dbr:United_States }
173,Give me all cities in New Jersey with more than 100000 inhabitants.,"http://dbpedia.org/resource/Newark,_New_Jersey",PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf dbr:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }
174,Which mountains are higher than the Nanga Parbat?,http://dbpedia.org/resource/Lhotse_Shar,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nanga_Parbat> <http://dbpedia.org/ontology/elevation> ?elevation . ?uri a <http://dbpedia.org/ontology/Mountain> { ?uri <http://dbpedia.org/ontology/elevation> ?otherelevation } UNION { ?uri <http://dbpedia.org/property/elevationM> ?otherelevation } FILTER ( ?otherelevation > ?elevation ) },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nanga_Parbat> dbo:elevation ?elevation . ?uri a dbo:Mountain> { ?uri dbo:elevation> ?otherelevation } UNION { ?uri <http://dbpedia.org/property/elevationM> ?otherelevation } FILTER ( ?otherelevation > ?elevation ) }
175,Give me all B-sides of the Ramones.,"""No-One Could Ever Love You More"" (Norway)",SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string },SELECT DISTINCT ?string WHERE { ?x dbo:musicalArtist <http://dbpedia.org/resource/Ramones> ; dbo:bSide> ?string }
176,What are the specialities of the UNC Health Care?,http://dbpedia.org/resource/Cancer,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/UNC_Health_Care> <http://dbpedia.org/property/speciality> ?uri },SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/UNC_Health_Care> dbp:speciality ?uri }
177,When was Olof Palme shot?,1986-2-28,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Olof_Palme> <http://dbpedia.org/ontology/deathDate> ?date },SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Olof_Palme> dbo:deathDate ?date }
178,List the seven kings of Rome.,http://dbpedia.org/resource/Tullus_Hostilius,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> },SELECT DISTINCT ?uri WHERE { ?uri dbp:title <http://dbpedia.org/resource/King_of_Rome> }
179,Give me all people that were born in Vienna and died in Berlin.,http://dbpedia.org/resource/Michael_von_Newlinsky,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> },SELECT DISTINCT ?uri WHERE { ?uri dbo:birthPlace <http://dbpedia.org/resource/Vienna> ; dbo:deathPlace> <http://dbpedia.org/resource/Berlin> }
180,Is Darth Vader Luke’s father?,True,ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> },ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> dbo:child <http://dbpedia.org/resource/Luke_Skywalker> }
181,Show me all the breweries in Australia.,http://dbpedia.org/resource/Cascade_Brewery,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Brewery> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } },SELECT DISTINCT ?uri WHERE { ?uri a dbo:Brewery { ?uri dbo:location> <http://dbpedia.org/resource/Australia> } UNION { ?uri dbo:location> ?x . ?x dbo:country> <http://dbpedia.org/resource/Australia> } }
182,Give me all films produced by Steven Spielberg with a budget of at least $80 million.,http://dbpedia.org/resource/The_Adventures_of_Tintin_(film),SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Steven_Spielberg> . ?uri <http://dbpedia.org/ontology/budget> ?b . FILTER( xsd:double(?b) >= 8.0E7 ) },SELECT DISTINCT ?uri WHERE { ?uri rdf:type <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Steven_Spielberg> . ?uri <http://dbpedia.org/ontology/budget> ?b . FILTER( xsd:double(?b) >= 8.0E7 ) }
183,Give me all soccer clubs in Spain.,http://dbpedia.org/resource/CF_Balaguer,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> { ?uri <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain> } UNION { ?uri <http://dbpedia.org/property/ground> ?ground FILTER regex(?ground, ""Spain"") } }","SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub { ?uri dbo:ground> <http://dbpedia.org/resource/Spain> } UNION { ?uri <http://dbpedia.org/property/ground> ?ground FILTER regex(?ground, ""Spain"") } }"
184,Who produced films starring Natalie Portman?,http://dbpedia.org/resource/Mike_Nichols,SELECT DISTINCT ?uri WHERE { ?film a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Natalie_Portman> ; <http://dbpedia.org/ontology/producer> ?uri },SELECT DISTINCT ?uri WHERE { ?film a dbo:Film ; dbo:starring> <http://dbpedia.org/resource/Natalie_Portman> ; dbo:producer> ?uri }
185,Give me all breeds of the German Shepherd dog.,http://dbpedia.org/resource/Mancs_(dog),SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> },SELECT DISTINCT ?uri WHERE { ?uri dbp:breed <http://dbpedia.org/resource/German_Shepherd> }
186,Who is the heaviest player of the Chicago Bulls?,http://dbpedia.org/resource/Roberto_Dueñas,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/ontology/weight> ?num { ?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/ontology/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person ; dbo:weight> ?num { ?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri dbo:draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1
187,Which languages are spoken in Estonia?,http://dbpedia.org/resource/Laiuse_Romani_language,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spokenIn> <http://dbpedia.org/resource/Estonia> },SELECT DISTINCT ?uri WHERE { ?uri dbo:spokenIn <http://dbpedia.org/resource/Estonia> }
188,What is the largest country in the world?,http://dbpedia.org/resource/Organization_for_Security_and_Co-operation_in_Europe,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:areaTotal ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:areaTotal ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1
189,What is the largest city in america?,http://dbpedia.org/resource/New_York_City,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?lcity WHERE { dbr:United_States dbo:largestCity ?lcity },SELECT ?lcity WHERE { dbr:United_States dbo:largestCity ?lcity }
190,Who was the pope that founded the Vatican Television?,http://dbpedia.org/resource/Pope_John_Paul_II,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:Pope . res:Vatican_Television_Center dbo:foundedBy ?uri },SELECT ?uri WHERE { ?uri rdf:type dbo:Pope . dbr:Vatican_Television_Center dbo:foundedBy ?uri }
191,Who discovered Ceres?,http://dbpedia.org/resource/Giuseppe_Piazzi,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ceres_(dwarf_planet)> dbo:discoverer ?uri },SELECT DISTINCT ?uri WHERE { dbr:Ceres_(dwarf_planet) dbo:discoverer ?uri }
192,Who is the king of the Netherlands?,http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Netherlands dbo:leader ?uri . ?uri rdf:type dbo:Royalty },SELECT DISTINCT ?uri WHERE { dbr:Netherlands dbo:leader ?uri . ?uri rdf:type dbo:Royalty }
193,Is Cola a beverage?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage },ASK WHERE { dbr:Cola rdf:type dbo:Beverage }
194,What is the alma mater of the chancellor of Germany Angela Merkel?,http://dbpedia.org/resource/Leipzig_University,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Almamater WHERE { dbr:Angela_Merkel dbo:almaMater ?Almamater },SELECT ?Almamater WHERE { dbr:Angela_Merkel dbo:almaMater ?Almamater }
195,Who wrote the book Les Piliers de la terre?,http://dbpedia.org/resource/Ken_Follett,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri },SELECT DISTINCT ?uri WHERE { dbr:The_Pillars_of_the_Earth dbo:author ?uri }
196,Which airports does Yeti Airlines serve?,http://dbpedia.org/resource/Pokhara,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Yeti_Airlines dbo:targetAirport ?uri },SELECT DISTINCT ?uri WHERE { dbr:Yeti_Airlines dbo:targetAirport ?uri }
197,Where is the birthplace of Goethe?,http://dbpedia.org/resource/Holy_Roman_Empire,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Goethe WHERE { dbr:Johann_Wolfgang_von_Goethe dbo:birthPlace ?Goethe },SELECT ?Goethe WHERE { dbr:Johann_Wolfgang_von_Goethe dbo:birthPlace ?Goethe }
198,Was the Cuban Missile Crisis earlier than the Bay of Pigs Invasion?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Cuban_Missile_Crisis dbo:date ?x . res:Bay_of_Pigs_Invasion dbo:date ?y FILTER ( ?x < ?y ) },ASK WHERE { dbr:Cuban_Missile_Crisis dbo:date ?x . dbr:Bay_of_Pigs_Invasion dbo:date ?y FILTER ( ?x < ?y ) }
199,Which ingredients do I need for carrot cake?,http://dbpedia.org/resource/Egg_(food),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Carrot_cake dbo:ingredient ?uri },SELECT DISTINCT ?uri WHERE { dbr:Carrot_cake dbo:ingredient ?uri }
200,Who created Wikipedia?,http://dbpedia.org/resource/Jimmy_Wales,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Wikipedia dbo:author ?uri },SELECT DISTINCT ?uri WHERE { dbr:Wikipedia dbo:author ?uri }
201,What is the highest mountain in Saxony Germany?,http://dbpedia.org/resource/Fichtelberg,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?m WHERE { ?m dbo:mountainRange dbr:Ore_Mountains ; dbo:elevation ?height } ORDER BY DESC(?height) LIMIT 1,SELECT ?m WHERE { ?m dbo:mountainRange dbr:Ore_Mountains ; dbo:elevation ?height } ORDER BY DESC(?height) LIMIT 1
202,Who is the current federal minister of finance in Germany?,http://dbpedia.org/resource/Wolfgang_Schäuble,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?leader WHERE { <http://dbpedia.org/resource/Federal_Ministry_of_Finance_(Germany)> dbo:leader ?leader },SELECT ?leader WHERE { dbr:Federal_Ministry_of_Finance_(Germany) dbo:leader ?leader }
203,In which country is Mecca located?,http://dbpedia.org/resource/Saudi_Arabia,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Mecca dbo:country ?uri },SELECT DISTINCT ?uri WHERE { dbr:Mecca dbo:country ?uri }
204,Who played Gus Fring in Breaking Bad?,http://dbpedia.org/resource/Giancarlo_Esposito,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Gus_Fring dbo:portrayer ?uri },SELECT DISTINCT ?uri WHERE { dbr:Gus_Fring dbo:portrayer ?uri }
205,In which country does the Nile start?,http://dbpedia.org/resource/Rwanda,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Nile dbo:sourceCountry ?uri },SELECT DISTINCT ?uri WHERE { dbr:Nile dbo:sourceCountry ?uri }
206,In which state Penn State University is located?,http://dbpedia.org/resource/Pennsylvania,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?s WHERE { dbr:Pennsylvania_State_University dbo:state ?s },SELECT ?s WHERE { dbr:Pennsylvania_State_University dbo:state ?s }
207,What is the biggest stadium in Spain?,http://dbpedia.org/resource/Vicente_Calderón_Stadium,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Stadium ; dbo:location res:Spain ; dbo:seatingCapacity ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Stadium ; dbo:location dbr:Spain ; dbo:seatingCapacity ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1
208,Who is the coach of Ankara's ice hockey team?,http://dbpedia.org/resource/İbrahim_Oğuz,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:city res:Ankara ; dbo:league res:Turkish_Ice_Hockey_First_League ; dbo:coach ?uri },SELECT DISTINCT ?uri WHERE { ?x dbo:city dbr:Ankara ; dbo:league dbr:Turkish_Ice_Hockey_First_League ; dbo:coach ?uri }
209,How large is the area of UK?,2.42495e+11,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?area WHERE { dbr:United_Kingdom dbo:areaTotal ?area },SELECT ?area WHERE { dbr:United_Kingdom dbo:areaTotal ?area }
210,Who created Batman?,http://dbpedia.org/resource/Bob_Kane,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri },SELECT DISTINCT ?uri WHERE { dbr:Batman dbo:creator ?uri }
211,Was Sigmund Freud married?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { dbr:Sigmund_Freud dbo:spouse ?uri },ASK WHERE { dbr:Sigmund_Freud dbo:spouse ?uri }
212,Who are the developers of DBpedia?,http://dbpedia.org/resource/University_of_Mannheim,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:DBpedia dbo:developer ?uri },SELECT DISTINCT ?uri WHERE { dbr:DBpedia dbo:developer ?uri }
213,Give me all movies directed by Francis Ford Coppola.,http://dbpedia.org/resource/The_Rain_People,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director dbr:Francis_Ford_Coppola }
214,Are tree frogs a type of amphibian?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Hylidae dbo:class res:Amphibian },ASK WHERE { dbr:Hylidae dbo:class dbr:Amphibian }
215,What is the location of the Houses of Parliament?,http://dbpedia.org/resource/London,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?uri WHERE { res:Palace_of_Westminster dbo:location ?uri },SELECT ?uri WHERE { dbr:Palace_of_Westminster dbo:location ?uri }
216,how much is the elevation of Düsseldorf Airport ?,44.8,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ele WHERE { dbr:Düsseldorf_Airport dbo:elevation ?ele } LIMIT 1,SELECT ?ele WHERE { dbr:Düsseldorf_Airport dbo:elevation ?ele } LIMIT 1
217,How much is the population of mexico city ?,8918653,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Mexico_City WHERE { dbr:Mexico_City dbo:populationTotal ?Mexico_City },SELECT ?Mexico_City WHERE { dbr:Mexico_City dbo:populationTotal ?Mexico_City }
218,when was the founding date of french fifth republic?,1958-10-04,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ff WHERE { dbr:French_Fifth_Republic dbo:foundingDate ?ff },SELECT ?ff WHERE { dbr:French_Fifth_Republic dbo:foundingDate ?ff }
219,Who was the first King of England?,http://dbpedia.org/resource/Harold_Godwinson,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Royalty ; rdf:type yago:WikicatEnglishMonarchs ; dbo:activeYearsStartYear ?date } ORDER BY ASC(?date) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Royalty ; rdf:type yago:WikicatEnglishMonarchs ; dbo:activeYearsStartYear ?date } ORDER BY ASC(?date) OFFSET 0 LIMIT 1
220,Who is the editor of Forbes?,http://dbpedia.org/resource/Steve_Forbes,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Forbes dbo:editor ?uri },SELECT DISTINCT ?uri WHERE { dbr:Forbes dbo:editor ?uri }
221,Which awards did Douglas Hofstadter win?,http://dbpedia.org/resource/American_Academy_of_Arts_and_Sciences,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Douglas_Hofstadter dbo:award ?uri },SELECT DISTINCT ?uri WHERE { dbr:Douglas_Hofstadter dbo:award ?uri }
222,Who is the youngest Darts player?,http://dbpedia.org/resource/Max_Hopp,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:DartsPlayer ; dbo:birthDate ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:DartsPlayer ; dbo:birthDate ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1
223,Is horse racing a sport?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { dbr:Horse_racing rdf:type dbo:Sport },ASK WHERE { dbr:Horse_racing rdf:type dbo:Sport }
224,Which river does the Brooklyn Bridge cross?,http://dbpedia.org/resource/East_River,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Brooklyn_Bridge dbo:crosses ?uri },SELECT DISTINCT ?uri WHERE { dbr:Brooklyn_Bridge dbo:crosses ?uri }
225,How many people live in Poland?,38483957,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Poland dbo:populationTotal ?uri },SELECT DISTINCT ?uri WHERE { dbr:Poland dbo:populationTotal ?uri }
226,When was the last episode of the TV series Friends aired?,2004-05-06,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?date WHERE { dbr:Friends dbo:completionDate ?date },SELECT ?date WHERE { dbr:Friends dbo:completionDate ?date }
227,Is the wife of president Obama called Michelle?,True,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Barack_Obama dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Michelle"") }","ASK WHERE { dbr:Barack_Obama dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Michelle"") }"
229,Who is 8th president of US?,Martin Van Buren,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?name WHERE { dbr:8th_President_of_the_United_States dbo:wikiPageRedirects ?link . ?link dbp:name ?name },SELECT ?name WHERE { dbr:8th_President_of_the_United_States dbo:wikiPageRedirects ?link . ?link dbp:name ?name }
230,how much is the total population of  european union?,510056011,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?europop WHERE { dbr:European_Union dbo:populationTotal ?europop },SELECT ?europop WHERE { dbr:European_Union dbo:populationTotal ?europop }
231,Give me all launch pads operated by NASA.,http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator dbr:NASA }
232,Who developed the video game World of Warcraft?,http://dbpedia.org/resource/Blizzard_Entertainment,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:World_of_Warcraft dbo:developer ?uri },SELECT DISTINCT ?uri WHERE { dbr:World_of_Warcraft dbo:developer ?uri }
233,What is the birth name of Adele?,Adele Laurie Blue Adkins,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?bn WHERE { dbr:Adele dbo:birthName ?bn },SELECT ?bn WHERE { dbr:Adele dbo:birthName ?bn }
234,What is the population of Cairo?,10230350,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?pop WHERE { dbr:Cairo dbo:populationTotal ?pop },SELECT ?pop WHERE { dbr:Cairo dbo:populationTotal ?pop }
235,Is Frank Herbert still alive?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { OPTIONAL { res:Frank_Herbert dbo:deathDate ?date } FILTER ( ! bound(?date) ) },ASK WHERE { OPTIONAL { dbr:Frank_Herbert dbo:deathDate ?date } FILTER ( ! bound(?date) ) }
236,What is the last work of Dan Brown?,http://dbpedia.org/resource/Inferno_(Brown_novel),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?book WHERE { { ?book dbo:author dbr:Dan_Brown . ?book dbp:releaseDate ?date } UNION { ?book dbo:author dbr:Dan_Brown . ?book dbo:publicationDate ?date} } ORDER BY DESC(xsd:date(?date)) LIMIT 1,SELECT ?book WHERE { { ?book dbo:author dbr:Dan_Brown . ?book dbp:releaseDate ?date } UNION { ?book dbo:author dbr:Dan_Brown . ?book dbo:publicationDate ?date} } ORDER BY DESC(xsd:date(?date)) LIMIT 1
237,Where is Sungkyunkwan University?,http://dbpedia.org/resource/South_Korea,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT DISTINCT ?country WHERE { dbr:Sungkyunkwan_University dbo:city ?city ; dbo:country ?country },SELECT DISTINCT ?country WHERE { dbr:Sungkyunkwan_University dbo:city ?city ; dbo:country ?country }
238,Who is the author of the interpretation of dreams?,http://dbpedia.org/resource/Sigmund_Freud,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Author WHERE { dbr:The_Interpretation_of_Dreams dbo:author ?Author },SELECT ?Author WHERE { dbr:The_Interpretation_of_Dreams dbo:author ?Author }
239,When was the death  of  Shakespeare?,1616-04-23,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?x WHERE { dbr:William_Shakespeare dbo:deathDate ?x } LIMIT 1,SELECT ?x WHERE { dbr:William_Shakespeare dbo:deathDate ?x } LIMIT 1
241,Who developed Slack?,http://dbpedia.org/resource/Slack_Technologies,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:product <http://dbpedia.org/resource/Slack_(software)> },SELECT DISTINCT ?uri WHERE { ?uri dbo:product dbr:Slack_(software) }
242,Where is the origin of Carolina reaper?,"http://dbpedia.org/resource/Fort_Mill,_South_Carolina",PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { dbr:Carolina_Reaper dbo:origin ?uri},SELECT ?uri WHERE { dbr:Carolina_Reaper dbo:origin ?uri}
243,In which year was Rachel Stevens born?,1978,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Rachel_Stevens dbo:birthYear ?uri },SELECT DISTINCT ?uri WHERE { dbr:Rachel_Stevens dbo:birthYear ?uri }
244,How often did Jane Fonda marry?,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Jane_Fonda dbo:spouse ?uri },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { dbr:Jane_Fonda dbo:spouse ?uri }
245,Was the wife of president Lincoln called Mary?,True,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Abraham_Lincoln dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Mary"") }","ASK WHERE { dbr:Abraham_Lincoln dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Mary"") }"
246,Which cities does the Weser flow through?,http://dbpedia.org/resource/Fulda_(river),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Weser dbo:city ?uri },SELECT DISTINCT ?uri WHERE { dbr:Weser dbo:city ?uri }
247,In which programming language is GIMP written?,http://dbpedia.org/resource/C_(programming_language),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:GIMP dbo:programmingLanguage ?uri },SELECT DISTINCT ?uri WHERE { dbr:GIMP dbo:programmingLanguage ?uri }
248,Which university did Angela Merkel attend?,http://dbpedia.org/resource/Leipzig_University,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?university WHERE { res:Angela_Merkel dbo:almaMater ?university },SELECT DISTINCT ?university WHERE { dbr:Angela_Merkel dbo:almaMater ?university }
249,List all the musicals with music by Elton John.,http://dbpedia.org/resource/The_Lion_King_(musical),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy dbr:Elton_John }
250,How many Aldi stores are there?,9600,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?number WHERE { res:Aldi dbo:numberOfLocations ?number },SELECT DISTINCT ?number WHERE { dbr:Aldi dbo:numberOfLocations ?number }
251,What is the longest river in the world?,http://dbpedia.org/resource/Irtysh_River,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:BodyOfWater ; dbo:length ?length } ORDER BY DESC(?length) LIMIT 1,SELECT ?uri WHERE { ?uri rdf:type dbo:BodyOfWater ; dbo:length ?length } ORDER BY DESC(?length) LIMIT 1
252,When was John Adams born?,1735-10-19,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:John_Adams dbo:birthDate ?date },SELECT DISTINCT ?date WHERE { dbr:John_Adams dbo:birthDate ?date }
