id,question,answers,orig_query,sparql
355,To which artistic movement did the painter of The Three Dancers belong?,http://dbpedia.org/resource/Cubism,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Three_Dancers dbo:author ?person . ?person dbo:movement ?uri },SELECT DISTINCT ?uri WHERE { dbr:The_Three_Dancers dbo:author ?person . ?person dbo:movement ?uri }
356,When did Operation Overlord commence?,1944-08-30,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?d WHERE { res:Operation_Overlord dbo:date ?d },SELECT DISTINCT ?d WHERE { dbr:Operation_Overlord dbo:date ?d }
357,What is the bridge with the longest span?,http://dbpedia.org/resource/Overseas_Highway,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Bridge ; dbo:mainspan ?s } ORDER BY DESC(?s) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Bridge ; dbo:mainspan ?s } ORDER BY DESC(?s) OFFSET 0 LIMIT 1
358,Is there a video game called Battle Chess?,True,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?uri rdf:type dbo:VideoGame ; rdfs:label ""Battle Chess""@en }","ASK WHERE { ?uri rdf:type dbo:VideoGame ; rdfs:label ""Battle Chess""@en }"
359,Who was buried in the Great Pyramid of Giza?,http://dbpedia.org/resource/Hetepheres_II,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { ?uri dbo:restingPlace dbr:Great_Pyramid_of_Giza },SELECT ?uri WHERE { ?uri dbo:restingPlace dbr:Great_Pyramid_of_Giza }
360,Does the Ford Motor Company have a manufacturing plant in Malaysia?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { ?uri dbo:assembly dbr:Malaysia ; dbo:manufacturer dbr:Ford_Motor_Company },ASK WHERE { ?uri dbo:assembly dbr:Malaysia ; dbo:manufacturer dbr:Ford_Motor_Company }
361,Did Socrates influence Aristotle?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aristotle dbo:influencedBy res:Socrates },ASK WHERE { dbr:Aristotle dbo:influencedBy dbr:Socrates }
362,How many children did Benjamin Franklin have?,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Benjamin_Franklin dbo:child ?uri },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { dbr:Benjamin_Franklin dbo:child ?uri }
363,How tall is Michael Jordan?,1.9812,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Michael_Jordan dbo:height ?num },SELECT DISTINCT ?num WHERE { dbr:Michael_Jordan dbo:height ?num }
364,In which UK city are the headquarters of the MI6?,http://dbpedia.org/resource/London,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Secret_Intelligence_Service dbo:headquarter ?uri . ?uri dbo:country res:United_Kingdom },SELECT DISTINCT ?uri WHERE { dbr:Secret_Intelligence_Service dbo:headquarter ?uri . ?uri dbo:country dbr:United_Kingdom }
365,Who created Family Guy?,http://dbpedia.org/resource/Seth_MacFarlane,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Family_Guy dbo:creator ?uri },SELECT DISTINCT ?uri WHERE { dbr:Family_Guy dbo:creator ?uri }
366,In which city does the Chile Route 68 end?,http://dbpedia.org/resource/Valparaíso,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Chile_Route_68 dbo:routeEnd ?uri },SELECT DISTINCT ?uri WHERE { dbr:Chile_Route_68 dbo:routeEnd ?uri }
367,Give me the grandchildren of Elvis Presley.,http://dbpedia.org/resource/Riley_Keough,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri },SELECT DISTINCT ?uri WHERE { dbr:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }
368,When did the Ming dynasty dissolve?,1644-04-25,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Ming_dynasty dbo:dissolutionDate ?date },SELECT DISTINCT ?date WHERE { dbr:Ming_dynasty dbo:dissolutionDate ?date }
369,In which military conflicts did Lawrence of Arabia participate?,http://dbpedia.org/resource/Battle_of_Aqaba,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:T._E._Lawrence dbo:battle ?uri },SELECT DISTINCT ?uri WHERE { dbr:T._E._Lawrence dbo:battle ?uri }
370,What is the timezone in San Pedro de Atacama?,http://dbpedia.org/resource/Time_in_Chile,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:San_Pedro_de_Atacama dbo:timeZone ?uri },SELECT DISTINCT ?uri WHERE { dbr:San_Pedro_de_Atacama dbo:timeZone ?uri }
371,Give me all books by William Goldman with more than 300 pages.,http://dbpedia.org/resource/Marathon_Man_(novel),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author dbr:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }
372,What did Bruce Carver die from?,http://dbpedia.org/resource/Cancer,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Carver dbo:deathCause ?uri },SELECT DISTINCT ?uri WHERE { dbr:Bruce_Carver dbo:deathCause ?uri }
373,Which subsidiary of Lufthansa serves both Dortmund and Berlin Tegel?,http://dbpedia.org/resource/Germanwings,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Lufthansa dbo:subsidiary ?uri . ?uri dbo:targetAirport res:Dortmund_Airport ; dbo:targetAirport res:Berlin_Tegel_Airport },SELECT DISTINCT ?uri WHERE { dbr:Lufthansa dbo:subsidiary ?uri . ?uri dbo:targetAirport dbr:Dortmund_Airport ; dbo:targetAirport dbr:Berlin_Tegel_Airport }
374,Does Abraham Lincoln's death place have a website?,False,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Abraham_Lincoln dbo:deathPlace ?p . ?p dbo:website ?w },ASK WHERE { dbr:Abraham_Lincoln dbo:deathPlace ?p . ?p dbo:website ?w }
375,Did Elvis Presley have children?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Elvis_Presley dbo:child ?uri },ASK WHERE { dbr:Elvis_Presley dbo:child ?uri }
376,Is Michelle Obama the wife of Barack Obama?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Barack_Obama dbo:spouse res:Michelle_Obama },ASK WHERE { dbr:Barack_Obama dbo:spouse dbr:Michelle_Obama }
377,In which city does Sylvester Stallone live?,"http://dbpedia.org/resource/Beverly_Hills,_California",PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City . res:Sylvester_Stallone dbo:residence ?uri },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City . dbr:Sylvester_Stallone dbo:residence ?uri }
378,Which books by Kerouac were published by Viking Press?,http://dbpedia.org/resource/On_the_Road,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:publisher res:Viking_Press ; dbo:author res:Jack_Kerouac },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:publisher dbr:Viking_Press ; dbo:author dbr:Jack_Kerouac }
379,Who wrote the song Hotel California?,http://dbpedia.org/resource/Don_Felder,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Hotel_California dbo:writer ?uri },SELECT DISTINCT ?uri WHERE { dbr:Hotel_California dbo:writer ?uri }
380,What is the capital of Canada?,http://dbpedia.org/resource/Ottawa,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Canada dbo:capital ?uri },SELECT DISTINCT ?uri WHERE { dbr:Canada dbo:capital ?uri }
381,Who is the mayor of Tel Aviv?,http://dbpedia.org/resource/Ron_Huldai,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Tel_Aviv dbo:leaderName ?uri },SELECT DISTINCT ?uri WHERE { dbr:Tel_Aviv dbo:leaderName ?uri }
382,What form of government does Russia have?,http://dbpedia.org/resource/Federalism,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Russia dbo:governmentType ?uri },SELECT DISTINCT ?uri WHERE { dbr:Russia dbo:governmentType ?uri }
383,Show me the book that Muhammad Ali wrote.,http://dbpedia.org/resource/The_Greatest:_My_Own_Story,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author dbr:Muhammad_Ali }
384,Who was the first to climb Mount Everest?,http://dbpedia.org/resource/Tenzing_Norgay,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Mount_Everest dbo:firstAscentPerson ?uri },SELECT DISTINCT ?uri WHERE { dbr:Mount_Everest dbo:firstAscentPerson ?uri }
385,How many languages are spoken in Colombia?,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri rdf:type dbo:Language . res:Colombia dbo:language ?uri },SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri rdf:type dbo:Language . dbr:Colombia dbo:language ?uri }
386,What is the currency of the Czech Republic?,http://dbpedia.org/resource/Czech_koruna,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Czech_Republic dbo:currency ?uri },SELECT DISTINCT ?uri WHERE { dbr:Czech_Republic dbo:currency ?uri }
387,Where in France is sparkling wine produced?,http://dbpedia.org/resource/Loire_Valley_(wine),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:wineProduced res:Sparkling_wine ; dbo:location res:France },SELECT DISTINCT ?uri WHERE { ?uri dbo:wineProduced dbr:Sparkling_wine ; dbo:location dbr:France }
388,When did Boris Becker end his active career?,1999-06-25,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?d WHERE { res:Boris_Becker dbo:activeYearsEndDate ?d },SELECT DISTINCT ?d WHERE { dbr:Boris_Becker dbo:activeYearsEndDate ?d }
389,Which movies starring Mickey Rourke were directed by Guy Ritchie?,http://dbpedia.org/resource/The_Hire,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Mickey_Rourke ; dbo:director res:Guy_Ritchie },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring dbr:Mickey_Rourke ; dbo:director dbr:Guy_Ritchie }
390,In which films did Julia Roberts as well as Richard Gere play?,http://dbpedia.org/resource/Runaway_Bride_(film),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Julia_Roberts ; dbo:starring res:Richard_Gere },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring dbr:Julia_Roberts ; dbo:starring dbr:Richard_Gere }
391,Show me Hemingway's autobiography.,http://dbpedia.org/resource/A_Moveable_Feast,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography },SELECT DISTINCT ?uri WHERE { ?uri dbo:author dbr:Ernest_Hemingway ; dbo:literaryGenre dbr:Autobiography }
392,How tall is Amazon Eve?,2.02,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?height WHERE { res:Amazon_Eve dbo:height ?height },SELECT DISTINCT ?height WHERE { dbr:Amazon_Eve dbo:height ?height }
393,What are the five boroughs of New York?,http://dbpedia.org/resource/Queens,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:governmentType <http://dbpedia.org/resource/Borough_(New_York_City)> },SELECT DISTINCT ?uri WHERE { ?uri dbo:governmentType dbr:Borough_(New_York_City) }
394,Give me all Canadian Grunge record labels.,http://dbpedia.org/resource/Murderecords,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre dbr:Grunge ; dbo:country dbr:Canada }
395,In which country does the Ganges start?,http://dbpedia.org/resource/India,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Ganges dbo:sourceCountry ?uri },SELECT DISTINCT ?uri WHERE { dbr:Ganges dbo:sourceCountry ?uri }
396,Who is the founder of Penguin Books?,http://dbpedia.org/resource/Allen_Lane,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Penguin_Books dbo:founder ?uri },SELECT DISTINCT ?uri WHERE { dbr:Penguin_Books dbo:founder ?uri }
397,Who wrote the Game of Thrones theme?,http://dbpedia.org/resource/Ramin_Djawadi,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Game_of_Thrones dbo:composer ?uri },SELECT DISTINCT ?uri WHERE { dbr:Game_of_Thrones dbo:composer ?uri }
398,Who is the president of Eritrea?,http://dbpedia.org/resource/Isaias_Afwerki,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Eritrea dbo:leader ?uri ; dbo:leaderTitle ""President""@en }","SELECT DISTINCT ?uri WHERE { dbr:Eritrea dbo:leader ?uri ; dbo:leaderTitle ""President""@en }"
399,In which city did John F. Kennedy die?,http://dbpedia.org/resource/Dallas,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:deathPlace ?uri . ?uri rdf:type dbo:City },SELECT DISTINCT ?uri WHERE { dbr:John_F._Kennedy dbo:deathPlace ?uri . ?uri rdf:type dbo:City }
400,What is the highest mountain in Australia?,http://dbpedia.org/resource/Mawson_Peak,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Australia ; dbo:elevation ?elevation } ORDER BY DESC(?elevation) LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea dbr:Australia ; dbo:elevation ?elevation } ORDER BY DESC(?elevation) LIMIT 1
401,Who writes the Farmers' Almanac?,Sandi Duncan,PREFIX dbp: <http://dbpedia.org/property/> SELECT ?uri WHERE { <http://dbpedia.org/resource/Farmers'_Almanac> dbp:editor ?uri },SELECT ?uri WHERE { dbr:Farmers'_Almanac dbp:editor ?uri }
402,Give me the currency of China.,http://dbpedia.org/resource/Renminbi,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri },SELECT DISTINCT ?uri WHERE { dbr:China dbo:currency ?uri }
403,Give me all Swedish oceanographers.,http://dbpedia.org/resource/Vagn_Walfrid_Ekman,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden },SELECT DISTINCT ?uri WHERE { ?uri dbo:field dbr:Oceanography ; dbo:birthPlace dbr:Sweden }
404,In which city are the headquarters of the United Nations?,http://dbpedia.org/resource/New_York_City,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Headquarters_of_the_United_Nations dbo:location ?uri . ?uri rdf:type dbo:City },SELECT DISTINCT ?uri WHERE { dbr:Headquarters_of_the_United_Nations dbo:location ?uri . ?uri rdf:type dbo:City }
405,Is Rita Wilson the wife of Tom Hanks?,True,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Tom_Hanks dbo:spouse res:Rita_Wilson },ASK WHERE { dbr:Tom_Hanks dbo:spouse dbr:Rita_Wilson }
406,In which countries do people speak Japanese?,http://dbpedia.org/resource/Japan,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:language res:Japanese_language },SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:language dbr:Japanese_language }
407,Which of Tim Burton's films had the highest budget?,http://dbpedia.org/resource/Big_Eyes,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:director res:Tim_Burton ; dbo:budget ?b } ORDER BY ?b OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri dbo:director dbr:Tim_Burton ; dbo:budget ?b } ORDER BY ?b OFFSET 0 LIMIT 1
408,Which museum in New York has the most visitors?,http://dbpedia.org/resource/Metropolitan_Museum_of_Art,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Museum ; dbo:location res:New_York_City ; dbo:numberOfVisitors ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Museum ; dbo:location dbr:New_York_City ; dbo:numberOfVisitors ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1
409,What was the first Queen album?,http://dbpedia.org/resource/Queen_(Queen_album),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Album ; dbo:artist <http://dbpedia.org/resource/Queen_(band)> ; dbo:releaseDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Album ; dbo:artist dbr:Queen_(band) ; dbo:releaseDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1
410,What was the first name of the band Queens of the Stone Age?,Gamma Ray (1996–1997),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?name WHERE { res:Queens_of_the_Stone_Age dbo:alias ?name },SELECT DISTINCT ?name WHERE { dbr:Queens_of_the_Stone_Age dbo:alias ?name }
411,What was the last movie with Alec Guinness?,http://dbpedia.org/resource/Kafka_(film),PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Alec_Guinness ; dbo:releaseDate ?date } ORDER BY DESC(?date) LIMIT 1,SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring dbr:Alec_Guinness ; dbo:releaseDate ?date } ORDER BY DESC(?date) LIMIT 1
412,Give me all actors starring in Last Action Hero.,http://dbpedia.org/resource/Tom_Noonan,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri },SELECT DISTINCT ?uri WHERE { dbr:Last_Action_Hero dbo:starring ?uri }
413,Who discovered Pluto?,http://dbpedia.org/resource/Clyde_Tombaugh,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { dbr:Pluto dbo:discoverer ?uri },SELECT ?uri WHERE { dbr:Pluto dbo:discoverer ?uri }
